{"con_id":"libertycon2015","lat":35.036988,"lon":-85.306965,"name":"LibertyCon","updated":"2016-06-20T18:01:05.157Z","guests":[{"con_id":"libertycon2015","title":"Author","name":"John Ringo","guest_id":"3","bio":"John Ringo&#39;s science fiction is action-oriented and abounding in characters to root for. He is the creator of the <em>New York Times</em> best-selling military science fiction series The Posleen Wars, with over one million copies in print. Ringo is also the author of the far-future science fiction adventure saga, The Council War. In addition to breaking new ground with hard-hitting contemporary fantasies <em>Princess of Wands</em> and <em>Queen of Wands</em>, Ringo created he nationally best-selling techno-thriller Ghost series, as well as military techno-thriller <em>The Last Centurion</em>, which was also a national bestseller. His latest space-based science fiction includes the Troy Rising series. Most recently, <em>Under a Graveyard Sky</em> is the debut novel in science-based zombie saga, Black Tide Rising.\nA veteran of the U.S. Army&#39;s 82<sup>nd</sup> Airborne, Ringo brings firsthand knowledge of military operations to his fiction.","image":"ringo_john.jpg","event_list":["48","99","130","179","203","226","263","350","358","359","403"]},{"con_id":"libertycon2015","title":"Artist","name":"Michael Bielaczyc","guest_id":"5","bio":"Michael Bielaczyc has been making art his whole life. He has been selling and showing work since 1995, when he self published his own comic book. Going back to college at 25, he decided that art was going to be his main focus in life. In 2001, he started an art company, Aradani Studios, with his brother Paul. Together they have shown and worked in shows across America selling both their artwork and costuming. While Michael has worked for such popular role-playing franchises as Dragonlance and Castlemourn, his real passion is for his personal work. He works in mediums from oil paint to latex prosthetics, video to graphite. You can see his work at www.michaelbielaczyc.com .","image":"bielaczyc_michael.jpg","event_list":["32","92","205","250","261","419"]},{"con_id":"libertycon2015","title":"Artist","name":"Paul Bielaczyc","guest_id":"6","bio":"Paul Bielaczyc in his own words: &quot;I have been drawing and whatnot since as long as I can remember. Any spot in my school notebooks that didn&#039;t have notes were filled with sketches. I drew mostly from the D&D adventures that my brother ran, as well as the fantasy books I was reading. I did a few pieces based on Terry Brooks&#039; Shannara series, but focusing on being a nerd, I didn&#039;t have much time for art in high school.\nWhen I got to college I dual majored in Computer Science and Art History. I minored in Studio Art, and took as many art classes as my schedule allowed. I seemed to be pursuing a career in art or art education, but decided to try graduate school in Computer Science. I graduated in 2004 with a Master&#039;s in CS, but again switched paths and returned to my art interests. Mike, my brother, and I co-own Aradani Studios, a costuming and art company that we founded in 2002. We travel mostly in the Southeast United States, to various conventions and Renaissance Festivals, selling our art, and our ears.\nI currently call Nashville, TN my home, and don&#039;t see that changing for quite some time. This is where my friends, my family, and my career is. When I first posted this bio, I said that, &quot;I still have no idea what I want to do with my life.&quot; Well, in those 4 years that I wrote that, I think I have found my calling. At the age of 26, I won the most prestigious fantasy art award there is, the Chesley Award. Mike and I have slowly but steadily grown this business into something that now employees other people! And most importantly, I love what I do, and I truly enjoy being able to talk about my art with people, and have a dialogue with them.&quot;","image":"bielaczyc_paul.jpg","event_list":["32","92","205","250","419"]},{"con_id":"libertycon2015","title":"Author","name":"Michael Z. Williamson","guest_id":"7","bio":"Michael Z. Williamson is an immigrant from the UK and Canada, a retired veteran of the USAF and US Army, a writer of things SF-ey, fantasy and techno-ey, a bladesmith and a firearms enthusiast. He has multiple novels with Baen, three with HarperCollins, dozens of shorts and articles in magazines and sites all over, and has consulted and served as armorer for Discovery and Outdoor Channel productions. He&#039;s also Editor-at-Large of Survivalblog. When not writing, he&#039;s a craftsman and purveyor of SharpPointyThings.com, and tests and reviews firearms and other outdoor gear for manufacturers. His new collection &#039;Tour of Duty&quot; will be available from Baen Books in August.","image":"williamson_michael.jpg","event_list":["14","72","99","350","358","359","376"]},{"con_id":"libertycon2015","title":"Author / Publisher","name":"Toni Weisskopf","guest_id":"8","bio":"Toni Weisskopf is publisher of Baen Books. She has worked with such authors as David Weber, David Drake, Lois McMaster Bujold, Eric Flint, John Ringo, Sarah A. Hoyt, Larry Corriea, and many others. With Josepha Sherman she compiled and annotated the definitive volume of subversive children&#039;s folklore, Greasy Grimy Gopher Guts, published by August House. For Baen she&#039;s edited three original hard sf anthologies: Cosmic Stories: Adventures in Sol System, Cosmic Stories: Adventures in Far Futures and Transhuman, with sf author Mark L. Van Name.\nBaen is also known for its innovative e-publishing program, which has expanded under Weisskopf&#039;s leadership to include not only titles published by Baen, but also titles from other publishers, all without DRM.\nWeisskopf is a graduate of Oberlin College with a degree in anthropology. The widow of Southern fan and swordmaster Hank Reinhardt, she is the mother of a delightful daughter, and is possessed by a truly devilish little dog, and a fat and lazy cat who styles himself a &quot;rare white mini-puma.&quot;","image":"weisskopf_toni.jpg","event_list":["55","99","103","108","247","350","352","353"]},{"con_id":"libertycon2015","title":"Scientist / Author","name":"Les Johnson","guest_id":"9","bio":"Les Johnson is a scientist, an author, and the Senior Technical Adviser for NASA&rsquo;s Advanced Concepts Office at the Marshall Space Flight Center.&nbsp; When he&rsquo;s not designing spaceships or dreaming of going to the stars, he&rsquo;s writing science fiction for Baen or popular science books for Springer.","image":"johnson_les.jpg","event_list":["34","67","99","108","130","221","239","293","350","375","386"]},{"con_id":"libertycon2015","title":"Author","name":"Sarah A. Hoyt","guest_id":"10","bio":"Sarah A. Hoyt was born in Portugal, a mistake she corrected as soon as humanly possible.&nbsp; She lives with her husband and sons in Colorado, where she&rsquo;s busy with sequels to the darkship and earth revolution series.&nbsp; Any rumors that there is a genre she won&rsquo;t write in are lies.","image":"hoyt_sarah.jpg","event_list":["14","99","176","242","263","319","350","352","358","359"]},{"con_id":"libertycon2015","title":"Author / Publisher","name":"Michael H. Hanson","guest_id":"12","bio":"Michael H. Hanson created the ongoing SHA&#39;DAA shared-world anthology series [currently consisting of &quot;SHA&#39;DAA: TALES OF THE APOCALYPSE&quot;, &quot;SHA&#39;DAA: LAST CALL&quot;, &quot;SHA&#39;DAA: PAWNS,&rdquo; and &ldquo;SHA&rsquo;DAA: FACETS&rdquo; (which debuts at LC-27), all published by Moondream Press, an imprint of Copper Dog Publishing]. He has two collections of mainstream poetry in print (&quot;AUTUMN BLUSH&quot; and &quot;JUBILANT WHISPERS&quot; published by Racket River Press, an imprint of Copper Dog Publishing) and is presently compiling his third poetic anthology, &quot;LUMINOUS LULLABIES&quot;, and an illustrated collection of poems for children, &quot;THE GREAT SOAP REBELLION.&quot; In 2014, Michael will be overseeing the writing of one new shared-world, Sha&#39;Daa anthology (SHA&#39;DAA: INKED) and a new standalone sci-fi shared-world novel (NOT TO YIELD), both to be published by Moondream Press. His short story &quot;The Traveling Luminous Museum&quot; will be published in Perseid Press&#39;s &quot;TERROR BY GASLIGHT&rdquo; anthology this year. Michael has stories in Janet Morris&#39;s Heroes in Hell (HIH) anthology volumes, &quot;LAWYERS IN HELL,&quot; &quot;ROGUES IN HELL,&rdquo; &quot;DREAMERS IN HELL,&rdquo; and the brand new &ldquo;POETS IN HELL,&rdquo; which kicks off publication at LC-27! Michael is also the Founder of the international writers club, THE FICTIONEERS, a non-profit organization created in 2007 to encourage the writing of sci-fi, fantasy, and horror, and the creative interaction of fledgling writers with more experienced professionals. THE FICTIONEERS, whose current roster is made up of over 145 authors world-wide, is loosely modeled after those fun children&#39;s clubs of mid-20th Century radio fame (Captain Midnight, Little Orphan Annie, etc.). Current Fictioneers membership includes such notables as Janet Morris, Chris Morris, Eric S. Brown, C.J. Henderson, and John Betancourt.","image":"hanson_michael.jpg","event_list":["55","60","108","167","224","355","396"]},{"con_id":"libertycon2015","title":"Fan / Scientist","name":"Jay Roye","guest_id":"14","bio":"Jay Roye is a third generation native Texan (a COWBOYS fan - in spite of Jerry Jones!) and owner of a global consulting firm providing consulting on Real Time Drilling Control Centers and systems to oil companies around the world. Jay has over 35 years experience in the Oil &amp; Gas business, onshore, offshore (and space!) and some 16+ countries. Jay designed and managed the BP&#39;s Gulf of Mexico Real Time Drilling Operations Center for five years, until his departure from BP in late February 2010. (The BP Gulf of Mexico &quot;event&quot; took place on April 20, 2010). Jay holds graduate and undergraduate degrees in several disciplines: Mechanical Engineering, Mathematics, Information Technology, Business. J&#39;s primary focus is his beautiful wife of some 37 years (she has more graduate degrees that I do... if she is happy the world is a good place...) and being a Christian... secondary is sci-fi collecting, the stock market and our two dogs.","image":"roye_j.jpg","event_list":["34","336","370","381"]},{"con_id":"libertycon2015","title":"Author","name":"Rich Groller","guest_id":"15","bio":"Our own LibertyCon Director of Programming, Rich Groller, is also an author in his own right. He is co-author of <em>The Warrior&#39;s Edge</em> (with Janet Morris and COL John Alexander), and a contributing author to <em>The American Warrior</em> (Janet and Chris Morris, Eds.), and to the <em>Heroes of Hell</em> shared universe anthology. Nominated for Military Intelligence Professional Writer of the Year in 1986, he has published numerous historical and technical articles in such venues as <em>Military Intelligence, The Field Artillery Journal, Guns and Ammo</em>, and the <em>Journal of Electronic Defense</em>. Rich is a regular in the <em>Heroes of Hell</em> series, and has been published in 6 books in the series so far, with the latest new short story in <em>Doctors in Hell</em> (published by Perseid Press). He is published in <em>Sha&#39;Daa: Pawns</em> and <em>Sha&#39;Daa: Facets</em> from the <em>Sha&#39;Daa: Tales of the Apocalypse</em> series, created by Michael H. Hanson, and in <em>The Book of Night</em>, an illustrated book of macabre poetry,&nbsp; all from Moondream Press. He is published in the horror anthologies <em>What Scares the Boogeyman?</em> and <em>Terror By Gaslight</em>&nbsp; from Ironclad Press. &nbsp; <a href=&quot;https://www.amazon.com/author/richardgroller&quot; target=&quot;_blank&quot;>https://www.amazon.com/author/richardgroller</a>","image":"groller_rich.jpg","event_list":["39","60","103","167","224","355","434"]},{"con_id":"libertycon2015","title":"Author / Publisher","name":"Holly McClure","guest_id":"18","bio":"Raised by Shaman, storytellers, preachers, and bluegrass musicians, child of the Smoky Mountains with a Cherokee mom and a father whose people came from the Scottish Highlands, Holly draws on her heritage for inspiration as an author and storyteller. She founded Sullivan Maxx Literary Agency and represented authors of fiction and non fiction until the agency was acquired by Lexium Talent and Entertainment where she is still a consultant. She is an ordained priest in the Celtic Christian Church and resides in Atlanta Ga. Her writing is literary with a touch of the supernatural. Among her books: <UL><I>The Vessel of Scion</I>, [Ecanus UK,] brings the bloodline legend from its origin in the Garden of Eden to its culmination at the end of days in a fast paced international thriller.</UL><UL><I>Conjuror</I>, [Mercer University Press.] &ldquo;just the title itself is enticing, but the entire story resonates with spirit, blending myth with reality, tragedy with triumph. A banquet of adventure.&rdquo; Steve Berry, NY times best selling author of The Patriot Threat.</UL><UL><I>Low Country Mysteries</I>, YA [Shuttered Lamp Books] for ages 9 and up Ghost Horses introduces Psychic Twins Hannah and Aislinn Hanover who work with Donovan, the earthbound spirt of the most gorgeous guy they&rsquo;ve ever seen, to bring his murderer to justice and unearth family secrets that change their life. Ghost Guardian continues their adventures with Donovan as they connect with a long dead hero to find a kidnapped couple and save them from men who have killed to protect their secrets.</UL><UL><I>A Message from Anne Elise</I>, [Shuttered Lamp Books] Teacher, traveler, writer, gnostic priest, Anne Elise Grey is now with the eternal, but she left a little booklet to inform the seekers of wisdom.</UL><UL><I>Taming the Shadow</I>, [Shuttered Lamp Books]drawing on her counceling background and esoteric scholarship, the author produced this textbook/workbook to guide the reader through practical transformation.</UL><UL><I>Too Big Buck</I>, [Shuttered Lamp Books] In this picture book for young children, an wanted dog tells the story of how he found the family that accepted him just as he was. Good dogs, like good people, come in all shapes and sizes. Illustrated by Shirley Wanda Rackley.</UL>You can find more about Holly at <A HREF=&quot;http://www.hollysullivanmcclure.com&quot;>www.hollysullivanmcclure.com</A>","image":"mcclure_holly.jpg","event_list":["26","55","108","183","245","315","423"]},{"con_id":"libertycon2015","title":"Author","name":"Jason Cordova","guest_id":"19","bio":"Author Jason Cordova was born in California and promptly moved out as soon as he legally could. His first solo novel, Corruptor, was published in November of 2010 by Twilight Times Books. He also has sold fiction in horror, fantasy and steampunk. A former teacher and military veteran, he has circled the globe at least once (and never got arrested or hospitalized, something of a record for him). He currently resides in Virginia and is the &quot;International Ambassador of the Kaiju Awareness Foundation&quot;. His web site can be found at: http://www.jasoncordova.com","image":"cordova_jason.jpg","event_list":["60","89","108","167","203","268","278","295","337","350","358","359"]},{"con_id":"libertycon2015","title":"Scientist / Author","name":"David L. Burkhead","guest_id":"20","bio":"Indianapolis writer David L. Burkhead has recently ventured into self publishing with the electronic releases of his novel &quot;Survival Test&quot; and novelettes &quot;Live to Tell&quot;, &quot;EMT&quot;, and others. He has previously published stories in various markets. He is a physicist working in Atomic Force Microscopy and surface science","image":"burkhead_david.jpg","event_list":["34","80","108","122","132","276","282","287","370","375","376"]},{"con_id":"libertycon2015","title":"Performer","name":"Darrell 'Doc' Osborn","guest_id":"25","bio":"A Man Out of Time Living Life In the Past Lane! Controlled chaos ensues when a mad scientist takes over the Con! Bent on world domination through the use of his flaky experiments and Balloons of Doom, he uses the audience as laboratory rats to carry out his diabolical schemes! Doctor Osborn is North Alabama and the Tennessee Valley&#39;s #1 Magical Mad Scientist! He delivers hilarious comedy magic and amazing balloon twisting to corporate and private events across the south. Doctor Osborn is more than just a one-shot act (although his &ldquo;Newfangled Medicine Show&rdquo; is a fan favorite). He is there all day throughout the convention interacting and entertaining attendees of ALL AGES with his magic and crazy balloons. Many have said when they walk into the convention; they know Doctor Osborn is there. Other options also include magic and/or Balloon workshops. He will be traveling with his wife Stephanie Osborn Writer/Scientist. PS: The Doctor is currently scheduled to be the Guest of Honor at Conjuration 2015 in Atlanta and has been a special guest at conventions all across the South. PSS: Some requirements may vary depending on special request","image":"osborn_darrell.jpg","event_list":["91","265","266","267","432"]},{"con_id":"libertycon2015","title":"Professional Panelist","name":"Joe McKeel","guest_id":"27","bio":"Joe &quot;JoeDog&quot; McKeel is a paranormal investigator turned advocate for the safety of investigators, and spokesperson for The Dangers of The Paranormal Project. He promotes the use of training in personal safety, prior knowledge of layout and hazards on investigation locations, common legalities and use of some basic common sense.","image":"mckeel_joe.jpg","event_list":["26","433"]},{"con_id":"libertycon2015","title":"Scientist / Author","name":"Tedd Roberts","guest_id":"28","bio":"Robert E. Hampson, Ph.D. a neuroscience researcher whose interest in public education and brain awareness has led him to write science fact and fiction with the goal of accurate, yet enjoyable brain science. For more than 35 years, he has taught and studied the physiology and pharmacology of memory, researched the effects of substance abuse on the brain, has worked toward the development of a &quot;neural prosthetic&quot; for restoring human memory function, and has published more than 150 professional research articles on memory and drug abuse. Perhaps better known to fandom as &quot;Speaker to Lab Animals&quot; (an allusion to his research as well as the obvious Larry Niven homage) or by his pseudonym - Tedd Roberts. His keen interest in public education and brain awareness led him to join the National Academy of Science&#039;s Science and Entertainment Exchange and to advise many SF/F authors on the science underlying science fiction. He writes science fact articles for Baen Books and science fiction stories under his pen-name. Dr. Hampson is an Eagle Scout and has spent more than 25 years associated with all aspects of Boy Scouting - incorporating those themes into his forthcoming YA short fiction. He has also worked as a carpenter, retail merchandizer and clerk, computer technician and programmer, public school teacher, college tutor, medical school professor and professional Lab Rat. His primary degree is in Physiology/Pharmacology, but has also trained in neuroscience, medicine, chemistry, aquatic & environmental science, microbiology, nonlinear mathematics, electronics, physics, prosthetics, biomedical engineering, computer science, brewing & distillation and punning. Married for nearly 30 years, he has two sons who are also Eagle Scouts. In his nonexistent free time he collects &quot;curio and relic&quot; firearms, sings in a choir, plays trombone in a Brass Octet and travels frequently to Scotland on work-related business that has absolutely nothing to do with his expertise and appreciation for single-malt Scotch.","image":"roberts_tedd.jpg","event_list":["14","34","99","239","317","323","324","326","350","358","359","369","379"]},{"con_id":"libertycon2015","title":"Artist / Author","name":"Mark Fults","guest_id":"29","bio":"A native of Chattanooga, Mark Fults is a locally known Fantasy Ink artist, psychic, and ghost hunter. He did the very first logo art for LibertyCon in the 80&#39;s and he was proudly Artist Guest of Honor in 1993. Mark is currently revising his book Chattanooga Chills, a lifetime collection of well known and obscure ghost stories and local history of which he has sold over 400 copies so far. Also in production: &quot;My mean old Grandma&#39;s good old Cookbook&quot; and a Tarot set titled &quot;The Veiled Unknown&quot;. He is also doing his own show with Stormline films on youtube called &quot;Shadows Paranormal.&quot;","image":"fults_mark.jpg","event_list":["26","32","422"]},{"con_id":"libertycon2015","title":"Artist","name":"Anita Moore","guest_id":"36","bio":"Anita S. Moore is a self trained artist (yeah that explains a lot for some critics) doin&#39; it just for grins and joy.&nbsp; In the late 1990s Anita began painting fun stuff from the Cthulhu Mythos. Her work has been described as the &quot;primitive art style, unique, and with a certain sense of humor about it.&quot;&nbsp; These were used on game night, and many pieces were sold over the internet.&nbsp; A couple of gallery sites were established under the title The Gates Of Yith: Cthulhu Mythos Art of Anita S. Moore. From that site several other internet fan-zines asked use Anita&#39;s art in galleries, for covers of online/print publications and the occasional commissioned work.&nbsp; On the local convention scene&nbsp; Anita&#39;s Mythos paintings popped up at Liberty Con, Chatta*con, DragonCon (&#39;98-&#39;99) and World Horror Con &#39;99, and Archon &#39;98. In 2000, after the death of husband John, almost all 2D work stopped, and for several years only a few pieces commissioned for&nbsp; a Canadian published RPG, nothing was produced.&nbsp; In 2002 Anita helped a friend Kenny, establish a game store in Ringold GA and though it closed two years later, a whole new genre and method of work emerged.&nbsp; Since 2004 Foofighterubu Wargame Terrain Studio has produced hundreds of river/waterfall sets, war torn buildings, castle towers, dungeon, mazes, alien landscapes: a host of environments for a wide variety of table top war gaming, and RPGs,&nbsp; displays, dioramas and at least one science project. &quot; Foo-Terrain&quot;&nbsp; has been shipped all over the world- about 45 out of 50 states, most of Europe, Switzerland, Norway, Finland, Taiwan, Brazil, Singapore, Baghdad,&nbsp; Canada, Australia, Japan&nbsp; Afghanistan, (as well as many FPO Military deliveries to places that couldn&#39;t be identified ) and most recently Russia. Examples&nbsp; can be seen here. &nbsp;<a href=&quot;https://www.facebook.com/FoofighterubuWargameTerrainStudio&quot; target=&quot;_blank&quot;> Foofighterubu Wargame Terrain Studio</a> Having rekindled the old love of&nbsp; 2D painting and drawing.&nbsp; Still a self proclaimed Amateur on the flat surfaces, Anita has become a sought after pro in the world of foam and flock.","image":"moore_anita.jpg","event_list":["32","108","343","346","424"]},{"con_id":"libertycon2015","title":"Author","name":"Paul Cagle","guest_id":"37","bio":"Paul Cagle is the host of the &AElig;nigma Project radio show and the administrative co-ordinator for the South Eastern Paranormal Society located in Chattanooga, TN.&nbsp; His first novel, Shadow Born, is now available on Amazon.&nbsp; You can find out more about Shadow Born at www.shadow-borne.com.","image":"cagle_paul.jpg","event_list":["26","167","251","355","411","423"]},{"con_id":"libertycon2015","title":"Scientist / Author","name":"Stephanie Osborn","guest_id":"39","bio":"Few can claim the varied background of Stephanie Osborn, the Interstellar Woman of Mystery. Veteran of more than 20 years in the civilian space program, as well as various military space defense programs, she worked on numerous space shuttle flights and the International Space Station, and counts the training of astronauts on her resume. Her space experience also includes Spacelab and ISS operations, variable star astrophysics, Martian aeolian geophysics, radiation physics, and nuclear, biological, and chemical weapons effects. Stephanie holds graduate and undergraduate degrees in four sciences: astronomy, physics, chemistry and mathematics, and she is &quot;fluent&quot; in several more, including geology and anatomy. In addition she possesses a license of ministry, has been a duly sworn, certified police officer, and is a National Weather Service certified storm spotter. Her travels have taken her to the top of Pikes Peak, across the world&#039;s highest suspension bridge, down gold mines, in the footsteps of dinosaurs, through groves of giant Sequoias, and even to the volcanoes of the Cascade Range in the Pacific Northwest, where she was present for several phreatic eruptions of Mount St. Helens. Now retired from space work, Stephanie has trained her sights on writing. She has authored, co-authored, or contributed to more than 20 books, including the celebrated science-fiction mystery, Burnout: The mystery of Space Shuttle STS-281. She is the co-author of the &quot;Cresperian Saga&quot; book series, and currently writes the critically acclaimed &quot;Displaced Detective&quot; series, described as &quot;Sherlock Holmes meets The X-Files.&quot; She recently released the paranormal/horror novella El Vengador, based on a true story, as an ebook. In addition to her writing work, the Interstellar Woman of Mystery now happily &quot;pays it forward,&quot; teaching math and science through numerous media including radio, podcasting and public speaking, as well as working with SIGMA, the science-fiction think tank. The Mystery continues.","image":"osborn_stephanie.jpg","event_list":["34","135","182","222","283","288","327","360","363","439"]},{"con_id":"libertycon2015","title":"Author","name":"John Hartness","guest_id":"40","bio":"John G. Hartness is a recovering theatre geek who likes loud music, fried pickles and cold beer. John is an award-winning poet, lighting designer and theatre producer, whose work has been translated into over 25 languages and read worldwide. He&#39;s been published in several online literary journals including The Dead Mule School of Southern Literature, cc&amp;d, Deuce Coupe and Truckin&#39;. His poem &quot;Dancing with Fireflies&quot; was nominated for a 2010 Pushcart Prize. His first novel, The Chosen, is an urban fantasy about saving the world, snotty archangels, gambling, tattooed street preachers, immortals with family issues, bar brawls and the consequences of our decisions. He followed up The Chosen with Hard Day&#39;s Knight, a new twist on the vampire detective novel and the first book in the highly successful series The Black Knight Chronicles. The second book of The Black Knight Chronicles, Back in Black, landed in March 2011 and has enjoyed immediate success. Knight Moves, the third Black Knight book, was released in August 2011. John has been called &quot;the Kevin Smith of Charlotte,&quot; and fans of Joss Whedon and Jim Butcher should enjoy his snarky slant on the fantasy genre. He can be found online at www.johnhartness.com and spends too much time on Twitter, especially after a few drinks.","image":"john_hartness.jpg","event_list":["108","125","173","292","293","294","398","446"]},{"con_id":"libertycon2015","title":"Author","name":"Brad Strickland","guest_id":"59","bio":"Brad Strickland has written 80 books, including The Whistle, the Grave, and the Ghost, Wicked Will, and The Secret of the Sealed Room (the last two as Bailey Macdonald). Recently he cowrote a major historical novel with a mysterious celebrity. As Ken McKea, he writes e-book mysteries. He and his wife Barbara live in Snellville, Georgia.","image":"strickland_brad.jpg","event_list":["104","108","127","245","308","392","426","427"]},{"con_id":"libertycon2015","title":"Author","name":"Julie Cochrane","guest_id":"62","bio":"Julie Cochrane was born in Ohio and begin crafting her first stories when she was five years old. She made her first attempts at novels in Social Studies and English classes. <em>Cally&rsquo;s War </em>with John Ringo was the first manuscript she ever finished. <em>Sister Time</em> and <em>Honor of the Clan</em> soon followed, also with John, for Baen Books. She has a degree in psychology from Georgia Tech, where she also studied chemistry. Hobbies include database programming, martial arts, Irish language and music, and fantasy role-playing games. She has one grown daughter and lives in Atlanta, Georgia.","image":"cochrane_julie.jpg","event_list":["108","131","228","317","324","350","443"]},{"con_id":"libertycon2015","title":"Scientist / Author","name":"Daniel M. Hoyt","guest_id":"67","bio":"Daniel M. Hoyt is a systems architect for rocket trajectory software, when not writing or wrangling royalty calculations for indie presses. Since his first sale to Analog, Dan has appeared in other magazines and anthologies, notably Witch Way to the Mall, Strip Mauled, and Fangs for the Mammaries (Baen), and Mike Brotherton&rsquo;s groundbreaking Diamonds in the Sky. Dan has also edited a couple DAW anthologies, Fate Fantastic and Better Off Undead. His debut space opera, Ninth Euclid&rsquo;s Prince, launched in 2015; sequels are underway. Catch up with him at http://www.danielmhoyt.com","image":"hoyt_dan.jpg","event_list":["34","176","228","350","369","398","420"]},{"con_id":"libertycon2015","title":"Author","name":"David M. Weber","guest_id":"85","bio":"David Mark Weber is an American science fiction and fantasy author. He was born in Cleveland, Ohio, in 1952. He started writing poetry and short fiction in the fifth grade, and a lifetime of reading, writing, and studying has given him a love of storytelling that clearly shows in his work. In his stories, he creates a consistent and rationally explained technology and society. Even when dealing with fantasy themes, the magical powers are treated like another technology with supporting rational laws and principles. Many of his stories have military, and particularly naval, themes, and fit into the military science fiction genre. He challenges current gender roles in the military by assuming that a gender-neutral military service will exist in his futures. By frequently placing female leading characters in what have previously been seen as traditionally male roles, he has explored the challenges faced by women in the military and politics. His most popular and enduring character is Honor Harrington, whose story, together with the &quot;Honorverse&quot; she inhabits, has been developed through nineteen novels, six shared-universe anthologies, a three book young-adult series, and &ldquo;Honorverse historical&rdquo; Manticore Ascendant series, written with Timothy Zahn and Tom Pope. To date, David currently has seventy two book titles and twenty one separete series that he has written or co-written. David currently lives in Greenville, SC with his wife Sharon, their three children, three dogs and four cats. You can keep up with David&#39;s busy schedule by following his Facebook page, davidweber.net and on Twitter. His works can be purchased at his official on-line store at www.weberuniversaloutfitters.com and through his store&#39;s Facebook page of Weber Universal Outfitters.","image":"weber_david.jpg","event_list":["36","99","108","252","297","303","304","337","350","352","402","403"]},{"con_id":"libertycon2015","title":"Author","name":"David B. Coe / D. B. Jackson","guest_id":"93","bio":"David B. Coe/D.B. Jackson is the award-winning author of nineteen fantasy novels. As David B. Coe he writes the Case Files of Justis Fearsson, a contemporary urban fantasy. As D.B. Jackson he writes the Thieftaker Chronicles, a blend of urban fantasy, mystery, and historical fiction.","image":"coe_david.jpg","event_list":["99","108","216","223","282","286","310","350","423"]},{"con_id":"libertycon2015","title":"Author","name":"Scott W. Baker","guest_id":"120","bio":"Scott W. Baker&#39;s students think it&#39;s weird that he teaches math and writes. To him, it&#39;s a natural fit. His short stories span the speculative genres and have appeared in places like Escape Pod, Daily Science Fiction, and Writers of the Future. He lives in Nashville and online at scottwbaker.net","image":"baker_scott.jpg","event_list":["108","129","249","412","441"]},{"con_id":"libertycon2015","title":"Author","name":"Karen Bogen","guest_id":"122","bio":"K.B. Bogen is a self-confessed knit-/yarn-aholic. She spends as much time as possible either knitting something, inventorying her yarn stash, or fondling yarn at any shop within driving range. Interesting? Depends on your point of view. She likes to cook and she enjoys reading forensic anthropology books. Occasionally at the same time. A native Texan, Karen holds a Bachelor of Science degree in Computer Science and Engineering from UT Arlington, as well as several health and nutrition certifications. Her wildly varied job history includes balloon sculptor, caterer, personal trainer, yoga/Pilates/senior aerobics instructor, technical document writer, configuration management engineer, and copy editor. But, sooner or later, she always returns to her first love: writing. Her favorite style is humor, preferring to make people laugh rather than cry. But she is not above causing the occasional shiver in her audience, when the mood strikes. Her credits include the anthology Dracula in London and novel Go Quest, Young Man (currently available as ebook). The second Quest book, Quest and Found, is scheduled for release in spring of 2016, along with trade paperbacks of both Quest books.","image":"bogen_karen.jpg","event_list":["90","103","108","125","171","421","431"]},{"con_id":"libertycon2015","title":"Author","name":"Cindy MacLeod","guest_id":"126","bio":"I do many things, and here are some of them: Chair, AnachroCon. Former Director of the Alternate History Track, Dragon*Con (from its inception in 2009-2011). Author of the short story &quot;The Big Golden Apple&quot;, published in DREAMS OF STEAM 2: OF BOLTS AND BRASS, 2011. Author of the novel SOME UNFORESEEN EVENT, which is currently being serialized in Steampunk Tales Magazine. Historical re-enactor, currently taking a hiatus from the hobby to get some 21st century business out of the way.","image":"macleod_cindy.jpg","event_list":["83","91","108","190","194"]},{"con_id":"libertycon2015","title":"Author / Publisher","name":"Dan Hollifield","guest_id":"127","bio":"My first professionally published short story is in the POD edition &quot;Flash Of Aphelion&quot; collection of flash fiction short-short stories on Lulu.com. My series of spaceport bar short stories, Tales From the Mare Inebrium, has been published by Allan Gilbreath&#39;s Dark Oak Press, available on the Amazon and Barnes &amp; Noble websites in hardback, paperback, Kindle and Nook e-book editions. My self-published music albums on Create Space include two solo albums of instrumental music as well as a licensed collection of instrumental songs inspired by Stephanie Osborn&#39;s first four &quot;Displaced Detective&quot; novels. My steampunk short story &quot;Test Run&quot; is among those being shopped to the BBC by writer and editor Gareth Jones for a putative steampunk TV series, which if it actually sells, Gareth has asked if I&#39;d be willing to become a featured writer for the series. My steampunk short story &quot;The Dark Side of Diablo Canyon&quot; won 2nd place in the July 2013 writing contest on the Creator And The Catalyst website, and my commissioned oil painting of &quot;Elvis On A Stairway To Heaven&quot; is under consideration for inclusion of fan-art to be included in a book by Roger Taylor - (not the drummer from Queen, but another Englishman by the same name.)\nMy e-zine Aphelion has been online since 1997, featuring the planet&#39;s finest work by amateur writers, available free to anyone with an Internet connection.","image":"hollifield_dan.jpg","event_list":["55","108","190","298","315"]},{"con_id":"libertycon2015","title":"Performer","name":"Atlanta Radio Theatre Company","guest_id":"128","bio":"Since 1984, the Atlanta Radio Theatre Company has been performing, recording, and broadcasting dramatic audio -- fully dramatized, fully sound-scaped audio drama, far beyond the readings and &quot;audio books&quot; you can find in every bookstore. We like to think that what we do is classic &quot;old-time radio&quot;, as it would sound with today&#039;s technology and dramatic techniques. This year they will be doing both a presentation and a reading.\nThe presentation will be <em>Lone Star Planet</em> by H. Beam Piper, adapted by Ron N. Butler. The Plot: When Stephen Silk is sent to the planet of New Texas, he thinks he&#039;s being sent to do three small things: Take over for the recently assassinated ambassador from the Solar League (and find out who did it while he&#039;s there), convince the fiercely independent world to join the Solar League, and head off a potential alien invasion. When he arrives, however, he quickly finds himself in the midst of a culture that guards its freedoms jealously, which puts a bit of a twist on the investigation. Can Silk stand before the Court of Political Justice and convince the tribunal that the victim being a politician isn&#039;t an acceptable defense against murder? Can he unmask the killers and reveal the conspiracy that motivated them? And just how insulting is it that the new ambassador is packing heat?\nThe reading will be <em>The Scouring of the Shire</em> by J. R. R. Tolkien, adapted by Cyd Hoskinson and Nancy Skidmore. The Plot: The movies directed by Peter Jackson were sweeping epics that captured the feel and the peril of Middle Earth, but audiences can only sit still for so long. Come hear the vital parts of &quot;The Lord of the Rings&quot; that were never filmed, much less reached the cutting room floor. In this installment, we find out that even after the fall of a great evil, there can still be wickedness in the hearts of men, wizards, and hobbits alike, and that it will be up to a new breed of hero to keep the peace at the end of the Third Age.","image":"artc.gif","event_list":["104","426","427"]},{"con_id":"libertycon2015","title":"Author","name":"Jack Finley","guest_id":"130","bio":"Born and raised in the conservative red yonder of Northern Indiana, Jack William Finley has been writing for most of his life. More unusual and opinionated than is in anyone&#39;s best interest, he combines the worst qualities of Harlan Ellison and Hunter S. Thompson and very little of the talent. It has been said that he can be reasonably entertaining under just the right circumstances. Samples of just the right circumstances can be obtained in the Rogues in Hell, Dreamers in Hell and Poets in Hell volumes of Janet and Chris Morris&#39; revived Heroes in Hell series, and the horror anthology &#39;Terror by Gaslight&#39; by Iron Clad Press.","image":"finley_jack.jpg","event_list":["60","108","167","224","355","434","445"]},{"con_id":"libertycon2015","title":"Fan / Scientist","name":"Tim Bolgeo","guest_id":"131","bio":"Richard Timothy &#039;Uncle Timmy&#039; Bolgeo is the Chairman of LibertyCon Emeritus and an admitted (by everyone else, denied by him) Secret Master of Fandom (SMoF). A retired electrical engineer by profession with over 30 years with theTennessee Valley Authority (TVA), Uncle Timmy has been a permanent fixture in fandom since 1976. Fandom is a way of life in the Bolgeo clan, and his wife, two children and three grandchildren are no strangers to Southern Fandom. His daughter Brandy, has taken over as Chair of LibertyCon, and the family tradition lives on. A lifetime reader of Science Fiction and Fantasy (with a strong preference for Military Science Fiction), Uncle Timmy was Founder and Chairman of LibertyCon 1 - 25; original Board Member and Chairman of ChattaCon 7 - 11; and staff member at numerous conventions to include WorldCon, World Horror Con, World FantasyCon, and Con*Stellation. He is the long running Editor/Publisher of the Fanzines The LibertyCon Newsletter (1987-1997) and The Revenge of Hump Day! (1997 to present). (To receive The Revenge, please send an email to Tim Bolgeo at tbolgeo@comcast.net) Some comments on Fandom from Uncle Timmy: &quot;Fandom is only a hobby. Family and work come first. But it is a beloved hobby that has brought me many hours fun and entertainment. Fandom has also brought me many great friends that I will cherish all my life and I am a fierce protector of these friends.&quot; &quot;I have been very fortunate to meet many of my private heroes through fandom and been blessed by becoming friends with a number of them.&quot; &quot;I have always enjoyed helping others who want to start conventions with administrative help or advice. I guess you could say that I take my role as &#039;Uncle Timmy&#039; seriously when it comes to helping people when I can.&quot; &quot;About the only other convention that I work at on a consistent basis is Con*Stellation in Huntsville, AL. I run the &quot;Killer Cutthroat Spades Tournament&quot; there every year. &quot;Killer Cutthroat Spades&quot; is my passion and it has got me in trouble with a writer or two (See David Weber&#039;s Ashes of Honor and A Beautiful Friendship and Eric Flint&#039;s Time Spike). &quot;In fandom, I have had a few heroes, Wilson &#039;Bob&#039; Tucker, Andre Norton, L. Sprague and Catherine Decamp, and Bob Adams. With regard to regular fans I never had any heroes, but I have definitely had a number of great friends who run other conventions. People like Ken Moore (Kubla Khan, Nashville), Sylvia Cox, Greg Bridges and Jeff Bango (MidSouthCon, Memphis), Chloie Airoldi (SatyriCon, Knoxville), Mark Paulk, Mike and Nelda Kennedy, Sam Smith (Con*Stellation, Huntsville), Rich and Michelle Zellich (Archon in the Old Days) and...hopefully, you get the idea.&quot;","image":"bolgeo_tim.jpg","event_list":["34","66","103","182","336","381"]},{"con_id":"libertycon2015","title":"Fan / Scientist","name":"Gary Shelton","guest_id":"134","bio":"Agronomy Degree from Auburn University. Worked at the USDA-Agricultural research service as an Agronomist since 1990. Edits a yearly report that includes Soybean research from the Southern States. Currently working on genetic modifications of Soybeans in the Crop genetics Research Unit Stoneville, MS.","image":"shelton_gary.jpg","event_list":["34","103","373"]},{"con_id":"libertycon2015","title":"Scientist","name":"Robert Kennedy","guest_id":"136","bio":"Robert is a senior systems engineer at Tetra Tech (2007-present), where he does green energy policy and business development at the local, state, and regional and national levels. Educated in the classics and foreign languages since boyhood (Latin, Greek, Arabic, and Russian), he studied mechanical engineering at California Polytechnic (Pomona, B.S. 1986), with emphases in robotics, machine design, optical physics, and Soviet studies; as well as earning a masters in national security studies (San Bernardino, Special M.A., 1988). He worked his way thru school dealing blackjack and craps among other things, and spent one delightful summer in Army Basic Training (where else can you shoot a machine gun and *they* pay *you*?). He designed industrial robotics systems at the Douglas Aircraft Company (1987-1991) in Los Angeles, and pursued research in artificial intelligence at Oak Ridge National Laboratory (1987). After the Cold War ended, he founded the Ultimax Group, Inc. (1992-present), a Russian-American company in Oak Ridge, Tennessee. Ultimax specializes in nothing, but over the years has engaged in: nuclear science, systems engineering, and transmutation; military robotics; international trade; Russian space software publishing; countercracking and network security; and scenario-based studies on various strategic topics, e.g. space affairs, energy, arms control, missile defense, infrastructure security, and pandemics. As ASMEs 1994 Congressional Fellow, he spent his year working for the Subcommittee on Space in the U.S. House of Representatives, during which he developed legislation; wrote White Papers; prepared expert witnesses; and advised Members on Russian affairs, Space Station, Milstar, civil/military convergence, participated in the First Interstellar Robotics Conference at NYU, and was a technical consultant on Deep Impact (Paramount/Dreamworks major motion picture released May 8, 1998). He was instrumental in the evolution of Presidential Decision Directive 23: Commercial Remote Sensing Policy. He is a published commercial artist and author (nonfiction), and has written about space-based solar power, shell worlds, climate change, linguistics, energy parks, biofuels, and energy security. In 2011, he co-organized and sponsored the First Tennessee Valley Interstellar Workshop in Oak Ridge, lectured on geoengineering in Moscow for the Russian Academy of Sciences / Rosgidromet (their national weather service), and also at the International Academy of Astronautics in Aosta, Italy. His work has also appeared in /Journal of the British Interplanetary Society/, /Acta Astronautica/, the /Whole Earth Review/ and a cover story on Soviet Star Wars in the Smithsonian /Air &amp; Space/ magazine. He has patents and trademarks pending for a number of optoelectronic, robotic, security, and space system inventions as well as the concept of Tetrageneration(TM). He serves as a volunteer in Oak Ridge city government as vice-chair of the Environmental Quality Advisory Board, which was tasked by City Council to formulate the City&#039;s green energy policy, and initiated the policy decisions to authorize photovoltaics in the City and institute single-stream-recycling-with-rewards, first in the Southeast to do so. He is a former adjunct member of ASMEs Government Relations Committee; past-chair of the Oak Ridge Section as well as the Technology &amp; Society Division; and currently sits on the Society&#039;s National Energy Committee, tasked with writing Energy Talking Point papers for the 112th Congress.","image":"kennedy_robert.jpg","event_list":["34","148","221","326","327","377","381","383"]},{"con_id":"libertycon2015","title":"Artist","name":"Melissa Gay","guest_id":"140","bio":"Melissa Gay is a critically-acclaimed artist of the Imaginative Realism style. Starting her career as a scientific illustrator doing ink drawings for botany manuals, she later used those same skills to do black and white line art for roleplaying games, her true passion. Her work has since appeared on the covers and the interiors of many games, books, magazines, academic publications, and even a tarot deck, and her original paintings are in the hands of private collectors around the world. Her roleplaying game credits include work on Freedom Flyer, an Echoes Of War adventure for the Firefly RPG, The Dresden Files RPG, the Crimeworld Fate Core supplement,&nbsp; HERO 6th edition, Fantasy HERO and its supplement The Book Of Dragons, Part-Time Gods and its upcoming supplements, Mermaid Adventures, Camp Myth, Psi-Punk, and the Elves of Uteria. Her speculative fiction book covers include Sara M. Harvey&#39;s Penemue trilogy (Apex Press), and&nbsp; HebrewPunk (Apex Press) and Jesus and the Eightfold Path (Immersion Press edition) for World Fantasy Award winning author Lavie Tidhar.","image":"gay_melissa.jpg","event_list":["27","32","92","103","108","175","238","250","451"]},{"con_id":"libertycon2015","title":"Fan / Artist","name":"Fritz Fotovich","guest_id":"144","bio":"In his non-con day job, Fritz is a non-starving artist masquerading as a logistics engineer contracting for the United States Government. While he does love his mundane work environment, he loves to spend his off time with His Favorite (Stacy), creating art at the Magic Manor, or playing in the Freakin Terrific Woodshop. There&rsquo;s no limit to what he will make and create. He gladly volunteers his skills to non-profits, businesses in need, friends, family, and friends of friends and family. Not only that, but he loves to cook and have a fun time no matter in what he does; including performing duties as a Steve Jackson Games MIB.","image":"fotovich_fritz.jpg","event_list":["32","39","66","95","103","153","156","158","159","160","257","258","356","408","424"]},{"con_id":"libertycon2015","title":"Fan / Scientist","name":"Mark Paulk","guest_id":"149","bio":"Dr. Mark Paulk teaches software engineering at the University of Texas at Dallas and is a consultant and author in software engineering, software process improvement, high maturity practices, agile methods, and statistical thinking. Dr. Paulk was a Senior Systems Scientist at the Institute for Software Research at Carnegie Mellon University from 2002 to 2012. From 1987 to 2002, Dr. Paulk was with the Software Engineering Institute at Carnegie Mellon, where he led the work on the Capability Maturity Model for Software.&nbsp; He was co-project editor of ISO/IEC 15504-2 (Software Process Assessment: Baseline Practices Guide) and a contributor to ISO and IEEE standards. He is a co-author of the eSourcing Capability Model for Service Providers. Dr. Paulk received his PhD in industrial engineering from the University of Pittsburgh, his MS in computer science from Vanderbilt University, and his BS in mathematics and computer science from the University of Alabama in Huntsville.&nbsp; He is a Fellow of the ASQ, an ASQ Certified Software Quality Engineer, a Certified ScrumMaster, and a Senior Member of the IEEE.","image":"paulk_mark.jpg","event_list":["33","34","66","109","110","385","416"]},{"con_id":"libertycon2015","title":"Performer","name":"Reinhardt Legacy Fight Team","guest_id":"151","bio":"We are a weapons demonstration team of former friends and students of swordsmanship authority Hank Reinhardt. The Reinhardt Legacy Fight Team started years ago as a casual group that regularly met with Hank at his house in Stone Mountain, GA during the 90s to spar. Later, some original members were in the Museum Replicas Ltd. Fight Team when he was director of MRL. Our purpose was to perform in sparring demonstrations. Two members have been in Hank&#39;s videos &quot;Viking Sword&quot; and &quot;Myth of the Sword&quot; as actors. Hank is gone now, but the friends Hank brought together have formed a team to promote &quot;The Book of Swords&quot;. This final book has been published posthumously by his family. We use the Gray Wolf as our logo in honor and memory of Hank. This was his heraldic device when he was active in the formative years of the SCA in the southern US. He was a key founder in the movement in the South. Later in life he went on to train and advise in print, video, and demonstrations. He was a key figure in launching the current, almost mainstream level of interest in swords in North America by being the first to provide usable arms that the average enthusiast could afford. Hank opened his home and knowledge to us in our youth. We are not unique in this, many people who knew Hank have had similar experiences. We are continuing to entertain, inform, spar, cut, and test new theories. We demonstrate the use of classical weapons with cutting demonstrations and full contact sparring. Hank&#39;s philosophy was that fighting for your life requires ruthless efficiency. Our group has an aim at realism, eclipsed by needs for safety. Fairness does not figure in this equation. This attitude is out of keeping with some sport fighting organizations, but Hank was adamant about learning to fight, not learning sport. We do not promote any culture, era, or weapon above others. We evaluate the weapons and methods based on utility. Testing them in the contexts they were conceived, and in hypothetical situations, both modern and ancient. Hank loved to experiment and designed several fantasy swords that have no historical counterpart, but are very funtional. Hank enjoyed innovating new techniques with ancient weapons as well as taking what was useful from historical fechtbooks, but always with an eye for the practical. This was life and death afterall. (Taken from <a href=&quot;http://www.reinhardtlegacyfightteam.com/&quot;>The Fight Team&#39;s official page</a>)","image":"reinhardt.jpg","event_list":["351"]},{"con_id":"libertycon2015","title":"Scientist","name":"Dr. Ben Davis","guest_id":"153","bio":"Ben Davis has a Ph.D. in Nuclear Physics and an M.S. in Nuclear Astrophysics from the University of Notre Dame. He taught at the college level for several years on a number of technical subjects ranging from computer programming and math to, of course, astronomy and physics. In the late nineties, he took up a career in software and industrial controls engineering (robot programming and electronics are fun as they seem). As a lifelong fan of science fiction, his main avocations now involve history, futurism and skepticism. When not traveling with his wife, playing with his dogs, climbing rocks, or attending cons, he spends his spare time pondering general relativity, the search for extraterrestrial intelligence and the effects of antimatter on the dark matter/dark energy problem. Sometimes, he hunts for true psychics, ghosts and other paranormal phenomenon to no avail.&nbsp;&nbsp;&nbsp; www.facebook.com/AskDrBen","image":"davis_ben.jpg","event_list":["34","103","328","329","361","369","374","377","385","386"]},{"con_id":"libertycon2015","title":"Artist","name":"Mark Helwig","guest_id":"154","bio":"http://www.markhelwigart.com&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; https://www.facebook.com/markhelwigart&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; http://www.markhelwigart.comMark Helwig is a freelance illustrator and sculptor living in the slightly whacky town of Athens, GA. His art ranges from near photo realistic to cartoon with subjects from cute dragons to horror, and his sense of humor can best (and probably generously) be described as somewhat off the wall&mdash;and seems to involve a lot of tentacles. He started working in illustration as a concentration in 2006 and fell in love with oil paints a couple of years later (after a torturous affair with acrylics&mdash;they&rsquo;ve since reconciled) and began sculpting in 2011. His clients include many gaming companies such as Hero Games, Blackwyrm, Sacrosanct Games, and Chaosium as well as small press publishing companies, and Cambridge University Press. His awards include 3 time winner of Most Humorous, as well as Best Dragon, Best Amazon, and Best Horror for the Dragon Con Art Show. When he&rsquo;s not drawing, painting, or sculpting (with the occasional bout of sleeping or even spending time with his family), he can be found either singing in choral groups or composing music and holds a degree in music from Kennesaw State University.","image":"helwig_mark.jpg","event_list":["32","92","108","250","451"]},{"con_id":"libertycon2015","title":"Author","name":"Patrick Vanner","guest_id":"156","bio":"Patrick A. Vanner was born into a Marine family, and, after attending Penn State University, majoring in aerospace and electrical engineering, he enlisted in the Marine Corps like his parents before him. After a successful military tour, he earned a degree in network administration and began a career in telecommunications and information technology. He divides his time between working, reading, writing, gaming and spending an exorbitant amount of money on anime, giving truth to the saying, &quot;Anime, it&#39;s more addictive than crack&quot;. Patrick currently lives with the love of his life, Heather, and six insane cats that make their lives interesting in every sense of the ancient Chinese curse.","image":"vanner_patrick.jpg","event_list":["34","108","376","383","385"]},{"con_id":"libertycon2015","title":"Fan / Scientist","name":"Ken Roy","guest_id":"157","bio":"Ken Roy is an engineer who lives and works amid the relics of the Manhattan Project in Oak Ridge. He has published technology speculation pieces in such venues as the Journal for the British Planetary Society, and the United States Naval Institute Proceedings. His current interests include terraforming and geoengineering.","image":"roy_ken.jpg","event_list":["34","148","194","221","326","327","383"]},{"con_id":"libertycon2015","title":"Fan Panelist","name":"All Other Attending Pros","guest_id":"158","event_list":["27"]},{"con_id":"libertycon2015","title":"Author","name":"Tamara Lowery","guest_id":"159","bio":"Tamara has been quite mad since about 1978. She embraced her madness rather than fought it, and she has turned it to her advantage now as a multi-genre author. Her published works include the adventure/horror Waves of Darkness series, which follows the adventures of pirate-turned-living-vampire Viktor Brandewyne aka Bloody Vik Brandee, and the mid-winter dark fantasy short, In the Dead of Winter. She also has several WIPs and story ideas awaiting her time and attention in various genres. Born in the Chattanooga area, she has lived in various spots around the southeast over the past five decades. She currently resides in her native area along with her husband and five cats.","image":"lowery_tamara.jpg","event_list":["10","42","108","135","236","275","282","296","421","434"]},{"con_id":"libertycon2015","title":"Author","name":"Geoffrey Mandragora","guest_id":"163","bio":"Geoffrey Mandragora is the pen name for Brent Mehring. He is currently completing three years of rehab following a twenty year addiction to historical re-enactment. After decades of arguing with people about what is &quot;period,&quot; his first novel, The Thunderbolt Affair sets the argument, &quot;What is Steampunk?&quot;His obsession with minute details of abandoned technologies and outmoded social behavior often leads to production hours lost to research, followed by long chapters of &quot;I researched it, you have to read about it.&quot; To which his editor replies, &quot;Not necessarily.&quot; The events of The Thunderbolt Affair begin in a version of 1887 nearly parallel to our own history, with one small change. From that one difference, he sought to extrapolate rapid changes in technology and society that would lead to something recognizable as steampunk, while entertaining the reader by telling an engaging story with a memorable cast of characters.","image":"mandragora_geoffrey.jpg","event_list":["81","83","122","136","190","277","280","291","405","429"]},{"con_id":"libertycon2015","title":"Fan / Artist","name":"James Ward","guest_id":"164","bio":"James Ward is an excellent Chattanooga based artist who is well known not for putting paint on canvas, but more for putting paint on anything else that&#39;s not bolted down. You can find his artwork on everything from feathers to floppy disks, and lately he has branched out with the creation of costuming accessories. James is also an accomplished puppeteer, and gives performances during the convention to entertain our young (or young at heart) attendees.","image":"ward_james.jpg","event_list":["32","92","164","166","190"]},{"con_id":"libertycon2015","title":"Author","name":"Larry Correia","guest_id":"168","bio":"Larry Correia is the New York Times bestselling author of the Monster Hunter International series, the Grimnoir Chronicles trilogy, the Dead Six military thrillers, and the Saga of the Forgotten Warrior epic fantasy series.","image":"correia_larry.jpg","event_list":["99","108","137","263","350","353","369","376","392","403"]},{"con_id":"libertycon2015","title":"Author","name":"Rocky Perry","guest_id":"171","bio":"Rocky P Perry, rockyperry.com , was born in 1975 in Flintstone, Ga. Diagnosed with Dyslexia at the age of six, he spent the first years of his life learning in small a classroom away from his peers. He first learned to read on his own at the age of ten and was allowed to join his classmates in middle school. His struggles with reading left him without any ability to explore the world inside books like other readers. This gave him a drive to explore worlds in his mind. He loved to look at comic books and make up his own stories, which eventually led to him becoming a storyteller. Most of his life was spent as an artist, mostly a painter. For years he told his stories with a brush, unable to write his stories with the skill they required. As he got older, technology caught up with his disability. He was finally able to tell his stories and put them on paper with the help of speech to text software. This is when he wrote his first book, unpublished. After writing on several more projects, he published his first book, Luke Banderloft and the McFarven Pirates, book one of his current series. A story not unlike his own, but set in a world all his own. In 2013 he started production on a web series based on the Luke Banderloft series, lukebanderloft.com . Working with actors and crew local to Chattanooga and Trey Cook of Cook Box Productions, he hoped to create a film version of his book series that would show fantasy films can be done on a small budget. Episode one can be found at the #LukeBanderloft youtube channel starting Feb 1 of 2014.","image":"perry_rocky.jpg","event_list":["103","108","129","275","296","364","429","434"]},{"con_id":"libertycon2015","title":"Scientist","name":"Jim Beall","guest_id":"179","bio":"Jim Beall (BS-Math, MBA, PE) has been a nuclear engineer for over 40 years, a war gamer for over 50, and an avid reader of science fiction for even longer. His experience in nuclear engineering and power systems began as a naval officer, shortly after surviving one of Admiral Rickover&rsquo;s infamous interviews, aboard USS Long Beach (CGN-9). Experience after the USN includes design, construction, inspection, enforcement, and assessment with a nuclear utility, an architect engineering firm, and the US Nuclear Regulatory Commission (USNRC). Assignments at the USNRC included senior resident inspector (both for construction and operations), inspection team leader, and senior enforcement specialist before serving as the policy assistant for reactors to three different USNRC Commissioners and earning the agency&rsquo;s Meritorious and Distinguished Service awards. Duties of those policy-level posts included substantial research into alternative and speculative energy sources, as well as energy forecasts. Some of those other sources were coal, oil, hydro, geothermal, tidal, solar, wind, fracking, space-based, heavy water reactors, breeder reactors, fusion, and even anti-matter (mostly for the math and atomic equations). These studies were a necessary aspect for reviewing energy proposals, assessing technical reports, and drafting speeches. Baen Books (baen.com) has published three of his non-fiction articles: - &quot;Our Worldship Broke!&quot; - &quot;Case Studies in Handwavium&quot; and - &quot;From Corvus to Keyhole -- Shipyards: Past Present And Science Fiction.&quot;","image":"beall_jim.jpg","event_list":["34","95","108","213","239","336","350","365","376","380","381"]},{"con_id":"libertycon2015","title":"Author","name":"Robert A. Hoyt","guest_id":"180","bio":"&rdquo;Robert Hoyt is currently a medical student and author living in Colorado. His books &quot;Cat&#39;s Paw&quot;, and &quot;Ratskiller&quot; can be found on Amazon, and he has a new anthology of short stories coming out soon. He&#39;s continuing, in his copious spare time, to work on writing projects.&rdquo;","image":"hoyt_robert.jpg","event_list":["34","73","176","311","350","378","379"]},{"con_id":"libertycon2015","title":"Author","name":"Stephen J. Simmons","guest_id":"182","bio":"Stephen J. Simmons started writing shortly after he retired from the Navy, primarily because his children had grown too old to listen to bedtime stories and the cats never laughed at the funny bits.&nbsp; He sold over a dozen flash-fiction stories to various online publishing venues, every one of which went out of business after buying his work, so he decided to try his hand at longer formats.&nbsp; His first novel, The Galileo Syndrome, was released in 2014.\nStephen grew up in a tiny hamlet in the Catskill Mountains of upstate New York, and went to high school in Albany.&nbsp; He spent twenty-one years in the Navy, both as a nuclear operator on five fast-attack submarines and as an instructor in both of the Navy&#39;s nuclear power training schools.&nbsp; He currently works as the nuclear information security manager for Newport News Shipbuilding.","image":"simmons_stephen.jpg","event_list":["34","108","220","233","336","381","383","385"]},{"con_id":"libertycon2015","title":"Author","name":"Charles E. Gannon","guest_id":"184","bio":"Dr. Charles E. Gannon&#39;s newest novel from Baen Books is Raising Caine [October 2015]&mdash;the third book in his hard science fiction Caine Riordan series. Equal parts intrigue and military SF, novels in the series have been nominated for three Nebula Awards and won the Compton Crook Award, in addition to being national SF bestsellers. The next book in the series--Caine&#39;s Mutiny--is forthcoming in February. He pens novels in collaboration with Eric Flint in the Ring of Fire alternate history series and with Steve White in the Starfire series. His shorter SF has appeared under various imprints and in various magazines. His first epic fantasy, the Broken World trilogy, is forthcoming from Baen. His book Rumors of War and Infernal Machines: Technomilitary Agenda Setting in American and British Speculative Fiction, won the 2006 American Library Association Award for Outstanding Book. Dr. Gannon is a Distinguished Professor of English at St. Bonaventure University. A Fulbright Senior Specialist from 2004 to 2009, he held Fulbright Fellowships in England, Scotland, the Czech Republic, and received Fulbright and Embassy Travel grants to these countries as well as to The Netherlands, Slovakia, and Italy. He has also served as a consultant for various intelligence and defense agencies, including DHS, Pentagon, Air Force, Army, NATO, DARPA, NRO, NASA, and several others which may not be disclosed. He has been on various radio and televisions programs as an expert commentator, including NPR and the Discovery Channel.","image":"gannon_charles.jpg","event_list":["34","82","99","108","178","203","221","297","299","303","305","323","350","360","388","402","441"]},{"con_id":"libertycon2015","title":"Scientist","name":"Philip Wohlrab","guest_id":"186","bio":"Philip Wohlrab is a serving medic in the Virginia Army National Guard, he earned the title Doc the hard way while on his two tours in Iraq serving as a line medic embedded in infantry companies then returned home to pursue his interests in disease prevention. He is a recent graduate with his Masters of Public Health from Liberty University. He currently serves as an instructor in combat medicine, basic lifesaving skills, advanced lifesaving skills (military), and is the NCOIC of the Field Sanitation program. He is also the coordinator for the medical readiness events program for the VAARNG. In his limited free time, he is an avid consumer of science fiction books and films. He has participated on the Homo Stellaris track at Tennessee Valley Interstellar Workshop and is considering ways that we can achieve being an interstellar species from the perspective of what future public health will need.","image":"wohlrab_phillip.jpg","event_list":["14","34","73","255","324","326","373","377","378","383"]},{"con_id":"libertycon2015","title":"Fan Panelist","name":"Glenn Baggott","guest_id":"189","bio":"Glenn is a resident of Mount Juliet, Tennessee where he resides with his wife Janet and their two sons Conlin and Chris. He graduated from Nashville State Technical Institute. He completed his internship at WTVF channel 5 in Nashville. After graduation, however, he made more money as a journeyman meat cutter which he did for 21 years. He now works as a grade IV water operator for West Wilson Utility District. He hopes one day to work for TVA. He is an avid Star Wars and Indiana Jones fan. His favorite authors are anyone that has written for Star Wars, as well as R. A. Salvatore (Drizzt series) and Kim Harrison (The Hallows). He loves 50s, 60s, 80s and Celtic music. His first convention was Kubla Khan back in 1984. In 1985 instead of going to his senior prom he went to Kubla. He stopped going to conventions in 1992 when he joined the Nashville Pipes and Drums as a bagpiper. While he was with the group he had the honor of opening for Rod Stewart during Vanguard Heart Tour and also for Am Grant for one of her Christmas concerts. It was during this time he was asked to move in with one of his oldest friends, Troy Guinn and the late great Jack Hunter Daves, two of the original members of the Celtic band Secret Commonwealth. He lived with them for about 6 months. He started going back to conventions in 1999 when he met his future wife Janet. He played Dungeons and Dragons in his parents basement from the age 13-27. He quit playing to actually try to get a girlfriend. Now he is back at it to try to get kids off the computer games and use their imagination.","image":"baggott_glenn.jpg","event_list":["34","94","230","367","408"]},{"con_id":"libertycon2015","title":"Artist","name":"Sande Ankenbrandt","guest_id":"193","event_list":[]},{"con_id":"libertycon2015","title":"Author","name":"Louise Herring-Jones","guest_id":"194","bio":"Louise Herring-Jones writes mainstream, historical, and speculative fiction as well as humor and non-fiction. She practices law in Alabama under her legal name Amy L. Herring and is an advocate for privacy rights, First Amendment guarantees, and other constitutionally protected freedoms.","image":"herring-jones_louise.jpg","event_list":["42","108","131","220","331","422","442","444"]},{"con_id":"libertycon2015","title":"Author","name":"Jody Lynn Nye","guest_id":"198","bio":"Jody Lynn Nye lists her main career activity as &ldquo;spoiling cats.&rdquo; She lives near Chicago with her current cat, Jeremy, and husband, Bill. She has published 45 books, including The Ship Who Won with Anne McCaffrey, a humorous anthology about mothers, Don&rsquo;t Forget Your Spacesuit, Dear!, and over 140 short stories. Her latest books are Myth-Quoted (Ace), Rhythm of the Imperium (Baen), and Wishing On a Star (Arc Manor).","image":"nye_jody.jpg","event_list":["49","99","108","188","220","350","352","358","359","362","412"]},{"con_id":"libertycon2015","title":"Author / Publisher","name":"Bill Fawcett","guest_id":"199","bio":"Bill has taught, been a game designer, author, and college dean.&nbsp; His entire life has been spent in the creative fields and managing other creative individuals.&nbsp; He is one of the founders and lead designer of Mayfair Games. He founded what is now the largest hobby shop in Northern Illinois. Bill Fawcett &amp; Associates has packaged over 300 books for major publishers. As an anthologist Bill has edited or co-edited almost 40 anthologies.\nThe Fleet series he created with David Drake has become a classic of military science fiction. Bill has collaborated on mysteries such as the Authorized Mycroft Holmes novels and the Madame Vernet Investigates series.\nBill is the editor of Hunters and Shooters and The Teams, two oral histories of the SEALs in Viet nam.&nbsp; He is an author in and editor of It Seemed Like a good Idea, Great Historical Fiascos, seven other books on the great mistakes in history and How To Lose A Battle anf How To Lose a War: a modern look at how bad generals lose battles. Also It Looked Good on Paper and Oval Office Oddities. 100 Mistakes that Changed History and Trust Me, 100 Leadership Mistakes that Changed History have recently been released by Penquin/Caliber.","image":"fawcett_bill.jpg","event_list":["99","226","315","322","350","413","428","429","430"]},{"con_id":"libertycon2015","title":"Author","name":"Gail Z.Martin","guest_id":"200","bio":"Gail Z. Martin is the author of Vendetta: A Deadly Curiosities Novel in her urban fantasy series set in Charleston, SC (Dec. 2015, Solaris Books); Shadow and Flame the fourth and final book in the Ascendant Kingdoms Saga (Orbit Books); and Iron and Blood a new Steampunk series (Solaris Books) co-authored with Larry N. Martin. She is also author of Ice Forged, Reign of Ash and War of Shadows in The Ascendant Kingdoms Saga, The Chronicles of The Necromancer series (The Summoner, The Blood King, Dark Haven, Dark Lady&rsquo;s Chosen); The Fallen Kings Cycle (The Sworn, The Dread) and the urban fantasy novel Deadly Curiosities. Gail writes three ebook series: The Jonmarc Vahanian Adventures, The Deadly Curiosities Adventures and The Blaine McFadden Adventures. The Storm and Fury Adventures, set in the Iron &amp; Blood world, are co-authored with Larry N. Martin. Her work has appeared in over 20 US/UK anthologies. Newest anthologies include: The Big Bad 2, Athena&rsquo;s Daughters, Heroes, Space, Contact Light, With Great Power, The Weird Wild West, The Side of Good/The Side of Evil, Alien Artifacts, Shadowed Path, Realms of Imagination, Clockwork Universe: Steampunk vs. Aliens. Find her at www.AscendantKingdoms.com, on Twitter @GailZMartin, on Facebook.com/WinterKingdoms, at DisquietingVisions.com blog and GhostInTheMachinePodcast.com, on Goodreads https://www.goodreads.com/GailZMartin and free excerpts on Wattpad http://wattpad.com/GailZMartin.","image":"martin_gail.jpg","event_list":["108","168","169","279","286","291","302","355","389","446"]},{"con_id":"libertycon2015","title":"Author / Performer","name":"Beth Patterson","guest_id":"202","bio":"Beth W. Patterson was a full-time musician for over two decades before diving into the world of writing, a process she describes as &ldquo;fleeing the circus to join the zoo&rdquo;. Her most recent book is a compilation of her lyrics and poetry entitled Mongrels and Misfits, and she is a contributing writer to twelve anthologies. Patterson has performed in seventeen countries across the Americas, Europe, Oceania, and Asia. Her playing appears on over a hundred and thirty albums, soundtracks, videos, commercials, and voice-overs (including seven solo albums of her own). More than a hundred of her compositions and co-writes have been released. She studied ethnomusicology at University College, Cork in Ireland and holds a Bachelor&rsquo;s degree in Music Therapy from Loyola University New Orleans. Beth has occasionally worn other hats as a body paint model, film extra, minor role actor, recording studio partner, record label owner, producer, and visual artist. She is a lover of exquisitely stupid movies and a shameless fangirl of the band Rush. You can find her at www.bethpattersonmusic.com","image":"patterson_beth.jpg","event_list":["60","132","167","224","251","354","355","415"]},{"con_id":"libertycon2015","title":"Author","name":"Mark Wandrey","guest_id":"207","bio":"Located in rural Tennessee, Mark Wandrey has been creating new worlds since he was old enough to write. After penning countless short stories, he realized novels were his real calling and hasn&rsquo;t looked back since. A lifetime of diverse jobs, extensive travels, and living in most areas of the country have uniquely equipped him with experiences to color his stories in ways many find engaging and thought provoking. His current works include the &quot;Earth Song&quot; series, an epic space opera published by Henchman Press with 5 books out so far with more to come. Also coming soon is A Time to Die, Mark&#39;s take on the immensely popular Zombie Apocalypse megatrend.","image":"wandrey_mark.jpg","event_list":["14","50","103","122","123","203","228","280","285","355","364","420"]},{"con_id":"libertycon2015","title":"Author","name":"Anna Grace Carpenter","guest_id":"208","bio":"A.G. Carpenter writes fiction of (and for) all sorts, with a focus on the speculative. With over a dozen published short stories, her work has appeared in Twitter-zines such as One Forty Fiction and Trapeze Magazine, online publications Daily Science Fiction, Abyss &amp; Apex, Nature Magazine - Futures, and others. The Weather&#39;s Always Fine in Paradise, a collection of new and old short stories and novelettes, is available now. Her novella Of Lips and Tongue, the first book in the Southern Gothic Touch trilogy, is forthcoming from Falstaff Books. She graduated from The College of Santa Fe with a degree in Moving Image Arts (B.A, 2004) and is still an avid fan of film making, with a preference for movies in which things explode. She maintains a blog about her work and the process of writing on her website.","image":"carpenter_anna.jpg","event_list":["83","108","138","249","279","302","313","422"]},{"con_id":"libertycon2015","title":"Author","name":"pdmac","guest_id":"211","bio":"pdmac is the author of the epic Science Fiction adventure series Wolf 359,which garnered 2nd place in Science Fiction in the Bookbzz.com Prize Writer of the year 2015 competition. His most recent publication is a Steampunk Western Fool&rsquo;s Gold. He is presently in the final editing phase of a dystopian novel called Rebirth of Angels scheduled for release in May. A diverse author, writer, and editor, he has also edited a Literature anthology, served as managing editor of an archaeology magazine, ghost-written an autobiography, and has had poems, short stories, articles, and editorials published in various literary journals, magazines and newspapers. His most recent short stories appear in the Short Story America anthologies III and IV, Poets in Hell, and The Mulberry Fork Review. He has a MA in Creative Writing and a Ph.D. in Theology, and is a member of the Steampunk Writers and Artists Guild, and the Georgia Writers Association. He has also sung back-up for Broadway plays, provided voice for radio plays, and acted and directed theater stage productions. In his off time, he and his wife race mountain bikes, kayak, and occasionally backpack sections of the Appalachian Trail.","image":"pdmac.jpg","event_list":["83","108","224","302","428"]},{"con_id":"libertycon2015","title":"Author","name":"K. S. Daniels","guest_id":"212","bio":"Kimberly S. Daniels is a recovering academic, who spent four years teaching English Composition and Literature at the University of South Alabama. She&#39;ll never truly recover, but regularly attends meeting for her condition. In the meantime, she writes Science Fiction (Genre fiction! Oh, My!)and consumes copious amounts of coffee and whiskey (not necessarily together or in that order). When she&#39;s not busy writing, much like a cat, she enjoys napping, running suddenly into a randomly selected room, and plotting the destruction of mankind. She exhibits a curious interest robots, leading to the widespread rumor that she may, in fact, be one herself. Her current projects include the third installment of the Valkyrie Trilogy and various short stories. Her first novel, The Valkyrie Profiles, was a quarter finalist for Amazon&#39;s Breakthrough Novel Award in 2013 and the second novel, Flight of the Valkyries debuted in May of 2014 to much fanfare (read: she threw confetti at herself). She also has a prequel short story in the Valkyrie Trilogy, Children of Ymir, that is a Kindle exclusive and another short story in the second Lunar&#39;s Children anthology by Dark Oak Press titled Chimera, which began as horror but somehow still managed to end up as Science Fiction. Much to her own surprise, she currently lives in New Orleans, LA. eating as many raw oysters as robotically possible (that&#39;s a lot of oysters) and working on yet another time machine.","image":"daniels_k_s.jpg","event_list":["108","139","203","212","226","228","298","424","437"]},{"con_id":"libertycon2015","title":"Author","name":"Peter Grant","guest_id":"215","bio":"Peter Grant was born and raised in Cape Town, South Africa. Over the course of two decades he served in the South African armed forces in active and reserve roles, worked in the information technology industry, and engaged in humanitarian activities before being ordained as a pastor.&nbsp; He published a non-fiction book in 1984, as well as several articles over the years in professional publications.&nbsp; In 1997 he immigrated to the USA, where he worked as a pastor and prison chaplain before a crippling injury forced his retirement.\nHe was assured by a neurosurgeon in 2005 that due to the nature of his injuries, he&#39;d never be able to work again or earn his own living in a conventional way.&nbsp; Determined to prove the doctor wrong, he began to study the craft of fiction writing, with emphasis on science fiction and fantasy.&nbsp; Over the next eight years he wrote a dozen unpublished manuscripts totaling a couple of million words.&nbsp; None were very good, but he learned from his mistakes and improved over time.&nbsp; He also began blogging at &#39;<a href=&quot;http://bayourenaissanceman.blogspot.com/&quot; target=&quot;_blank&quot;>Bayou Renaissance Man</a>&#39; with the intention of building up over time a readership that would also enjoy his books in due course.&nbsp; This has proved to be a very successful strategy.\nPeter has received a lot of help from his wife, Dorothy, a pilot whom he met in 2009 in Alaska and married the following year.&nbsp; They moved to Tennessee, where her encouragement has helped him to persevere.&nbsp; She&#39;s provided support in genre and category selection, keyword choices, search engine optimization, and marketing and promotion planning.&nbsp; They work together in areas such as cover image selection and composing back-cover blurb.\nPeter published his first military science fiction novel, &#39;<a href=&quot;http://www.amazon.com/gp/product/B00CS52I32?ie=UTF8&amp;camp=1789&amp;creativeASIN=B00CS52I32&amp;linkCode=xm2&amp;tag=httpbayoure09-20&quot; target=&quot;_blank&quot;>Take The Star Road</a>&#39;, in May 2013.&nbsp; It&#39;s the first in a series titled &#39;The Maxwell Saga&#39;.&nbsp; It was well received, and was followed two months later by a sequel, &#39;<a href=&quot;http://www.amazon.com/gp/product/B00DYUEEQE/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00DYUEEQE&amp;linkCode=as2&amp;tag=httpbayoure09-20&quot; target=&quot;_blank&quot;>Ride The Rising Tide</a>&#39;.&nbsp; In September of that year he published a memoir of prison chaplaincy, &#39;<a href=&quot;http://www.amazon.com/gp/product/B00F98NJYM/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00F98NJYM&amp;linkCode=as2&amp;tag=httpbayoure09-20&quot; target=&quot;_blank&quot;>Walls, Wire, Bars and Souls</a>&#39;.&nbsp; In February 2014 his third SF novel, &#39;<a href=&quot;http://www.amazon.com/gp/product/B00I9OKSIS/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B00I9OKSIS&amp;linkCode=as2&amp;tag=httpbayoure09-20&quot; target=&quot;_blank&quot;>Adapt And Overcome</a>&#39;, was published.&nbsp; He&#39;s currently working on his fourth novel in the series.&nbsp; As of March 2014, over a period of ten months since his first novel was published, Peter has sold over 20,000 books (electronic and paper versions).","image":"grant_peter.jpg","event_list":["108","129","277","310","441","447"]},{"con_id":"libertycon2015","title":"Artist / Author","name":"L. R. Barrett-Durham Powell","guest_id":"216","bio":"L R Barrett-Durham (Powell) has been producing stained glass masterpieces for nearly twenty years. Licensed by Edgar Rice Burroughs, Inc., she is first stained glass artist in history to be the sole licensee to create glass art of an author&rsquo;s trademarked characters. She was given the great honor of both the Polly Freas Viewer&rsquo;s Choice and Best 2D art awards at LibertyCon28. She is also an established author with over half a dozen novels varying in genres of epic fantasy, paranormal romance, sci-fi, horror, and children&#39;s literature. You can always find her in our Huckster Room!","image":"barrett_l_r.jpg","event_list":["32","103","331","422","438"]},{"con_id":"libertycon2015","title":"Scientist / Author","name":"Paula S. Jordan","guest_id":"218","bio":"Paula S. Jordan is the author of three Analog stories, including &ldquo;Vooorh,&rdquo; a novelette, (Jul/Aug 2014.) That story and her previous Analog entry, &ldquo;Two Look At Two&rdquo; (April 2011,) are adaptations from a present-day alien-contact novel now nearing completion. Her first professional publication, &ldquo;The Gift of Unbinding&rdquo; (May, 2001), also appeared in Analog. She is now at work on more short stories as well as the novel. After degrees in history and speech and several years as a freelance writer, Paula earned a BS in physics and worked thirteen years as an orbit analyst for NASA and NOAA. She supported 30+ science missions including the lunar-orbiting Clementine mission that first detected water on the moon.. She invites you to visit her web site at http://PaulaSJordan.com and at her Facebook page at http://tinyurl.com/jywbm9n. She also writes an occasional column, &ldquo;A Writer&rsquo;s View,&rdquo; http://SFSignal.com. Follow her on Twitter: @PaulaSJwriter.","image":"jordan_paula.jpg","event_list":["34","108","233","388"]},{"con_id":"libertycon2015","title":"Scientist / Author","name":"Bart Kemper","guest_id":"220","bio":"Bart Kemper is a Professional Engineer and based in Louisiana. &nbsp;When he is not there, he is somewhere else, such as Iraq, Afghanistan, Vietnam, or Washington State. &nbsp;He&#39;s a writer, soldier, engineer, photographer, father, inventor, and problem solver. &nbsp;Using explosives. &nbsp;No boom today. &nbsp;Maybe boom tomorrow.","image":"kemper_bart.jpg","event_list":["72","108","413"]},{"con_id":"libertycon2015","title":"Author","name":"Chris Smith","guest_id":"221","bio":"A native Texan by birth (if not geography), Chris moved &#39;home&#39; as soon as he could. Attending Texas A+M for two of the four years he lived in College Station, he learned quickly that there was more to college than drinking beer and going to football games. Deciding that a change of venue may be more beneficial, he moved to San Antonio, attending SAC and UTSA, graduating in late 2000 with a BA in Lit. While there, he also met a wonderful lady that somehow found him to be funny, charming, and worth marrying. (She has since changed her mind on the funny and charming, but figures he&#39;s still a keeper.) After the birth of his first child, and while waiting on the second, Chris decided that he should start his own business, and has been running it since 2001. In a fit of creative inspiration, Chris began writing flash fiction in 2012, moved on to short stories, and should be finishing his first solo novel any day now. His first story, &#39;Bad Blood and Old Silver,&#39; appears in the &#39;Luna&#39;s Children:Stranger Worlds&#39; anthology, from Dark Oak Press. Other stories to be released: &#39;What manner of Fool,&#39; featured in Michael Hanson&#39;s &#39;Sha&#39;daa: Inked&#39; anthology; &#39;Isaac Crane and the Ancient Hunger&#39; in Fantom Enterprise&#39;s &#39;Dark Corners&#39; anthology; and &#39;150 Miles to Huntsville&#39; in Baen&#39;s Black Tide Rising anthology. He has also co-authored (with Jason Cordova) &#39;Kraken Mare&#39; from Severed Press. His two cats allow him, his wife, their three kids, and two dogs to reside outside of San Antonio.","image":"smith_chris.jpg","event_list":["60","89","99","167","181","302","311","350","355","358","359","392"]},{"con_id":"libertycon2015","title":"Fan / Scientist","name":"Kevin Pulliam","guest_id":"223","bio":"Kevin Pulliam is an Engineer with the U.S. Army in Huntsville AL and has earned degrees in both Rocket Science and Helicopter Engineering. He is an occasional volunteer editor at the Internet Science Fiction Database (isfdb.org) and has been making beer in his kitchen/garage since 2007.","image":"pulliam_kevin.jpg","event_list":["34","181","371"]},{"con_id":"libertycon2015","title":"Author","name":"Todd McCaffrey","guest_id":"225","bio":"Todd J. McCaffrey is a US Army veteran, a cross-continent pilot, a computer geek, and a New York Times bestselling author. He is also the son of Nebula Grandmaster Anne McCaffrey and grew up in the world of s-f/f publishing and editing. In 1992 he attended Clarion West and has subsequently run several short writing workshops of his own. His near-future AI thriller, City of Angels, will be published in May by Wordfire Press. His website is: http://www.toddmccaffrey.org","image":"mccaffrey_todd.jpg","event_list":["103","108","116","124","338","339","340","350","369","385","412"]},{"con_id":"libertycon2015","title":"Fan / Scientist","name":"Cathe Smith","guest_id":"227","bio":"Cathe Smith has always been interested in insects. As an entomology undergraduate at the University of Wisconsin-Madison, she worked as a crop scout in an integrated pest management lab that worked with potatoes, cabbage, and mint. That experience led her to pick up a second Bachelor of Science in agronomy. She also had a paid internship with a butterfly lab where she was trained as a lab tech in molecular genetic work, preparing her for her later job in an insect molecular genetics lab for the U.S. Department of Agriculture. She worked for six years for the USDA in a quarantine lab assisting in efforts to find non-chemical based population controls for wide-spread pests of plant crops. These attempts at genetic manipulation gave her a real appreciation for amount of work that goes into biotechnology. After six years toiling &quot;in quarantine,&quot; she entered the Entomology and Plant Pathology master&#39;s program at the University of Tennessee at Knoxville, where she specializes in Insect Genetics. Her thesis looks at the genetic diversity within genus Orchesella of Springtails in North America; her work has already doubled the number of genetically described species within that genus. Cathe has been active in fandom for over a decade and has been a repeat contributor to Stephen Euin Cobb&#39;s podcast, &quot;The Future and You.&quot; She is a First Dan black belt and former assistant instructor in the Korean martial art of Han Mu Do. She currently lives in Knoxville, Tennessee, where she crochets and really does need all that yarn","image":"smith_cathe.jpg","event_list":["34","73","90","311","317","373","377","379"]},{"con_id":"libertycon2015","title":"Artist","name":"Sam Flegal","guest_id":"230","bio":"Sam&rsquo;s been a freelance Illustrator since 2009. Working for both book covers and hobby games, his art is described as &ldquo;stylized realism,&rdquo; portraying fantastical things in a graphic manner, but with an eye towards real life. He loves to focus on exaggerated expressions, vibrant colors, and villainess activity. Sam&rsquo;s preferred medium is oil paint. Sam Flegal&#39;s clients include AEG, Fantasy Flight, Hero Games, 3Some Games, Lone Wander, &amp; Eagle Games. He&#39;s worked on titles like Warhammer 40K, Legend of the Five Rings, and Fantasy Hero Complete. Sam won Best Warrior and Best 2D at Dragoncon 2015, Best Color Work at Origins Game Fair 2015, 1st place in the Gen Con 2014 Art Show, Best 2D in the 2014 Liberty Con Art Show, the Jordan Con 2014 Judges&#39; Choice Award, and the Gen Con 2012 Juror&#39;s Choice Award. His work was included in the fantastic art collection, Infected by Art Volume 2, and Volume 3. Sam also has a deep love for Norse Mythology. In his personal work Sam depicts scenes from Norse Lore. His reputation as a Norse enthusiast is increasing and collectors have begun to seek him out for his interpretations of the Northern Gods.","image":"flegal_sam.jpg","event_list":["32","250","414"]},{"con_id":"libertycon2015","title":"Professional Panelist","name":"Miriam Ringo","guest_id":"231","bio":"<strong>Tagline</strong> - Crazy cat lady with blue hair.\n<strong>Introduction</strong> - Daughter of a Baptist minister. &nbsp;Wife of a Science Fiction writer. &nbsp;Love Gothic music. Collect skulls and special needs kitties.&nbsp; Life long learner.\n<strong>Bragging Rights</strong> - Married to John Ringo.","image":"ringo_miriam.jpg","event_list":["73","350"]},{"con_id":"libertycon2015","title":"Professional Panelist","name":"Jeremy Levitt","guest_id":"235","bio":"Jeremy &ldquo;Cubby&#39;s Handler&rdquo; Levitt is a retired Marine trucker who served in Afghanistan. He is an avid Military Sci-Fi reader and has been voted &ldquo;Most likely to egg-on the Apocalypse&rdquo; by his friends. He currently works as a machinst and lives in East Tennessee with his wife Maggie and service dog/attention hound Penny.","image":"levitt_jeremy.jpg","event_list":["14","212","376","383"]},{"con_id":"libertycon2015","title":"Professional Panelist","name":"Dorothy Klapp","guest_id":"240","bio":"Dorothy Klapp was born to a military family and raised wherever her father&#39;s postings took them. She went to Alaska on a whim, fell in love with the wildness of Nature up there, and learned to fly before she could drive;&nbsp; hence the title of her blog - &#39;<a href=&quot;http://wingandawhim.blogspot.com/&quot; target=&quot;_blank&quot;>On A Wing And A Whim</a>&#39;. After almost a decade she ran into a former South African, and agreed with him that the merger of Northern cold and Southern heat would result in a match made in heaven.&nbsp; She and Peter Grant married in 2010 and settled in Nashville, Tennessee, where she still surprises local pilots with the size of the tires on her bush-flying plane.&nbsp; She&#39;s employed as a supervisor in the customer fulfillment sector of the economy, and is an active partner with her husband in independent publishing.","image":"grant_dorothy.jpg","event_list":["108","319","447"]},{"con_id":"libertycon2015","title":"Artist","name":"Stacy Morgan","guest_id":"241","bio":"Stacy grew up painting and drawing on anything that would sit still. Attending high school at Alabama School of Fine Arts and receiving her BFA from the University of Montevallo with a concentration in painting and ceramics, Stacy has had a lifelong obsession with creating art. Now working as a full-time potter, Stacy focuses on making beautiful, functional stoneware pottery including dinnerware, skull jars, sculpture, home decor and knitting bowls that bring the beauty of art to everyday life. When her hands aren&#039;t covered in clay, Stacy spends her time painting, gardening, and obeying her cats. S.P. Morgan Studio pottery is all created from Stacy&#039;s original designs, individually hand made, and high-fired resulting in a beautiful, durable piece of art that can stand up to the uses of daily life.","image":"morgan_stacy.jpg","event_list":["32","103","424","451"]},{"con_id":"libertycon2015","title":"Author / Publisher","name":"Steve Jackson","guest_id":"243","bio":"Steve Jackson graduated from Rice University in Houston. While there, he spent most of his time playing wargames and working on the student paper, the Thresher (he spent two years as editor). He became a writer and game publisher, proving that college can be very valuable as long as you don&#039;t let classes get in your way. He has survived involvements with the Republican Party (alternate delegate to the 1972 convention, but he got better - he now considers himself a small-l libertarian), the SCA (former landed baron and National Chronicler) and law school (escaping before the bar exam; game design was more fun). Steve&#039;s first professional design work was for Metagaming, which published his Ogre, its sequel G.E.V., Melee, Wizard, and several other games. In 1980, Steve bought the rights to Ogre and The Space Gamer magazine from Metagaming and started his own company. That company, Steve Jackson Games Incorporated, is now 30 years old and employs more than 20 people. One of the first releases on the SJ Games label, Raid on Iran (1981), was a critical and sales success. The next year, SJ Games released its first big hit, Car Wars . . . followed shortly by Illuminati. He&#039;s still writing games. Some of the high points: <ul><li>In 1983, Steve was elected to the Adventure Gaming Hall of Fame.</li><li>In 1984, he tried his hand at interactive books or &quot;game novels.&quot; His first one, Scorpion Swamp, was published by Penguin and spent six months on the British children&#039;s bestseller list.</li><li>1986 saw the launch of GURPS, the &quot;Generic Universal Roleplaying System.&quot; As of 2010, the GURPS system - now in its fourth edition - has won a number of awards and is still being supported with new releases.</li><li>In 1990, SJ Games made national news when it filed suit after a destructive raid by the Secret Service. The SS agents, in search of &quot;hackers,&quot; nearly forced the company out of business by seizing hardware and data files. With the help of the newly formed Electronic Frontier Foundation, SJ Games took the case to federal court, proved that the raid had been unjustified and improperly executed, and won more than $50,000 in damages. The EFF remains active to prevent similar abuses.</li><li>In 1994, Steve reworked the old faithful Illuminati to jump on the trading-card bandwagon. INWO (Illuminati: New World Order) became the company&#039;s first million-dollar preship.</li><li>In 2001 came Munchkin, which started as a silly card-game parody of a dungeon crawl and grew into the biggest hit we&#039;ve ever had. For the next few years, most of his creative effort went into Munchkin sequels and supplements.</li><li>In 2009, Steve created two quick dice games, Zombie Dice and Cthulhu Dice. Both were hobby hits which made it onto mass-market shelves . . .and sold more than any other non-Munchkin release that year.</li></ul> Steve is a dedicated SF reader and fan, and enjoys attending both gaming and SF conventions. He writes filksongs (adequately) and sings (very badly). His other interests include gardening (especially water gardening), Lego, pirates, trains, beekeeping, dinosaurs and tropical fish. In his copious free time, he looks at webcomics, eats, and sleeps. (Taken from Mr. Jackson&#039;s <A HREF=&#039;http://sj.sjgames.com/sjbio.html&#039;>Personal Bio Page</A>)","image":"jackson_steve.jpg","event_list":["248","257","258","322","330","366","424"]},{"con_id":"libertycon2015","title":"Author","name":"M. B. Weston","guest_id":"245","bio":"M. B. Weston is an award-winning fantasy, young adult, steampunk, and paranormal author. In The Elysian Chronicles, her flagship fantasy series, she explores guardian angel warfare and treason to epic levels.&nbsp; Her attention to procedure and detail gives her works an authentic gritty military feel that takes an adventure tale to the level of a true page-turner.\nWeston is also a radio talk show host for The Final Cut in Movies, which airs on tmvcafe.com. A gifted orator, Weston has been invited as a guest speaker to numerous writing and science fiction/fantasy panels at conventions across the US, including DragonCon, BabelCon, NecronomiCon, and Alabama Phoenix Festival. She has served on panels with such authors as Sherrilyn Kenyon, J. F. Lewis, Todd McCaffrey, and Jonathan Maberry. Weston has spoken to thousands of students and adults about the craft of writing and has been invited as the keynote speaker at youth camps and at several schools throughout the US.\nWeston&rsquo;s writing attracts both fantasy and non-fantasy readers, and her audience ranges from upper-elementary students to adults. Weston&rsquo;s first paranormal thriller, Unleashed (working title), is slated for release in 2015.","image":"weston_m_b.jpg","event_list":["26","108","136","168","183","235","245","275","281","289"]},{"con_id":"libertycon2015","title":"Author","name":"Doug Dandridge","guest_id":"246","bio":"Doug Dandridge has been writing for eighteen years, and has over twenty books online, including the Amazon Best Selling series Exodus: Empires at War.&nbsp; He lives in Tallahassee, Florida, the hottest place on Earth, which gives him plenty of incentive to stay indoors and write.&nbsp; Doug is a US Army and National Guard veteran (Infantry) and is a military history buff in his spare time.&nbsp;&nbsp; Doug has sold over a hundred thousand books online, and is constantly writing in one of several of his Universes.&nbsp; More information on his books can be found at his website, <a href=&quot;http://dougdandridge.net&quot; target=&quot;_blank&quot;>http://dougdandridge.net</a>,his blog, <a href=&quot;http://dougdandridge.com&quot; target=&quot;_blank&quot;>http://dougdandridge.com</a>, and his Amazon author page, <a href=&quot;http://www.amazon.com/Doug-Dandridge/e/B006S69CTU&quot; target=&quot;_blank&quot;>http://www.amazon.com/Doug-<wbr />Dandridge/e/B006S69CTU</a>.","image":"dandridge_doug.jpg","event_list":["108","228","319","441","446"]},{"con_id":"libertycon2015","title":"Author","name":"Dina Leacock","guest_id":"247","bio":"Diane Arrelle, the pen name of South Jersey writer Dina Leacock, has been writing for more than 20 years and has sold almost 200 short stories. She has two published books, Just A Drop In The Cup, a collection of short-short stories and Elements Of The Short Story, How to Write a Selling Story. She is proud to be one of the founding members as well as the second president of the Garden State Horror Writers and is also a past president of the Philadelphia Writers&rsquo; Conference. She has just retired from being director of a municipal senior citizen center. She lives with her husband, sometimes her sons and of course her cat on the edge of the Pine Barrens in Southern New Jersey (home of the Jersey Devil).\n&nbsp;You can visit her at dinaleacock.com","image":"leacock_dina.jpg","event_list":["50","60","108","132","331","398","412"]},{"con_id":"libertycon2015","title":"Author","name":"Terry Maggert","guest_id":"248","bio":"Terry writes Science Fiction, Horror, and Urban Fantasy because that&rsquo;s all he absorbed prior to 1987. Since that year, he prefers pie with his books, and he&rsquo;s just launched his second series, &ldquo;Banshee&rdquo;. His &ldquo;Fearless&rdquo; series is five books and growing. Husband to a Half-Norwegian, left handed, and a fan of all things oceanic, this is his second visit to LibertyCon.","image":"maggert_terry.jpg","event_list":["103","108","124","168","276","283","289","331","421"]},{"con_id":"libertycon2015","title":"Professional Panelist","name":"Jonna Hayden","guest_id":"250","bio":"Jonna Hayden is a professional Costume Designer, clothing historian, and long-time SF geek. After many years of hiding in the Science Fiction section of the school library, she found her tribe when she attended Orycon 5. She builds shows for the Opera, Ballet, and anyone else who will pay her.","image":"hayden_jonna.jpg","event_list":["32","91","108","190","341","448"]},{"con_id":"libertycon2015","title":"Author","name":"Chris Kennedy","guest_id":"251","bio":"A bestselling Science Fiction/Fantasy author and speaker, Chris Kennedy is a former naval aviator with over 3,000 hours flying attack and reconnaissance aircraft, an elementary school principal and an instructional systems designer for the Navy. Chris is also a member of the Science Fiction and Fantasy Writers of America and the Society of Children&rsquo;s Book Writers and Illustrators. Called &ldquo;fantastic&rdquo; and &ldquo;a great speaker,&rdquo; he has coached hundreds of beginning authors and budding novelists on how to self-publish their stories at a variety of conferences, conventions and writing guild presentations. Chris&rsquo; full-length novels include the &ldquo;Occupied Seattle&rdquo; military fiction duology, &ldquo;The Theogony&rdquo; and &ldquo;Codex Regius&rdquo; science fiction trilogies, and the &ldquo;War for Dominance&rdquo; fantasy trilogy. He is also the author of the #1 self-help book, &ldquo;Self-Publishing for Profit&rdquo; and the leadership book &ldquo;Leadership from the Darkside.&rdquo; See what&rsquo;s up with Chris and join his mailing list at http://chriskennedypublishing.com. You can also find him on Facebook at https://www.facebook.com/chriskennedypublishing.biz and on Twitter at @ChrisKennedy110.","image":"kennedy_chris.jpg","event_list":["34","72","108","125","276","288","291","319","355","382"]},{"con_id":"libertycon2015","title":"Author","name":"Kal Spriggs","guest_id":"252","bio":"Kal Spriggs is a science fiction and fantasy author. He currently has three series in print: The Renegades space opera and space exploration series, the Shadow Space Chronicles military science fiction and space opera series, and the Eoriel Saga epic fantasy series.\nKal is a US Army veteran who has been deployed to Iraq and Afghanistan. He lives in Colorado, and is married to his wonderful wife (who deserves mention for her patience with his writing) and also shares his home with his newborn son, three feline overlords, and a rather put-upon dog. He likes hiking, skiing, and enjoying the outdoors, when he&#39;s not hunched over a keyboard writing his next novel.","image":"spriggs_jacob.jpg","event_list":["108","128","228","278","281","313","431","441","443"]},{"con_id":"libertycon2015","title":"Author","name":"Tom Trumpinski","guest_id":"254","bio":"Tom Trumpinski is a retired teacher (college chemistry) and scientist (built particle detectors for Fermilab) who retired to write full-time.&nbsp; He&#39;s currently in two anthologies in print, Fae Fatales and Allusion of Innocence, and the online pulp magazine Latchkey Tales #1.&nbsp; He&#39;s been married a lot and has four children ages 42-14.&nbsp; He lives in a old-folks commune in Champaign, Illinois.","image":"trumpinski_tom.jpg","event_list":["34","42","103","108","392","423","435"]},{"con_id":"libertycon2015","title":"Author","name":"Jonathan David Baird","guest_id":"255","bio":"Jonathan David Baird has worked as an archaeologist for the past fifteen years throughout the Southeast. He left full-time field work in 2011 to finish graduate school. In 2012 Jonathan received a masters degree in English literature from Fort Hays State University. His focus of study was the development of late Victorian Gothic horror. In 2014 he finished a second masters in American history. Jonathan is the editor and a major contributor to NukeMars.com and has written for and edited several anthology collections.","image":"baird_david.jpg","event_list":["83","108","148","212","298","396","398","442"]},{"con_id":"libertycon2015","title":"Author","name":"Martin Powell","guest_id":"256","bio":"Biography Martin Powell has been a professional writer since 1986, having written hundreds of stories in numerous genres for Disney, Marvel, DC, Dark Horse, and Capstone Books, among others. Nominated for the prestigious Eisner Award for his work with Sherlock Holmes, he has written many of the most popular characters in the industry, including Superman, Batman, Popeye the Sailor, Frankenstein, and Tarzan of the Apes. Currently, as the author of more than a half dozen different Edgar Rice Burroughs online comic strips, and the critically acclaimed Jungle Tales of Tarzan, it is probable that Powell has written more Edgar Rice Burroughs characters than any other contemporary writer. His The Tall Tale of Paul Bunyan won the coveted Moonbeam Golden Award for Best Children&#39;s Graphic Novel of 2010, and Powell is the co-creator of The Halloween Legion, a recent nominee for the Stan Lee Excelsior Award. https://www.facebook.com/martin.powell1 http://www.amazon.com/Martin-Powell/e/B001JRXRSU","image":"powell_martin.jpg","event_list":["103","315","341","394","438","439"]},{"con_id":"libertycon2015","title":"Author","name":"Thomas A. Mays","guest_id":"259","bio":"Thomas A. Mays (Tom) is a 19-years-and-counting veteran of the US Navy, working as an officer in the surface fleet aboard destroyers and amphibious ships, as well as teaching and assisting with research into electromagnetic weapons and ballistic missile defense. He has two degrees in Applied Physics, but his passion is writing (he tries not to let what he actually knows get in the way of telling a good story). An SFWA-qualifying short story author with 7 pro and semi-pro short stories published since 2009, A Sword Into Darkness is his first published novel.&nbsp; He is working on a sequel (among other projects) and released an anthology of his published and unpublished military science fiction, REMO in April, 2014. Tom usually lives wherever the Navy tells him to (currently North Carolina), making a home with his lovely wife, three beautiful kids, and an insane Hawaiian mutt. Tom&#39;s blog, The Improbable Author, can be found at: http://improbableauthor.com/","image":"mays_tom.jpg","event_list":["34","72","80","108","289","297","303","310","402","413","430"]},{"con_id":"libertycon2015","title":"Scientist","name":"Bill Thomasson","guest_id":"262","bio":"Bill Thomasson helps biomedical researchers write their journal articles and grant applications, but that doesn&rsquo;t begin to capture his broad interest in all aspects of science and what the future may bring. What technologies are going to drive the next 40-year long-wave economic cycle? What social and political changes will that bring? Is an interstellar government conceivable in a slower-than-light universe? He has been reading SF since the first appearance of Rocket Ship Galileo but didn&rsquo;t discover cons until 1980. It took him another decade to discover just how much fun it was being on panels. When not working or reading SF, Bill serves as volunteer Treasurer for Chicago&rsquo;s annual Disability Pride Parade (he has been legally blind since 2000) and has worked Accessibility Services for every WorldCon since 2011.","image":"thomasson_bill.jpg","event_list":["34","73","103","212","317","326","379","388"]},{"con_id":"libertycon2015","title":"Author","name":"Kacey Ezell","guest_id":"263","bio":"Captain Kacey Ezell is an active duty USAF instructor pilot with 2000+ hours in the UH-1N Huey and 122 combat hours flying the Mi-171 in Iraq.&nbsp; When not teaching young pilots to beat the air into submission, she writes sci-fi/fantasy/horror fiction.&nbsp; She is married with two daughters.","image":"ezell_kacey.jpg","event_list":["60","89","99","108","167","350","355","358","359","392"]},{"con_id":"libertycon2015","title":"Fan Panelist","name":"Robert Groller","guest_id":"266","bio":"Robert Groller is software developer for Cox. He recently moved to Atlanta with his girlfriend, Stephanie, and their 2 Siberian forest cats. Robert started brewing in 2009 and has a patent pending hobby game case. When not at craft breweries you will often find him cooking or gaming.","image":"groller_robert.jpg","event_list":["181"]},{"con_id":"libertycon2015","title":"Author","name":"Rick Boatright","guest_id":"273","bio":"Rick Boatright has been the &quot;tech guy&quot; for the 1632 series since 2001.&nbsp; He&#39;s published in the hardcover Grantville Gazettes as well as the E-Zine.&nbsp; Rick&#39;s common activities at cons feature his &quot;Weird Tech&quot; presentation, which he insists has nothing to do with steampunk.&nbsp; Outside of the SF universe, Rick is a partner in a small software development firm.","image":"boatright_rick.jpg","event_list":["34","81","99","108","297","303","350","402"]},{"con_id":"libertycon2015","title":"Author","name":"Kevin Evans","guest_id":"276","bio":"Kevin H Evans has been writing since 2006; other interests include vintage locomotive restorations, hot air ballooning, SCA combat, gunsmithing, tool and die making.","image":"evans_kevin.jpg","event_list":["108","297","303","350","401","402"]},{"con_id":"libertycon2015","title":"Author","name":"James Young","guest_id":"277","bio":"James Young is a Missouri native who left small town life to attend a small, well-known Federal institution in upstate New York. After obtaining a degree in military history from West Point, Mr. Young spent six years repaying his education via military service in various locations (both foreign and domestic). Along the way he collected a loving, patient, and beautiful spouse (Anita C. Young)...and various animals that only fit those descriptions when it suited them.\nAfter leaving the Army, James returned to the Midwest to pursue his Ph.D. in U.S. History while working for the Republic (again). When not tormenting his characters, Mr. Young spends his spare time reading Anita&#39;s first drafts, finishing that pesky dissertation, and trying to figure out whose idea it was to get a pair of flatulent, WWE emulating shelter dogs with paper fetishes. Usually he can be found at various book signings and Cons in the greater KC area.&nbsp; http://www.amazon.com/James-Young/e/B00AVKCQZQ","image":"young_james.jpg","event_list":["108","131","212","290","405","441"]},{"con_id":"libertycon2015","title":"Author","name":"Anita C. Young","guest_id":"278","bio":"Anita C. Young is a Medical Laboratory Scientist who spends her free time thinking of ways to explain the supernatural and unexplained through science. She loves animals and is an intensely introverted person who coined the phrase &quot;Caution when approaching introverts; they startle easily and may flee into traffic&quot;. http://www.amazon.com/Anita-C.-Young/e/B00HI6MD3G","image":"young_anita.jpg","event_list":["26"]},{"con_id":"libertycon2015","title":"Author","name":"Karen Evans","guest_id":"280","bio":"Karen Evans has been writing SF/F with her husband for almost 10 years, and enjoying the roller-coaster. She planned on being a writer since third grade where she learned cursive, and knew she could now write. When not writing, she enjoys crocheting, embroidery, and other busy-hand activities so she can listen to the voices in her head. She lives in New Mexico with her husband, a dog and a variable number of cats.","image":"evans_karen.jpg","event_list":["108","297","303","350","401","402"]},{"con_id":"libertycon2015","title":"Author","name":"Griffin Barber","guest_id":"281","bio":"A veteran police officer, Griffin Barber is also a lifelong Speculative Fiction fan and avid gamer. He&#39;s had several shorts published in the Grantvile Gazette and penned a well-received novella for RSI&rsquo;s website called: A Separate Law. 1636: Mission to the Mughals, co-authored with Eric Flint, is forthcoming. My blog is here at: http://therantinggriffin.blogspot.com","image":"barber_griffin.jpg","event_list":["99","108","179","297","303","350","402","405","413"]},{"con_id":"libertycon2015","title":"Author","name":"Robert Buettner","guest_id":"282","bio":"National best-selling author Robert Buettner&rsquo;s debut novel, Orphanage, 2004 Quill Award nominee for Best SF/Fantasy/Horror novel, was called the Post-9/11 generation&rsquo;s Starship Troopers and &ldquo;one of the great works of modern military science fiction.&rdquo; Orphanage has been adapted for film by Olatunde Osunsanmi (The Fourth Kind) for Davis Entertainment (Predator, I Robot, Eragon). Orphanage and other books in Robert&rsquo;s Jason Wander series have been translated into Chinese, Czech, French, Japanese, Russian, and Spanish. Robert was a 2005 Quill nominee for Best New Writer. In April, 2014 Baen Books released Robert&rsquo;s eighth novel, Balance Point and will release his ninth, The Golden Gate, in December, 2016. A long-time Heinlein Society member, Robert wrote the Afterword for Baen&rsquo;s re-issue of Heinlein&rsquo;s Green Hills of Earth/Menace From Earth short story collection. His short stories appear regularly in various print and online venues. Robert served as the author judge for the 2011 National Space Society Jim Baen Memorial short story writing contest. Robert is a former U.S. Army intelligence officer and National Science Foundation Fellow in Paleontology. As attorney of record in more than three thousand cases, he practiced in the U.S. federal courts, before courts and administrative tribunals in no fewer than thirteen states, and in five foreign countries. Six, if you count Louisiana. He lives in Georgia with his family and more bicycles than a grownup needs. Visit him on the web at www.RobertBuettner.com.","image":"buettner_bob.jpg","event_list":["34","72","88","99","108","128","179","226","350","413","442","449"]},{"con_id":"libertycon2015","title":"Professional Panelist","name":"Carol Johnson","guest_id":"286","bio":"Carol Johnson&rsquo;s academic path has been &lsquo;atypical,&rsquo; to have accomplished a study-abroad degree through European campus, University of Maryland. She resided six years in an international dorm of Friederich-Alexander Universitaet, while becoming proficient in German and taking as many courses as were offered in International Terrorism (she was UM field registrar). Her first academic love had been nutrition science in pursuit of a degree, however her knowledge gap in chemistry competency required altering plans. Taking &rsquo;science walks&rsquo; during the dating era of getting to know Les&hellip; She married, and eight yrs. later found out why nutrition and health was to enter front and center stage. Thereafter, Carol actively advocated school health for children with special needs. She completed well, two decades of full time motherhood and homemaking, during which time she also filled delegate positions in Montgomery for travel-seminars with Partners in Policy Making of Alabama for people with neurodeveopmental disabilities. She enjoys all the activities she married into, of Les&rsquo; diverse space-impassioned endeavors, and reminds this crowd that she fondly recalls her newlywed debut into her very first Con, LibertyCon in 1988.","image":"johnson_carol.jpg","event_list":["350"]},{"con_id":"libertycon2015","title":"Author","name":"Robby Hilliard","guest_id":"288","bio":"Robby Hilliard, a native of Chattanooga TN who now resides in Marietta GA, writes horror, science-fiction, and fantasy. His first published short story, &ldquo;Cold Case&rdquo;, can be found in the Sha&rdquo;Daa Shared-Word, Dark-Fantasy Universe published by Copper Dog Publishing.","image":"hilliard_robby.jpg","event_list":["60","103"]},{"con_id":"libertycon2015","title":"Author","name":"Brett Brooks","guest_id":"289","bio":"Once told that if he were a villain, he&rsquo;d be called Sarcastro, Brett Brooks is a sharp-witted, dry-humored, and generous-natured writer based in metro Atlanta, Georgia. His work is intelligent, hilarious, and sometimes sexy, focusing on heroic characters, empowered women, and the occasional talking animal. He is not above defying the conventions of genre just to make sure a good story is told. Brett has long been involved in both the comic and gaming world. He has written comics for both Dark Horse and Tekno Comics, as well as working on White Wolf&rsquo;s World of Darkness RPG. For twenty years he was a staff writer for Comic Shop News and the managing editor of Game Shop News. In the early 2000&rsquo;s he published the cult-favorite RPG Xcrawl and later the kid-friendly RPG, Meddling Kids. From a novel writing point of view, he is the author of the critically acclaimed horror-comedy novel Edible Complex, as well as the fantasy novel series The Champions of Elan. His latest novel is the pulp-noir novel Red is the Darkest Color.","image":"brooks_brett.jpg","event_list":["108","135","277","282","296","332","341","394","421"]},{"con_id":"libertycon2015","title":"Author","name":"David E. Pascoe","guest_id":"290","bio":"David E. Pascoe is a ne&rsquo;er-do-well of broad interests and little focus. He spent his childhood firmly ensconced in worlds of fantasy and science fiction with brief sorties into worlds of contemporary, horror and historical fiction of various stripes and inclinations. After rigorous intellectual training in theology and philosophy, he elected to enlist in the United States Navy, during which he used none of his skills to particularly good effect. Upon his separation from active duty, he dove back into science fiction, but this time as a writer. David spends his time in relative isolation somewhere on the East Part of the North American continent. His time is devoured by his infant son, and caring for his wife. Writing has taken something of a back seat, a circumstance not to David&#39;s liking, nor to that of the characters occupying his head. They seem to be organizing a strike . . .","image":"pascoe_david.jpg","event_list":["42","108","138","176","350","398","423"]},{"con_id":"libertycon2015","title":"Artist","name":"Tom Biondolillo","guest_id":"293","bio":"Tom Biondolillo is currently adapting the fanged and furry summer camp horror story- Frenzy (Hyperion/Disney Books) - with creator/author Rob Lettrick into a graphic novel form. An illustrator, comic artist, concept artist, storyboard artist and writer; Tom has worked on comics, toys, RPGs, video games for products and properties including: Star Wars, Aliens, Predator, Aliens vs. Predator, Dungeons and Dragons/Dragonlance, Myst, Duke Nukem, Crucible, Haunted House Tycoon, Vampire VTES, Mage, Scion, Swords and Sorcery, Steam Punk, FRAG, Cardboard Heroes, The Weird West, Shadow Run, Legends of the Five Rings, Legends of the Seven Seas, and Legends of the Burning Sands, among others. He&#39;s done work for companies the likes of Artisan Entertainment, Hasbro, Resaurus Toys, Palisades Toys, TSR Inc., Wizards of the Coast, Dark Horse, Caliber Comics, Desperado Press, CCP/White Wolf, Alderac Entertainment Group, Steve Jackson Games, FASA, Artisan Entertainment, and Hasbro. Tom is a professor at the Art Institute of Atlanta teachig in the Media Arts and Animation and Game Art and Design departments and freelances from his home outside of Atlanta, GA.","image":"biondolillo_tom.jpg","event_list":["32","91","108","250","394","414","451"]},{"con_id":"libertycon2015","title":"Publisher","name":"De Anna McHarge Manning","guest_id":"294","bio":"The stated goal of Iron Clad Press is to introduce &quot;Tomorrow&#39;s Writers Today.&quot; However, Iron Clad Press does more than this, featuring many distinguished writers as well.&nbsp; Started by the late John P. Manning, Jr., John&#39;s dream is being carried on by his widow, DeAnna Manning, CEO, and Stormy Medina, Creative Director and Chief Editor.\nCome try out the horror novel, &quot;Black Stump Ridge&quot; (set in the vicinity of Chattanooga), and horror anthologies, &quot;What Scares the Boogey Man?&quot;, and the recently released &quot;Terror By Gaslight,&quot; the first book in the Night Chill Series. The second book in the series, &quot;Dark Corners,&quot; is coming soon.","image":"manning_deanna.jpg","event_list":["103","108","141","167","355"]},{"con_id":"libertycon2015","title":"Professional Panelist","name":"Jason \"PK\" Levine","guest_id":"297","bio":"Reverend Jason &quot;PK&quot; Levine (Praise &quot;Bob&quot;!) has been a diehard gamer since he GMed his first RPG at age 12. Now he edits, writes, and produces supplements for Steve Jackson Games, as the Assistant <b><i>GURPS</i></b> Line Editor, one of his latest books is <b><i>GURPS Mars Attacks</i></b>.&nbsp; In his spare time, he geeks out to everything from obscure music to Transformers toys and is comfortable anywhere from a book club to a rave. He&#39;d love to talk to you about gaming or almost anything else, and has plenty of games (board, card, and RPG) to play!","image":"levine_jason.jpg","event_list":["257","258","330","347","348"]},{"con_id":"libertycon2015","title":"Author","name":"Jonathan Maberry","guest_id":"299","bio":"Jonathan Maberry is a New York Times bestselling author, multiple Bram Stoker Award winner, and comic book writer. He writes horror, thrillers, fantasy, science fiction, and suspense for adults and teens. His novels include Predator One, Code Zero, Rot & Ruin, Fall of Night, Ghost Road Blues, Patient Zero, and many others. Several of Jonathan&#039;s novels are in development for movies or TV including V-Wars, Extinction Machine, Rot & Ruin, and Dead of Night. He&#039;s the editor/co-author of V-Wars, a vampire themed anthology; and is editor for a series of all-original X-Files anthologies, the YA anthology Scary Out There, and the dark fantasy anthology Out of Tune. His V-Wars books have been developed as a board game. He is a popular featured expert on History Channel shows like Zombies: A Living History and Monsters, Myth, and Legend. Since 1978 he&#039;s sold more than 1200 magazine feature articles, 3000 columns, two plays, greeting cards, song lyrics, and poetry. His comics include V-Wars, Rot & Ruin, Captain America: Hail Hydra, Bad Blood, Marvel Zombies Return, and Marvel Universe vs the Avengers. He lives in Del Mar, California with his wife, Sara Jo and their dog, Rosie.","image":"maberry_jonathan.jpg","event_list":["27","95","103","108","137","178","219","393","394","395","396","398"]},{"con_id":"libertycon2015","title":"Artist","name":"Todd Lockwood","guest_id":"302","bio":"<i>(From Mr. Lockwood&#039;s <A HREF=&quot;http://toddlockwood.com/bio/&quot;>Bio Page</A>)</i> I was born and grew up in Boulder, Colorado. I had the Rocky Mountains in my backyard, and I got to see the &quot;summer of love&quot; through the eyes of an eleven year old in a college town. I watched Lost in Space in the third grade, when G.I. Joe was new, and Star Trek after that. Ray Harryhausen&#039;s movies were favorites. Science Fiction and Fantasy consumed my childhood. In my teens I discovered Tolkien&#039;s Lord of the Rings, and Dungeons and Dragons not long after. I&#039;ve been Role-Playing since 1977. As an adult I became fascinated with Mythology, particularly transformative mythology and the hidden meanings of Myth. Joseph Campbell is my guru. Google him. I started drawing before I can remember. One of my earliest childhood memories is of sitting on my dad&#039;s lap as he drew funny cartoon animals for me. Throughout my childhood I drew, and wrote stories, and combined stories and pictures in comic books of my own making, for my own entertainment. After High School, I attended the Colorado Institute of Art in Denver. It was primarily a design school, but they taught all of the important basics. I worked in advertising for fourteen years. Toward the end I began to plot my escape--Iwould either get a better class of work, or I would hang up my brushes and get a real estate license. Fortunately (or unfortunately?) for me, I got a better class of work. It was at conventions, especially Dragon Con, that I met the people who would open the door for me. One thing led to another, and suddenly I was moving my family to Illinois, across the border from Lake Geneva, Wisconsin, where I was the newest member of TSR&#039;s art staff. It was a skinny little window of opportunity that opened for the briefest moment. I dived through. Later, Wizards of the coast bought TSR and moved us to Washington State. It was here in Washington, that my work began to really excel. Designing the look and feel of Third Edition Dungeons and Dragons was one of the high points of my professional career. How could I possibly have more fun than designing dragons for D&D? I am very lucky, and very happy in my work. Washington became my children&#039;s &quot;home town,&quot; and honestly--I love it here. In 2000, Hasbro bought Wizards of the Coast and at the end of 2002, dispensed with their art staff. One of the new CO&#039;s was heard to say that &quot;fantasy artists are a dime a dozen.&quot; Ouch. In 2003 I released my first art book, Transitions, from Paper Tiger. The Tiger went belly up not long after my book released, and so it is difficult to find. Since then I&#039;ve been freelancing, doing work for publishers and gaming companies and for private commissions. I did twenty-plus covers for R.A. Salvatore&#039;s Drizzt books, for C.J. Cherryh, Tad Williams, Marie Brennan, and others. In the last few years my old story-telling muse was reawakened. I&#039;ve sold short stories, and am working on a novel for DAW Books, to be released in May of 2016. There are other projects in the works, including another art book. Stick around--the best is yet to come.","image":"lockwood_todd.jpg","event_list":["27","32","95","103","105","108","139","410"]},{"con_id":"libertycon2015","title":"Author","name":"Dave Schroeder","guest_id":"303","bio":"Dave Schroeder is a retired IT executive from Atlanta who enjoys performing with the Atlanta Radio Theatre Company. He&#39;s written three SF humor novels, Xenotech Rising, Xenotech Queen&rsquo;s Gambit, and Xenotech What Happens, about an entrepreneur supporting alien technology after Earth joins the Galactic Free Trade Association.","image":"schroeder_dave.jpg","event_list":["10","104","108","184","275","284","287","320","430"]},{"con_id":"libertycon2015","title":"Author","name":"Dan Thompson","guest_id":"304","bio":"Dan Thompson was born in Texas but grew up in the Midwest. After leaving the US Army in 1980, he worked in applied research in infrared optics, high energy lasers and digital instrumentation. He is now retired from the DoD. His hobbies include scale modeling and writing (fiction and non-fiction).","image":"thompson_dan.jpg","event_list":["34","108","405","412","439","440"]},{"con_id":"libertycon2015","title":"Author","name":"Nan Monroe","guest_id":"305","bio":"I am a lover of books, movies, and music. Gilded Dragonfly Books has published four of my short stories, &ldquo;Sybilla diSante and the Sepia World&rdquo; (in Haunting Tales of Spirit Lake), &ldquo;Christmas Rose&rdquo; (in A Stone Mountain Christmas), &ldquo;Neighbor Haint&rdquo; (in Finding Love&rsquo;s Magic), and &ldquo;Firegale at the Festival&rdquo; (in Legends of the Dragon, Vol. 1). My first novel, the YA fantasy-romance Atterwald, was published in December 2014. As Kelley S. Ceccato, I have written a number of audio dramas for the Atlanta Radio Theatre Company.","image":"ceccato_kelly.jpg","event_list":["104","108","126","143","183","245","278","362","426","427","430"]},{"con_id":"libertycon2015","title":"Author","name":"Bill Swears","guest_id":"306","bio":"Bill Swears wrote Zook Country while recovering from injuries received trying to fly an experimental airplane from Hawaii to San Francisco. He&#39;s an Alaskan husband and father, technical writer/editor, PhD student, and dog breeder, and was a college professor, a USCG (rescue) and Army helicopter pilot (also, less savory things).","image":"swears_bill.jpg","event_list":["103","108","126","235","283","285","364","420","428"]},{"con_id":"libertycon2015","title":"Author","name":"Declan Finn","guest_id":"307","bio":"Declan Finn is the author of Honor At Stake, an urban fantasy novel published by Eternal Press, part of Damnation Books. The tagline is: Welcome to New York City, where vampires don&#39;t sparkle, they burn. He also writes thrillers, video game reviews, and works for six blogs. He is one of a legion of writers over at The Catholic Geeks blog (a legion, for we are many). Finn is also a member of the Catholic Writer&#39;s Guild in what passes for his real life. Other books he has written includes the comedy-thriller It Was Only on Stun! where he blows up a sci-fi convention (no, not this one). He co-authored the science fiction espionage novel Codename: Winterborn. However, he is most proud of The Pius Trilogy, the main goal of which is to take Dan Brown out to the woodshed by using real history, and good writing.","image":"finn_declan.jpg","event_list":["108","131","168","321","411","421"]},{"con_id":"libertycon2015","title":"Author","name":"Lou Antonelli","guest_id":"308","bio":"&quot;Lou Antonelli started writing fiction in middle age; his first story was published in 2003 when he was 46. He&rsquo;s had 97 short stories published in the U.S., U.K., Canada and Australia, in venues such as Asimov&#39;s Science Fiction, Jim Baen&#39;s Universe, Tales of the Talisman, Andromeda Spaceways In-Flight Magazine, Greatest Uncommon Denominator (GUD), Daily Science Fiction, Buzzy Mag, and Omni Reboot, among others. &quot;His collections include &ldquo;Fantastic Texas&rdquo; published in 2009; &ldquo;Texas &amp; Other Planets&rdquo; published in 2010; and &ldquo;The Clock Struck None&rdquo; and &ldquo;Letters from Gardner&rdquo;, both published in 2014. &quot;His story &ldquo;Great White Ship&rdquo;, originally published in Daily Science Fiction, was a 2013 finalist for the Sidewise Award for alternate history. His short story &ldquo;On a Spiritual Plain&rdquo;, originally published in Sci Phi Journal, was a finalist for the Hugo award in 2015. &quot;A Massachusetts native, he moved to Texas in 1985 and is married to Dallas native Patricia (Randolph) Antonelli. They have three adopted furbaby children, Millie, Sugar and Peltro Antonelli.&quot;","image":"antonelli_lou.jpg","event_list":["108","123","279","285","307","313","405","412"]},{"con_id":"libertycon2015","title":"Author","name":"Jeremy Hicks","guest_id":"309","bio":"Jeremy Hicks is an archaeologist, author, and co-creator of the Cycle of Ages Saga. Finders Keepers, the first novel in the saga, was published by Dark Oak Press. The sequel, Sands of Sorrow, was released last year. Jeremy is co-owner of Broke Guys Productions and writes screenplays and short stories too.","image":"hicks_jeremy.jpg","event_list":["103","108","128","281","289","290","321","428","431","442"]},{"con_id":"libertycon2015","title":"Author","name":"Brad Sinor","guest_id":"310","bio":"Bradley Sinor has been writing for five/sixths of his life, and has written many short stories, most of them in a variety of anthologies and three short story collections. He lives in Tulsa, OK, with his wife (writer and copy-editor) Sue Sinor.","image":"sinor_brad.jpg","event_list":["108","136","224","297","350","401","402"]},{"con_id":"libertycon2015","title":"Author","name":"Sue Sinor","guest_id":"311","bio":"Sue Sinor has several short stories and 2 chapbooks (Playing With Secrets and Bubba Fables) published by Yard Dog Press, as-well-as a story in Grantville Gazette 41 and the DAW anthology &lsquo;Rotten Relations&rsquo;, both written with husband Brad. They live in Tulsa, OK, with four cats.","image":"sinor_sue.jpg","event_list":["108","136","297","350","401","402"]},{"con_id":"libertycon2015","title":"Scientist","name":"Stephen Fleming","guest_id":"312","bio":"At various times, Stephen Fleming has been paid to be an optical physicist, laser fabricator, software developer, field engineer, product manager, corporate trainer, marketing executive, salesman, general manager, entrepreneur, author, venture capitalist, board member, investment banker, consultant, angel investor, public speaker, adjunct university faculty, commercial landlord, academic bureaucrat, and economic developer. As a venture capitalist, Stephen has over 15 years of private equity experience at the General Partner level. Prior to his venture capital career, he spent 15 years in operations roles at AT&amp;T Bell Laboratories, Nortel Networks, and LICOM (a venture-funded startup). An Atlanta native and summa cum laude graduate of Georgia Tech, Stephen returned to his alma mater in mid-2005 where he currently serves as Vice President, Economic Development and Technology Ventures, Executive Director of the Enterprise Innovation Institute at Georgia Tech, and Director of the Advanced Technology Development Center (ATDC). In addition to his roles at Georgia Tech, he is a member of the Investment Committee of the Seraph Group, an early-stage venture capital firm. Stephen is active in the &ldquo;alternative space&rdquo; industry; he is an investor in five private aerospace companies and is a founding member of the Space Angels Network. Mr. Fleming also serves on the boards of the Technology Association of Georgia and of Culture Connect, a not-for-profit fostering cultural fluency between immigrants and the community at large. He is a former board member of the Spiritual Living Center of Atlanta, and of Tech High School, a charter high school that emphasized science, math, and technology in urban Atlanta. He is a member of the Leadership Atlanta Class of 2014.","image":"fleming_stephen.jpg","event_list":["34","103","108","375","386"]},{"con_id":"libertycon2015","title":"Author / Performer","name":"Gray Rinehart","guest_id":"313","bio":"Gray Rinehart is the only person to have commanded an Air Force tracking station, written speeches for Presidential appointees, had music on &quot;The Dr. Demento Show,&quot; and been nominated for a literary award. Gray&#39;s fiction has appeared in Analog Science Fiction &amp; Fact, Asimov&#39;s Science Fiction, Orson Scott Card&#39;s Intergalactic Medicine Show, and elsewhere. His story, &quot;Ashes to Ashes, Dust to Dust, Earth to Alluvium,&quot; was a finalist for the 2015 Hugo Award for Best Novelette. He is also a singer/songwriter with two albums of mostly science-fiction-and-fantasy-inspired songs, and the author of a number of nonfiction articles, essays, and one book on improving education. Before becoming a Contributing Editor ( the &quot;Slushmaster General&quot; ) for Baen Books, Gray fought rocket propellant fires, refurbished space launch facilities, commanded the AF Satellite Control Network&#39;s largest and northernmost satellite tracking station, and did other interesting things during his rather odd career. Gray&#39;s alter ego is the Gray Man, one of several famed ghosts of South Carolina&#39;s Grand Strand, and his web site is <A HREF=\"http://www.graymanwrites.com\">www.graymanwrites.com</A>. <A HREF='https://grayrinehart.bandcamp.com/album/truths-and-lies-and-make-believe'> Gray&#039;s Album: <I>Truth and Lies and Make Believe</I> </A> <A HREF='https://grayrinehart.bandcamp.com/album/distorted-vision'> Gray&#039;s Album: <I>Distorted Vision</I></A>","image":"rinehart_gray.jpg","event_list":["27","46","55","57","99","103","108","178","350","387","450"]},{"con_id":"libertycon2015","title":"Scientist","name":"David Bogen","guest_id":"314","bio":"David Bogen (BSEE, PE, Corporate Fellow) has been in the electric utility industry for nearly 35 years and has helped implement many changes that analyze, control and monitor the conditions of the electric transmission system. In 1990 David earned his Professional Engineering License in the state of Texas. In 1994 David was picked to be a member of the team that implemented the first Energy Management System for TXU Energy which transmission the utility from using traditional SCADA system to then cutting edge control and analysis applications. In 2006 David was name a Corporate Follow for his work in State Estimation and implementing Real-Time Advance Transmission Analysis applications at Oncor Electric Delivery. He has been a staunch supporter for the implementation of systems that relay open standards for data exchange and has worked with both national and international standard organizations. Consequently, he has been an active participant in IEEE, EPRI, NASPI, IEC, CIMug, ERCOT, NERC, and SGIP.","image":"bogen_david.jpg","event_list":["34","103","194","381"]},{"con_id":"libertycon2015","title":"Scientist / Author","name":"Darin Kennedy","guest_id":"315","bio":"Darin Kennedy, born and raised in Winston-Salem, North Carolina, is a graduate of Wake Forest University and Bowman Gray School of Medicine. After completing family medicine residency in the mountains of Virginia, he served eight years as a United States Army physician and wrote his first novel in 2003 in the sands of northern Iraq. His debut novel, a paranormal thriller titled The Mussorgsky Riddle, was born from a fusion of two of his lifelong loves: classical music and world mythology. The sequel, The Stravinsky Intrigue, is due out in late 2016 and continues the journey through myth, music, and madness. Pawn&#39;s Gambit, his contemporary fantasy, and another project, this one his first YA novel, are both on submission at this time. His short stories can be found in over twenty anthologies and magazines. He is currently, as always, hard at work on his next novel. Doctor by day and novelist by night, he writes and practices medicine in Charlotte, North Carolina. When not engaged in either of the above activities, he has been known to strum the guitar, enjoy a bite of sushi, and rumor has it he even sleeps on occasion. Find him online at darinkennedy.com, on Twitter @darinkennedy, on Facebook @ Darin Kennedy - Author, &amp; on Goodreads @ Darin Kennedy - Goodreads Author.","image":"kennedy_darin.jpg","event_list":["34","73","108","127","173","286","287","288","378","428"]},{"con_id":"libertycon2015","title":"Author","name":"Rod S. Belcher","guest_id":"316","bio":"R.S. Belcher is author of the Golgotha series ( Six-Gun Tarot, the Shotgun Arcana and the Queen of Swords, which is currently in production), the Nightwise Series, and the Brotherhood of the Wheel series&mdash;all published by Tor Books. He lives in Roanoke Virginia with his children, Jonathan and Emily.","image":"belcher_rod.jpg","event_list":["108","112","137","168","302","392","446"]},{"con_id":"libertycon2015","title":"Author","name":"Sevan Paris","guest_id":"317","bio":"When Sevan Paris isn&#39;t involved in things UTCish, he is writing something incredibly geeky, probably involving superheroes. His titles include thirteen volumes of the Superheroes in Prose series and Space Pulp! He enjoys all things comics, Transformers, Science Fiction, and anything George Lucas related prior to 1999. Despite each of these child-like addictions, his wife, Cindy, continues to love him in a super adult-like fashion. You can keep up with his many ramblings and release schedule at sevanparis.com.","image":"paris_sevan.jpg","event_list":["108","138","284","295","296","394","437"]},{"con_id":"libertycon2015","title":"Author","name":"Mike Massa","guest_id":"318","bio":"Mike Massa has lived an adventurous life, including stints as Navy SEAL officer, an investment banker and a technologist. He lived outside the US for several years, plus the usual deployments. Newly published, Mike is married with three sons, who check daily to see if today is the day they can pull down the old lion. Not yet...","image":"massa_mike.jpg","event_list":["89","99","108","350","358","359","429"]},{"con_id":"libertycon2015","title":"Author","name":"Michael R. Ault","guest_id":"319","bio":"Michael Ross Ault has been writing since age 13, 47 years later he is still at it. After a several year detour into technical writing where he published two dozen Oracle related books, Mike has returned to his first love, writing fiction. Mike has published 5 novels and a novella as well as a collection on short stories. Mike has been published in Genre&#39; Sampler magazine and in several terror anthologies published by Lake Fossil Press. Mike writes action adventure with his Rex Franklin series of adventures, sword and sorcery with the Quest of the Rune Sword trilogy, post apocalyptic fiction with the Darkness series and now moves into the realms of magic with his Suppressors series. He brings his experience in nuclear, aerospace and computers mixed in with his hobbies of scuba diving, hunting, fishing, prepping and writing into his work. Mike lives in the Smokey mountains at Sunset Cove with his bride of 43 years, Susan.","image":"ault_michael.jpg","event_list":["103","108","139","284","295","310","332","431"]},{"con_id":"libertycon2015","title":"Author / Publisher","name":"Becky Kyle","guest_id":"320","bio":"Born on Friday 13, Rebecca developed an early love for the unusual. Dragons, vampires and magical beings stir her to the keyboard. She currently lives between the Smoky and Cumberland mountains with her husband and four cats. Her first YA novel, Fanny &amp; Dice, was released on Halloween 2015.","image":"kyle_becky.jpg","event_list":["108","126","183","245","421","444"]},{"con_id":"libertycon2015","title":"Author","name":"Tom Kratman","guest_id":"322","bio":"Tom Kratman is a political refugee and defector from the People&#39;s Republic of Massachusetts. The mechanism of his defection was enlisting into the Army in 1974 at age 17, which deeply distressed his high school (Boston Latin, founded 1635) as they thought he had &quot;higher and better things&quot; ahead of him. He served two years as an enlisted grunt with the 101st Airborne and one and a half with the 193rd Infantry Brigade in Panama, getting 2 years of college done in the process (when he wasn&#39;t in the field he was taking courses). At that point the Army gave Kratman a scholarship and sent him off to Boston College to finish his degree and obtain a commission. Tom graduated, cum laude, in 1980 and returned to the Army as an infantry officer. Tom served another three year tour in Panama, then more schooling at Benning, then 4+ years with the 24th Infantry Division near Savannah, Georgia. Fun times then ceased for a while, while he did two years in Recruiting Command. Saddam Hussein (UHBP) rescued Tom from this by invading Kuwait. He has been told that he was the only captain to actually escape from USAREC for the war. Tom arranged a transfer to Special Operations Command and went through the active part of the campaign attached to 5th Special Forces. He continued slurping at the Army trough until it became painfully clear that the bottom had dropped out of the militantly and violently aggressive anti-communism market and that he was not going to like the rather PC direction the Army (which was, arguably, the only thing he ever selflessly loved) was heading in. Among other things, Tom earned a Combat Infantry Badge and the Ranger Tab. Tom got out in 92 and went to law school. He hated it but was far too pig headed to quit. He became a lawyer in 95 and quickly realized that what he had felt about law school was but a pale shadow of true hate. Stayed in the Reserves and took every tour he could to avoid practicing law. And when the reserves had nothing interesting there was MPRI (&quot;white collar mercenaries R us&quot;). Saddam Hussein (UHBP) once again stepped to the fore and saved Tom from the continued practice of law. In February of 2003 the Army called him up to participate in the invasion of Iraq. Still, God has a sense of humor. While awaiting a flight over Tom was informed he had a 100% blockage in his right coronary artery (imagine his chagrin) and wasn&#39;t going anywhere fun anytime soon. Instead, he spent eight months stuck at Fort Bragg, then a few in the DC area, before finally being sent on to be on the faculty of the Army War College as Director, Rule of Law, for the US Army Peacekeeping and Stability Operations Institute. Keep in mind that divine sense of humor previously mentioned. Tom retired in 2006, bored out of his gourd and finally ready to admit his love affair with the Army was over. He&#39;s returned to Virginia and, instead of practicing law, writes full time for Baen, Castalia, and Defy Media. (That means, NO, don&#39;t ask for legal advice because there&#39;s no more confidentiality with him. He&#39;s outa da bidnez.) His books published to date include Countdown: The Liberators, Countdown: M Day, Countdown: H Hour, Caliphate, A State of Disobedience, A Desert Called Peace, Carnifex, The Lotus Eaters, The Amazon Legion, Come and Take Them, and The Rods and the Axe. His collaborations with John Ringo include Watch on the Rhine, Yellow Eyes, and, The Tuloriad. Tom&#39;s married to a (really beautiful) girl from rural western Panama. He and Yolanda have 3 children and 3 grandchildren. Yoli and Tom make their home in Blacksburg, VA.","image":"kratman_tom.jpg","event_list":["72","99","108","125","350","400"]},{"con_id":"libertycon2015","title":"Editor","name":"Gary Poole","guest_id":"323","bio":"Gary Poole has been in the entertainment and publishing industry for nearly thirty years. He&#39;s worked directly with John Ringo on over a dozen novels, and has adapted several of them into screenplays (all of which remain in development). When not working with Ringo, he is the managing editor of a successful alternative newsweekly in Tennessee and spent years on the radio as a talk show host and award-winning broadcast journalist.","image":"poole_gary.jpg","event_list":["99","194","298","350","358","359"]},{"con_id":"libertycon2015","title":"Author","name":"Rob Howell","guest_id":"326","bio":"Rob is a reformed medieval academic who draws upon those skills and resources for his stories and settings. He has also been an IT professional, a cook, and a soda jerk. Originally from Houston, Texas, he dutifully followed his parents as they went from there to Hillsboro, Texas, then to Cape Girardeau, Missouri, and finally to Wichita, Kansas. Along the way, they discovered about the only way to keep Rob quiet was to give him a book. Unfortunately for them, it turned out he could read very quickly, so they had to give him lots of books. He latched onto the Hardy Boys series first, then about anything else he could reach. Without books, either he or his parents probably would not have survived. Possibly both. Rob has traveled extensively. Most recently, in 2012, he walked the majority of the Offa&#39;s Dyke Trail along the border of Wales and England. Many experiences on the trail shaped his writing. One might say the Offa&#39;s Dyke Trail led to Edward. He decided to write professionally when he discovered he was too educated for most jobs, and not quite educated enough for a few. Fortunately, he had always written and had always wanted to emulate Forester, Tolkien, Weber, Drake, Parker, Chandler, and Francis. Now he can.","image":"howell_rob.jpg","event_list":["108","129","143","277","283","290","431"]},{"con_id":"libertycon2015","title":"Performer","name":"Whit Williams","guest_id":"327","bio":"Whit Williams is a writer, a medic, and a protege of the great Hank Reinhardt. His published work includes the short story Lion Country and the interim chapters of Hank Reinhardt&#39;s Book Of Knives. Currently he is working on a new book, The Reinhardt Method of Rapier &amp; Dagger, the first in a series of four books about sword technique.","image":"williams_whit.jpg","event_list":["351","353"]},{"con_id":"libertycon2015","title":"Author","name":"S. Andrew Swann","guest_id":"328","bio":"S. Andrew Swann is the pen name of Steven Swiniarski. He&rsquo;s married and lives in the Greater Cleveland area where he has lived all of his adult life. He has a background in mechanical engineering and&mdash; besides writing&mdash; works as a Database Manager for the largest private child services agencies in the Cleveland area. He has published 25 novels since 1993, which include science fiction, fantasy and horror. He has recently completed the Dragon* series of light fantasy novels for DAW books, consisting of Dragon&bull;Princess, Dragon&bull;Thief, and Dragon&bull;Wizard.","image":"swann_s_andrew.jpg","event_list":["103","108","245","279","291","306","362","431"]},{"con_id":"libertycon2015","title":"Scientist","name":"Paul Boberg","guest_id":"329","bio":"Paul Boberg, AKA &quot;Engineer&quot;, will present a panel on steam power including a display of a working rotary steam motor. Covered in the presentation will be how a steam engine works and the problems that anyone in a steak punk world would face working with similar devices.&nbsp;","event_list":["34","83","372"]},{"con_id":"libertycon2015","title":"Scientist / Author","name":"Arlan Andrews","guest_id":"330","bio":"Dr. Arlan Andrews, Sr., has been an SF fan since age 10, an SF writer for 35 years, and a retired engineer for 3 years. He is an active futurist, consultant, and SF writer, and the founder of SIGMA, the science fiction think tank. Among his more than 500 publications are recent stories in ANALOG, one of which received a Hugo nomination last year. His several e-books of SF are available for Kindle and Nook. Arlan and Joyce are the proud grandparents of 11 exceptional grandchildren.","image":"andrews_arlan.jpg","event_list":["34","103","108","194","360","370","386"]},{"con_id":"libertycon2015","title":"Author","name":"Amie Gibbons","guest_id":"331","bio":"Amie was born and raised in Utah, flew south for school and stayed. She lawyers, writes, dances, sings, and cat-wrangles, and does some better than others. She lives with a picture snapping cat trapped in a man&#39;s body, and a man trapped in a cat&rsquo;s body, who misses opposable thumbs.","image":"gibbons_amie.jpg","event_list":["19","26","108","285","286","287","409"]},{"con_id":"libertycon2015","title":"Author","name":"Scott Bragg","guest_id":"332","bio":"Scott Bragg, is a native of Atlanta, Georgia. His head in the clouds, earning his keep building clouds for IT companies. An amateur photographer, he prefers shooting people who generally don&#39;t shoot back. He is kept sane and well-grounded by his wife, the always-awesome Wendi Bragg.","image":"bragg_scott.jpg","event_list":["108","292","293","294","355"]},{"con_id":"libertycon2015","title":"Author","name":"Daniel Allen Butler","guest_id":"333","bio":"Daniel Allen Butler is a best-selling author, historian, and college-educated semi-professional beach bum. After a stint in the United States Army and later working as a wage-slave, he became a full-time author. When not writing, he&rsquo;s a woodworker, gearhead, and model builder, noted for his love of single malt and cigars","image":"butler_daniel.jpg","event_list":["108","292","293","294","355","445"]},{"con_id":"libertycon2015","title":"Artist / Author","name":"John Holmes","guest_id":"334","bio":"Sergeant First Class (Retired) John F. Holmes served for 22 years in the Regular army and Army National Guard before hanging up his rifle in 2013 and picking up the pen. Since then he has written thirteen books, covering every genre out there. His most popular is the &quot;Zombie Killers&quot; series of seven books. There are also Young Adult, Fantasy, Space Opera, Techno-thriller, and Humor. He is also the creator of the popular military comic strip &quot;Power Point Ranger&quot;. He lives and works in Upstate NY.","image":"holmes_john.jpg","event_list":["32","108","394","420"]},{"con_id":"libertycon2015","title":"Author","name":"Allan Kemp","guest_id":"335","bio":"Allan Kemp is the author of the Black Phoenix urban fantasy series. His short stories have appeared in &ldquo;Dark Gothic Resurrected,&rdquo; &ldquo;Eyedrum Periodically,&rdquo; and the urban fantasy anthology &ldquo;Babes and Beasts&rdquo; from Bloody Kisses Press. When he&rsquo;s not writing books, he is an award winning television promotions writer/producer.","image":"kemp_allan.jpg","event_list":["108","168","171","276","362","363"]},{"con_id":"libertycon2015","title":"Author","name":"Bobby Nash","guest_id":"336","bio":"An award-winning author, Bobby Nash writes novels, comic books, short stories, novellas, graphic novels, and the occasional screenplay for a number of publishers and production companies including IDW Publishing, Sequential Pulp Comics, Dark Horse Comics, Moonstone Books, Airship 27 Productions, Pro Se Productions, Raven&rsquo;s Head Press, Stark Raving Press, Farragut Films, Dark Oak Press, Avatar Press, Fight Card Books, Radio Archives, BEN Books, and more. Bobby is a member of the International Association of Media Tie-in Writers and International Thriller Writers. He was named Best Author in the 2013 Pulp Ark Awards. Rick Ruby, a character co-created by Bobby and author Sean Taylor also snagged a Pulp Ark Award for Best New Pulp Character of 2013. Bobby has also been nominated for the 2014 New Pulp Awards and Pulp Factory Awards for his work. In 2015, Bobby&#39;s novel, Alexandra Holzer&#39;s Ghost Gal: The Wild Hunt won a Paranormal Literary Award in the 2015 Paranormal Awards. For more information on Bobby Nash please visit him at www.bobbynash.com and across social media. If you see him walking around the con, please say hi and make sure he&#39;s not lost.","image":"nash_bobby.jpg","event_list":["108","124","292","293","294","394","420","435","439"]},{"con_id":"libertycon2015","title":"Author","name":"Nick Braker","guest_id":"337","bio":"Nick Braker graduated with a BS in computing science from the University of Evansville before launching a career in computer programming, engineering, and management. Married and a father of two, Braker is also an avid table tennis player and role playing gamer.","image":"braker_nick.jpg","event_list":["103","141","281","313","363"]},{"con_id":"libertycon2015","title":"Author","name":"Jeb Kinnison","guest_id":"338","bio":"Jeb Kinnison grew up in the Midwest. He discovered science fiction in second grade, starting with Tom Swift books and quickly moving to Heinlein juveniles and adult science fiction. He studied computer and cognitive science at MIT, and wrote programs modeling the behavior of simulated stock traders and the population dynamics of economic agents. Later he did supercomputer work at a think tank that developed parts of the early Internet (where the engineer who decided on &lsquo;@&lsquo; as the separator for email addresses worked down the hall.) He retired a few years ago and began writing science fiction with the Substrate Wars series.","image":"kinnison_jeb.jpg","event_list":["108","385","441"]},{"con_id":"libertycon2015","title":"Professional Panelist","name":"Brian Cooksey","guest_id":"339","bio":"Brian Cooksey is the chairman of Hypericon in Nashville, TN and he is one of the hosts of the Play On Target podcast. He also works as a tabletop RPG editor and system consultant. His latest project is for the Sagaborn system.","event_list":["32","103","261","322","411"]},{"con_id":"libertycon2015","title":"Author","name":"Taylor Hoch","guest_id":"340","bio":"Taylor S. Hoch has been creating other worlds for people to experience since 1996. She is the author of the Prospero Clydesdale O&#39;Shaughnessy YA fantasy series with three books out and a fourth book due out next year. She spent most of her adult life traveling extensively in the U.S. working as a restoration carpenter and contractor on historical landmarks and playing her songs at music festivals. When Taylor isn&#39;t writing novels, she is a songwriter and musician. She published two albums of Americana music and her songs play on radio stations worldwide and on radio networks such as the BBC and RADI. She holds a master&#39;s degree in both English Literature and Creative Writing, as well as undergraduate degrees in both English and Liberal Arts, is the mother of two amazing young men, and lives in rural Tennessee with her wife, two dogs, one evil incarnate cat, and about thirty chickens. She is an avid gamer and SF/Fantasy fan.","image":"hoch_taylor.jpg","event_list":["108","130","284","294","298","355","364","429"]},{"con_id":"libertycon2015","title":"Artist / Author","name":"Robert S. Evans","guest_id":"341","bio":"Robert S. Evans is a Georgia Native film writer and director. Having worked on countless projects both large and small, he is always staying active. He attended the New York Film Academy, and shortly there after caught the attention of industry veteran Jeff Burr (Leatherface: Texas Chainsaw Massacre 3) . Robert caught his first break with the film &quot;The Last Piece Standing&quot;, an Indie Psychological Horror Film which garnered praise for its detailed and chilling world, winning him the Best Original Story at the Seattle Scream Fest in 2006. In 2013 his short film &quot;To Fight&quot; netted him a Best Director award and was featured in several festivals as well as getting a 3 night TV run as a block of short films that featured Boxing. His latest project, &quot;Cold&quot; is about a young woman who is battling with depression and suicide.","image":"evans_robert.jpg","event_list":["32","108","425"]},{"con_id":"libertycon2015","title":"Author","name":"Laura Montgomery","guest_id":"342","bio":"Laura Montgomery began reading science fiction when she was thirteen, when the local U.S. Air Force base donated many amazing books to the school she attended in northern Thailand. She practices space law in Washington, D.C., and has worked on space tourism and launch safety regulations, which, honestly, are not science fiction. She writes science fiction with a legal twist, and space opera. Her books include Sleeping Duty, a space opera, Manx Prize, a hard science fiction novel about orbital debris, and The Sky Suspended, a novel of lawyers, crowds, and a starship.","image":"montgomery_laura.jpg","event_list":["103","108"]},{"con_id":"libertycon2015","title":"Author","name":"Michael Lackey","guest_id":"343","bio":"A believer in things most found silly, Michael Lackey has always been a dreamer. He loved to pretend as a child in the forests of Alabama. Michael would find himself in a land of monsters where he was the only one who could save the world from utter destruction. In his free time, Michael would map out bike courses and fantasize about becoming the next big Hollywood stuntman. With the stunts complete, Michael would raise his sword high and proclaim himself the slayer of the mystical beasts plaguing his land. Like most over imaginative children, real life set in for Michael. Work. Adulthood. Family. He never really grew out of his imagination, but rather suppressed it to the point of monotony. Now in his forties, Michael&#39;s stories and love for fantasy come alive on the pages of The Bad Seed. Join Michael on his fantasy-filled quest to tell the story of the brave Zachery Morely and his adventures on Amundiss. michael-lackey.weebly.com","image":"lackey_mike.jpg","event_list":["135","280","288","290"]},{"con_id":"libertycon2015","title":"Author","name":"Rich Weyand","guest_id":"344","bio":"Rich Weyand is a computer consultant and digital forensic analyst. He was born in Illinois and lived there almost 60 years before he and his wife engineered an escape to the hills of southern Indiana in 2011. His undergraduate and graduate education is in Physics, and he&#39;s never really recovered. He has co-authored several legal books and articles on automated trade secret asset management, and is currently heading up the launch of a computer software start-up. The June 2016 publication of his anthology of Hard-SF and Fantasy shorts, Adamant and other stories, is his first published fiction.","image":"weyand_rich.jpg","event_list":["19","34","103","138","278","280","363"]},{"con_id":"libertycon2015","title":"Publisher","name":"James J. Sullos, Jr.","guest_id":"345","bio":"JAMES J. SULLOS, JR. is the president of Edgar Rice Burroughs, Inc., the entity that owns all copyrights and trademarks related to the works of Edgar Rice Burroughs (1875-1950). Jim assumed his role in May, 2008, having previously been appointed Vice President and a member of the Board of Directors in 1994. Jim served the company as the outside accountant prior to his Board membership. Among the accomplishments of Jim&rsquo;s tenure are the release of the feature films, Walt Disney&rsquo;s John Carter (2012) and Warner Bros.&rsquo; The Legend of Tarzan (2016), the original Netflix animated television series Tarzan and Jane (Fall, 2016), and the production of new novels, comics, apparel, and merchandise.","image":"sullos_james.jpg","event_list":["438"]},{"con_id":"libertycon2015","title":"Publisher","name":"Cathy Wilbanks","guest_id":"346","bio":"CATHY WILBANKS joined Edgar Rice Burroughs, Inc. as a warehouse clerk when she was still in high school. In the ensuing years, Cathy&rsquo;s role has grown more authoritative. She worked closely with Danton Burroughs (the author&rsquo;s grandson), and was promoted to archivist in 2008 after Danton&rsquo;s death. Today she assists Jim Sullos in overseeing the many media and print projects licensing Tarzan of the Apes, John Carter of Mars, and the company&rsquo;s other franchises.","image":"wilbanks_cathy.jpg","event_list":["438"]}],"events":[{"con_id":"libertycon2015","title":"Reading: Dave Schroeder & Tamara Lowery","event_id":"10","description":"Come out and have a seat as our author guests read passages of their works","datetime":1468087200000,"room_id":"3","room_name":"Gallery B","guest_list":["159","303"]},{"con_id":"libertycon2015","title":"Reading - Amie Gibbons & Rich Weyand","event_id":"19","description":"Come out and have a seat as our author guest reads passages from her works.","datetime":1468170000000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["331","344"]},{"con_id":"libertycon2015","title":"Paranormal Activities Panel","event_id":"26","description":"Our panel of intrepid paranormal researchers and writers will talk about their latest endeavors. Paul Cagle (Mod.)","datetime":1468116000000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["18","27","29","37","245","278","331"]},{"con_id":"libertycon2015","title":"Opening Ceremonies","event_id":"27","description":"Opportunity to meet the LibertyCon Guests and Staff","datetime":1468011600000,"room_id":"5","room_name":"Centennial Theater","guest_list":["140","158","299","300","302","313"]},{"con_id":"libertycon2015","title":"Artist Meet & Greet","event_id":"32","description":"Did something catch your eye in the Art Show? This is a chance to meet the Artist and let them tell you about it. Don&#039;t forget to bid!","datetime":1468026000000,"room_id":"7","room_name":"Art Show","guest_list":["5","6","29","36","140","144","154","164","216","230","241","250","293","302","334","339","341"]},{"con_id":"libertycon2015","title":"Spades Tournament (First Round Part B)","event_id":"33","description":"Every year THERE CAN BE ONLY ONE to win bragging rights for a year. Will you be the one? Sign-up sheets will be at the Norfolk room.","datetime":1468035000000,"room_id":"16","room_name":"American Train Car","guest_list":["149"]},{"con_id":"libertycon2015","title":"Mad Scientist Roundtable","event_id":"34","description":"Roundtable discussion of various and timely science topics moderated by Les Johnson. This is a remarkable panel dating back to the earliest LibertyCons. Everyone gets a say but no one gets to say too much.","datetime":1468119600000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["9","14","20","28","39","67","131","134","136","149","153","156","157","179","180","182","184","186","189","218","223","227","251","254","259","262","273","282","304","312","314","315","329","330","344"]},{"con_id":"libertycon2015","title":"Closing Ceremonies - Let&#039;s Bitch at Brandy","event_id":"39","description":"Did you have a great time at the convention? Or was there something that absolutely irritated you? Either way, come out and let us know at our Closing Ceremonies.","datetime":1468177200000,"room_id":"1","room_name":"Finley Room","guest_list":["15","144"]},{"con_id":"libertycon2015","title":"Reading: Gray Rinehart","event_id":"46","description":"Come out and have a seat as our Master of Ceremonies reads passages of his works","datetime":1468008000000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["313"]},{"con_id":"libertycon2015","title":"Reading - John Ringo","event_id":"48","description":"Come out and have a seat as our author guest reads passages of his works","datetime":1468029600000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["3"]},{"con_id":"libertycon2015","title":"Reading - Jody Lynn Nye","event_id":"49","description":"Come out and have a seat as our author guest reads passages of her works","datetime":1468080000000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["198"]},{"con_id":"libertycon2015","title":"Reading - Dina Leacock & Mark Wandrey","event_id":"50","description":"Come out and have a seat as our author guests read passages of their works.","datetime":1468105200000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["207","247"]},{"con_id":"libertycon2015","title":"Changes in the World of Publishing","event_id":"55","description":"This panel of publishers will discuss the pros and cons of the current changes ongoing in the publishing industry. Gray Rinehart, Mod.","datetime":1468173600000,"room_id":"5","room_name":"Centennial Theater","guest_list":["8","12","18","127","313"]},{"con_id":"libertycon2015","title":"Concert: Gray Rinehart","event_id":"57","description":"Come join our Master of Ceremonies as he performs songs off his albums, with a few additional numbers (either original or covers)! Come on, come all!","datetime":1468026000000,"room_id":"5","room_name":"Centennial Theater","guest_list":["313"]},{"con_id":"libertycon2015","title":"What&#039;s New from Copper Dog Publishing / Moondream Press?","event_id":"60","description":"Publisher Michael Hanson and his authors talk about what&#039;s new this year from Moondream Press..","datetime":1468094400000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["12","15","19","130","202","221","247","263","288"]},{"con_id":"libertycon2015","title":"Art and Charity Auction","event_id":"66","description":"Make sure you don&#039;t get outbid - come and enjoy our auctioneers and fabulous artwork, books, Tuckerizations, etc..","datetime":1468105200000,"room_id":"1","room_name":"Finley Room","guest_list":["131","144","149"]},{"con_id":"libertycon2015","title":"NASA Update","event_id":"67","description":"Les Johnson on what has happened in the past year in Space, and what might happen in the coming years.","datetime":1468008000000,"room_id":"1","room_name":"Finley Room","guest_list":["9"]},{"con_id":"libertycon2015","title":"Technological Future of War","event_id":"72","description":"Michael Z. Williamson moderates this perennial panel on how today&#039;s advances will affect the future of warfare (Council of Colonels Edition).","datetime":1468018800000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["7","220","251","259","282","322"]},{"con_id":"libertycon2015","title":"Global Pandemics and Biosecurity","event_id":"73","description":"We as a society worry a *lot* about influenza and hemorrhagic fevers, yet the diseases to date have been self-limiting. How realistic is the danger from a global pandemic? In contrast, our food supply has many gaps in which toxins can enter (witness the contamination problems for Chipotle restaurants). What are the consequences of the gaps in our biosecurity? What are the relative and comparative dangers to our society from these threats? What can we,or should we do about them? Phil Wohlrab, Mod.","datetime":1468072800000,"room_id":"2","room_name":"Gallery A","guest_list":["180","186","227","231","262","315"]},{"con_id":"libertycon2015","title":"Setup for ARTC","event_id":"74","description":"Setup for ARTC Performance","datetime":1468105200000,"room_id":"5","room_name":"Centennial Theater","guest_list":[]},{"con_id":"libertycon2015","title":"Reading: Thomas Mays & David Burkhead","event_id":"80","description":"Come out and have a seat as our author guests read passages of their works","datetime":1468112400000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["20","259"]},{"con_id":"libertycon2015","title":"Reading - Rick Boatright & Geoffrey Mandragora","event_id":"81","description":"Come out and have a seat as our author guests read passages from their works","datetime":1468166400000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["163","273"]},{"con_id":"libertycon2015","title":"Reading - Charles E. Gannon","event_id":"82","description":"Come out and have a seat as our author guest reads passages of his works","datetime":1468076400000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["184"]},{"con_id":"libertycon2015","title":"Dangers in the World of Steampunk","event_id":"83","description":"Paul Boberg moderates this panel on the dangers of steam and other inventive ways to kill off your Steampunk villain.","datetime":1468000800000,"room_id":"2","room_name":"Gallery A","guest_list":["126","163","208","211","255","329"]},{"con_id":"libertycon2015","title":"Reading: Robert Buettner","event_id":"88","description":"Come out and have a seat as our author read passages from his works.","datetime":1468083600000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["282"]},{"con_id":"libertycon2015","title":"Reading - The 4 HorsePersons of the Anthology","event_id":"89","description":"Come out and have a seat as our author guests reads passages of their works","datetime":1468004400000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["19","221","263","318"]},{"con_id":"libertycon2015","title":"Sit&#039;n&#039;Stitch","event_id":"90","description":"Sit&#039;n&#039;Stitch hosted by Cathe Smith - come and tat, knit, stitch, crochet, etc. to your heart&#039;s content!","datetime":1468076400000,"room_id":"3","room_name":"Gallery B","guest_list":["122","227"]},{"con_id":"libertycon2015","title":"Kids Costuming / Masquerade and Magic Show","event_id":"91","description":"For the kids who love to dress up and show off we offer a great combo. Doc Osborn will introduce each child at the start of his Magic Show and then entertain them in his wonderful world of magic while judges award prizes (Judges: Jonna Hayden, Cindy MacLeod, Dan Hollifield) ).","datetime":1468090800000,"room_id":"3","room_name":"Gallery B","guest_list":["25","126","250","293"]},{"con_id":"libertycon2015","title":"Charity Art Jam","event_id":"92","description":"Watch the Artists bounce around ideas and complete their vision before time runs out. All the pieces will go to the Charity Auction to be auctioned off!","datetime":1468090800000,"room_id":"7","room_name":"Art Show","guest_list":["5","6","140","154","164"]},{"con_id":"libertycon2015","title":"Kids Dungeons & Dragons","event_id":"94","description":"Glenn Baggot will run this 4th Edition campaign for kids.","datetime":1468072800000,"room_id":"10","room_name":"Norfolk Room","guest_list":["189"]},{"con_id":"libertycon2015","title":"Celebrity Jeopardy","event_id":"95","description":"Watch as Jonathan Maberry, Todd Lockwood, and Jim Beall battle it out with fast answers on Art, Science, Literature and other fun topics.","datetime":1468170000000,"room_id":"1","room_name":"Finley Room","guest_list":["144","179","299","302"]},{"con_id":"libertycon2015","title":"Baen Traveling Slideshow and Prize Patrol","event_id":"99","description":"Toni Weisskopf will be running the crowd through the best of what&#039;s going on in the Baen universe. (And there will be giveaways!)","datetime":1468087200000,"room_id":"5","room_name":"Centennial Theater","guest_list":["3","7","8","9","10","28","85","93","168","184","198","199","221","263","273","281","282","313","318","322","323"]},{"con_id":"libertycon2015","title":"Horror Luncheon Banquet and Guest of Honor Speeches","event_id":"103","description":"Horror themed Luncheon Banquet. Come hear the Guests of Honor speak!","datetime":1468080000000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["8","15","122","131","134","140","144","153","171","207","216","225","241","248","254","256","262","288","294","299","302","306","309","312","313","314","319","328","330","337","339","342","344"]},{"con_id":"libertycon2015","title":"ARTC Presentation: &quot;All Hallows&#039; Moon&quot;","event_id":"104","description":"The setting is the Old West: Mother Lode, New Mexico. A handful of people -- drovers, saloon girls, barkeep, preacher and sheriff -- wait in a saloon on a stormy Hallowe&#039;en night. They wait for the dawn, when they will go their separate ways, and Mother Lode will truly become a ghost town. But the storm brings the unexpected arrival of a girl who might or might not be from Boston, a gun fighter who might or might not be dead, and a gambler who might or might not be the Devil.","datetime":1468112400000,"room_id":"5","room_name":"Centennial Theater","guest_list":["59","128","303","305"]},{"con_id":"libertycon2015","title":"Artist Guest of Honor Walk Through","event_id":"105","description":"Stroll among the wondrous works of art in our Art Show with the Artist Guest of Honor Todd Lockwood. All artists are encouraged to attend.","datetime":1468076400000,"room_id":"7","room_name":"Art Show","guest_list":["302"]},{"con_id":"libertycon2015","title":"Kaffeeklatsch","event_id":"108","description":"Have coffee / continental breakfast and chat with the pros","datetime":1468159200000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["8","9","12","18","19","20","36","40","59","62","85","93","120","122","126","127","130","140","154","156","159","168","171","179","182","184","194","198","200","208","211","212","215","218","220","225","240","245","246","247","248","250","251","252","254","255","259","263","273","276","277","280","281","282","289","290","293","294","299","302","303","304","305","306","307","308","309","310","311","312","313","315","316","317","318","319","320","322","326","328","330","331","332","333","334","335","336","338","340","341","342"]},{"con_id":"libertycon2015","title":"Spades Tournament (Second Round)","event_id":"109","description":"Every year THERE CAN BE ONLY ONE to win bragging rights for a year. Will you be the one? Sign-up sheets will be at the Norfolk room.","datetime":1468090800000,"room_id":"16","room_name":"American Train Car","guest_list":["149"]},{"con_id":"libertycon2015","title":"Spades Tournament (Final Round)","event_id":"110","description":"Every year THERE CAN BE ONLY ONE to win bragging rights for a year. Will you be the one? Sign-up sheets will be at the Norfolk room.","datetime":1468094400000,"room_id":"16","room_name":"American Train Car","guest_list":["149"]},{"con_id":"libertycon2015","title":"Reading: Rod S. Belcher","event_id":"112","description":"Come out and have a seat as our author guest reads passages of his works","datetime":1468000800000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["316"]},{"con_id":"libertycon2015","title":"Reading - Todd McCaffrey","event_id":"116","description":"Come out and have a seat as our author guest reads passages from his works","datetime":1468116000000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["225"]},{"con_id":"libertycon2015","title":"Autograph Session (Antonelli, Wandrey)","event_id":"123","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468170000000,"room_id":"6","room_name":"Dealer's Room","guest_list":["207","308"]},{"con_id":"libertycon2015","title":"Autograph Session (Maggert, McCaffrey, Nash)","event_id":"124","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468173600000,"room_id":"6","room_name":"Dealer's Room","guest_list":["225","248","336"]},{"con_id":"libertycon2015","title":"Autograph Session (K. Bogen, Hartness, C. Kennedy, Kratman)","event_id":"125","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468166400000,"room_id":"6","room_name":"Dealer's Room","guest_list":["40","122","251","322"]},{"con_id":"libertycon2015","title":"Autograph Session (Kyle, Monroe, Swears)","event_id":"126","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468008000000,"room_id":"6","room_name":"Dealer's Room","guest_list":["305","306","320"]},{"con_id":"libertycon2015","title":"Autograph Session (D. Kennedy, Strickland)","event_id":"127","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468004400000,"room_id":"6","room_name":"Dealer's Room","guest_list":["59","315"]},{"con_id":"libertycon2015","title":"Autograph Session (Buettner, Hicks, Spriggs)","event_id":"128","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468076400000,"room_id":"6","room_name":"Dealer's Room","guest_list":["252","282","309"]},{"con_id":"libertycon2015","title":"Autograph Session (Baker, Grant, Howell, Perry)","event_id":"129","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468090800000,"room_id":"6","room_name":"Dealer's Room","guest_list":["120","171","215","326"]},{"con_id":"libertycon2015","title":"Autograph Session (Hoch, Johnson, Ringo)","event_id":"130","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468018800000,"room_id":"6","room_name":"Dealer's Room","guest_list":["3","9","340"]},{"con_id":"libertycon2015","title":"Autograph Session (Cochrane, Finn, Herring-Jones, J. Young)","event_id":"131","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468015200000,"room_id":"6","room_name":"Dealer's Room","guest_list":["62","194","277","307"]},{"con_id":"libertycon2015","title":"Autograph Session (Burkhead, Leacock, Patterson)","event_id":"132","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468080000000,"room_id":"6","room_name":"Dealer's Room","guest_list":["20","202","247"]},{"con_id":"libertycon2015","title":"Autograph Session (Brooks, Lackey, Lowery, Osborn)","event_id":"135","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468083600000,"room_id":"6","room_name":"Dealer's Room","guest_list":["39","159","289","343"]},{"con_id":"libertycon2015","title":"Autograph Session (B. Sinor, S. Sinor, Mandragora, Weston)","event_id":"136","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468094400000,"room_id":"6","room_name":"Dealer's Room","guest_list":["163","245","310","311"]},{"con_id":"libertycon2015","title":"Autograph Session (Belcher, Correia, Maberry)","event_id":"137","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468162800000,"room_id":"6","room_name":"Dealer's Room","guest_list":["168","299","316"]},{"con_id":"libertycon2015","title":"Autograph Session (Carpenter, Paris, Pascoe, Weyand)","event_id":"138","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.) 138","datetime":1468087200000,"room_id":"6","room_name":"Dealer's Room","guest_list":["208","290","317","344"]},{"con_id":"libertycon2015","title":"Autograph Session (Ault, Daniels, Lockwood)","event_id":"139","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468098000000,"room_id":"6","room_name":"Dealer's Room","guest_list":["212","302","319"]},{"con_id":"libertycon2015","title":"Reading - Nick Braker & DeAnna McHarge Manning","event_id":"141","description":"Come out and have a seat as our author guests read passages of their works","datetime":1468108800000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["294","337"]},{"con_id":"libertycon2015","title":"Reading - Nan Monroe & Rob Howell","event_id":"143","description":"Come out and have a seat as our author guests read passages from their works.","datetime":1468094400000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["305","326"]},{"con_id":"libertycon2015","title":"Large Dice Games with Fritz and Agatha","event_id":"153","description":"Fritz Fotovich and Agatha Jean will be offering this year&#039;s giant dice in the Gallery B.","datetime":1468004400000,"room_id":"3","room_name":"Gallery B","guest_list":["144"]},{"con_id":"libertycon2015","title":"Large Dice Games with Fritz and Agatha","event_id":"156","description":"Fritz Fotovich and Agatha Jean will be offering this year&#039;s giant dice in the Gallery B.","datetime":1468083600000,"room_id":"3","room_name":"Gallery B","guest_list":["144"]},{"con_id":"libertycon2015","title":"Ice Cream Social","event_id":"157","description":"Our hospitality staff&#039;s way to cool you off on a hot July afternoon.","datetime":1468094400000,"room_id":"8","room_name":"Con Suite","guest_list":[]},{"con_id":"libertycon2015","title":"Large Dice Games with Fritz and Agatha","event_id":"158","description":"Fritz Fotovich and Agatha Jean will be offering this year&#039;s giant dice in the Gallery B.","datetime":1468159200000,"room_id":"3","room_name":"Gallery B","guest_list":["144"]},{"con_id":"libertycon2015","title":"Large Dice Games with Fritz and Agatha","event_id":"159","description":"Fritz Fotovich and Agatha Jean will be offering this year&#039;s giant dice in the Gallery B.","datetime":1468112400000,"room_id":"3","room_name":"Gallery B","guest_list":["144"]},{"con_id":"libertycon2015","title":"Large Dice Games with Fritz and Agatha","event_id":"160","description":"Fritz Fotovich and Agatha Jean will be offering this year&#039;s giant dice in the Gallery B.","datetime":1468029600000,"room_id":"3","room_name":"Gallery B","guest_list":["144"]},{"con_id":"libertycon2015","title":"I Can Make Art Outta That!","event_id":"164","description":"James Ward will take pieces and parts and make artful lamps, steampunk stuff, etc. while having fun! He will bring items to make and generate ideas for functional art.","datetime":1468101600000,"room_id":"3","room_name":"Gallery B","guest_list":["164"]},{"con_id":"libertycon2015","title":"Puppet Show","event_id":"166","description":"James Ward will once again please all ages with his masterful puppetry.","datetime":1468018800000,"room_id":"3","room_name":"Gallery B","guest_list":["164"]},{"con_id":"libertycon2015","title":"What&#039;s new from Iron Clad Press","event_id":"167","description":"Publisher De Anna McHarge Manning moderates this roundtable where Iron Clad Press authors discuss new and upcoming releases.","datetime":1468072800000,"room_id":"5","room_name":"Centennial Theater","guest_list":["12","15","19","37","130","202","221","263","294"]},{"con_id":"libertycon2015","title":"Do Utopian cities or Dystopian cities make the better backdrop for Urban Fantasy?","event_id":"168","description":"Gail Z. Martin moderates this panel discussion on what zeitgeist provides the most interesting framework for urban fantasy.","datetime":1468087200000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["200","245","248","307","316","335"]},{"con_id":"libertycon2015","title":"Reading: Gail Z. Martin","event_id":"169","description":"Come out and have a seat as our author guest reads passages of her works","datetime":1468022400000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["200"]},{"con_id":"libertycon2015","title":"Reading: Allan Kemp & Karen Bogen","event_id":"171","description":"Come out and have a seat as our author guest reads passages of their works","datetime":1468098000000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["122","335"]},{"con_id":"libertycon2015","title":"Reading: Darin Kennedy & John Hartness","event_id":"173","description":"Come out and have a seat as our author guests do a reading from their works.","datetime":1468026000000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["40","315"]},{"con_id":"libertycon2015","title":"Creature Features: Bringing Your Monster to Life","event_id":"175","description":"From Simple Shapes to Monstrous Mayhem! Special GOH Melissa Gay shows you how to design and draw your own creature in this 2-hour workshop. Pencils, paper, and Sharpies supplied-- bring your own creativity!","datetime":1468170000000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["140"]},{"con_id":"libertycon2015","title":"Reading: The Writing Hoyts with David Pascoe","event_id":"176","description":"Sarah, Daniel and Robert Hoyt read from their works with David Pascoe thrown in for good measure!","datetime":1468076400000,"room_id":"2","room_name":"Gallery A","guest_list":["10","67","180","290"]},{"con_id":"libertycon2015","title":"Autograph Session (Gannon, Maberry, Rinehart)","event_id":"178","description":"Autograph sessions will be located in the Dealer&#039;s Room. Authors will cycle through hourly, except for the author&#039;s that have their own tables who will be available when they are not scheduled in the program. Limit 5 books (if you bring more, get 5 signed and go to the back of the line.)","datetime":1468072800000,"room_id":"6","room_name":"Dealer's Room","guest_list":["184","299","313"]},{"con_id":"libertycon2015","title":"From Manuscript to Print-Ready: See a Book Take Shape","event_id":"184","description":"Watch a book design go from an author&#039;s manuscript to a finished printed book interior using Adobe InDesign software--the primary tool of choice for professional designers--in this demonstration led by Dave Schroeder, owner of independent publisher Spiral Arm Press.","datetime":1468008000000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["303"]},{"con_id":"libertycon2015","title":"Costuming for Steampunk","event_id":"190","description":"Jonna Hayden moderates this panel on the do&#039;s and don&#039;ts of creating realistic and impressive Steampunk costumes.","datetime":1468083600000,"room_id":"2","room_name":"Gallery A","guest_list":["126","127","163","164","250"]},{"con_id":"libertycon2015","title":"Convention War Stories","event_id":"194","description":"Gary Poole takes us for a stroll down memory lane of SF conventions past.","datetime":1468029600000,"room_id":"2","room_name":"Gallery A","guest_list":["126","157","314","323","330"]},{"con_id":"libertycon2015","title":"Friday Night Dance","event_id":"205","description":"Bielaczyc Brothers DJ an old LibertyCon tradition, the Friday Night Dance!","datetime":1468029600000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["5","6"]},{"con_id":"libertycon2015","title":"Reading: Jonathan Maberry","event_id":"219","description":"LGOH Jonathan Maberry will read from his works.","datetime":1467997200000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["299"]},{"con_id":"libertycon2015","title":"Tennessee Valley Interstellar Workshop (TVIW)","event_id":"221","description":"Les Johnson moderates this panel about the recent Tennessee Valley Interstellar Workshop.","datetime":1467997200000,"room_id":"1","room_name":"Finley Room","guest_list":["9","136","157","184"]},{"con_id":"libertycon2015","title":"Reading: Stephanie Osborn","event_id":"222","description":"Come and hear as our author read from her selected works","datetime":1468090800000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["39"]},{"con_id":"libertycon2015","title":"Reading: David B. Coe / D. B. Jackson","event_id":"223","description":"Come and enjoy a reading by author David B. Coe (who also writes as D. B. Jackson)","datetime":1468018800000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["93"]},{"con_id":"libertycon2015","title":"What&#039;s New from Perseid Publishing","event_id":"224","description":"Rich Groller moderates this discussion of new and upcoming works with other Perseid authors.","datetime":1468166400000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["12","15","130","202","211","310"]},{"con_id":"libertycon2015","title":"What&#039;s defines Space Opera?","event_id":"228","description":"Dan Hoyt moderates this panel highlighting the nuances and essential elements of the genre.","datetime":1468087200000,"room_id":"2","room_name":"Gallery A","guest_list":["62","67","207","212","246","252"]},{"con_id":"libertycon2015","title":"Kids Dungeons & Dragons","event_id":"230","description":"Glenn Baggott will moderate this 4th edition game for kids.","datetime":1467997200000,"room_id":"10","room_name":"Norfolk Room","guest_list":["189"]},{"con_id":"libertycon2015","title":"Reading: Stephen Simmons & Paula Jordan","event_id":"233","description":"Come and hear this authors read passages from their works!","datetime":1468072800000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["182","218"]},{"con_id":"libertycon2015","title":"Reading: M.B. Weston & Bill Swears","event_id":"235","description":"Come and hear these authors read passages of their works!","datetime":1468101600000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["245","306"]},{"con_id":"libertycon2015","title":"From Science Into Art, and Back Again: the Art of Melissa Gay","event_id":"238","description":"Special GOH Melissa Gay will chronicle her artistic career&#039;s arc beginning with scientific illustration, then from full-on fantasy illustration to sci-fi, and now totally into imaginative renderings of deep space as inspired by astrophotography.","datetime":1468029600000,"room_id":"1","room_name":"Finley Room","guest_list":["140"]},{"con_id":"libertycon2015","title":"On Writing YA Fantasy Literature","event_id":"245","description":"Brad Strickland moderates this panel on the essentials of writing YA fantasy literature.","datetime":1468166400000,"room_id":"2","room_name":"Gallery A","guest_list":["18","59","245","305","320","328"]},{"con_id":"libertycon2015","title":"What&#039;s New from Steve Jackson Games","event_id":"248","description":"Steve Jackson dishes on the latest developments from his secret games laboratory. He will even sign autographs. Come one, come all!","datetime":1468094400000,"room_id":"2","room_name":"Gallery A","guest_list":["243"]},{"con_id":"libertycon2015","title":"Reading: Scott Baker & Anna Grace Carpenter","event_id":"249","description":"Come out and have a seat as our author guests read passages of their works","datetime":1468162800000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["120","208"]},{"con_id":"libertycon2015","title":"Finding Your Voice as an Artist","event_id":"250","description":"Special GOH Melissa Gay moderates this panel on the &quot;sturm und drang&quot; of being an artist. Intelligent creative people tend to have LOTS of interests-- how do you focus down on anything in order to build up your own artistic vision when that vision seems to be pulling you in a million directions, yet all industry advice says to specialize?","datetime":1467997200000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["5","6","140","154","230","293"]},{"con_id":"libertycon2015","title":"Reading: Beth Patterson & Paul Cagle","event_id":"251","description":"Come and hear our authors read from their upcoming works!","datetime":1468159200000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["37","202"]},{"con_id":"libertycon2015","title":"SagaBorn RPG: Adventuring into the World of Uteria","event_id":"261","description":"Michael Bielaczyc hosts this gaming session in the new RPG system called SagaBorn, set in the World of Uteria.","datetime":1468105200000,"room_id":"10","room_name":"Norfolk Room","guest_list":["5","339"]},{"con_id":"libertycon2015","title":"Monster Hunter International","event_id":"263","description":"Larry Correia and company on what&#039;s new in the world of MHI!","datetime":1468008000000,"room_id":"5","room_name":"Centennial Theater","guest_list":["3","10","168"]},{"con_id":"libertycon2015","title":"Balloons of Doom","event_id":"266","description":"Doc Osborn unleashes controlled chaos with his balloons of doom!","datetime":1468166400000,"room_id":"3","room_name":"Gallery B","guest_list":["25"]},{"con_id":"libertycon2015","title":"Balloons of Doom","event_id":"267","description":"Doc Osborn unleashes controlled chaos with his balloons of doom!","datetime":1468015200000,"room_id":"3","room_name":"Gallery B","guest_list":["25"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Lowery, Perry, Schroeder, Weston)","event_id":"275","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1467997200000,"room_id":"17","room_name":"Author's Alley","guest_list":["159","171","245","303"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Burkhead, Kemp, C. Kennedy, Maggert)","event_id":"276","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468008000000,"room_id":"17","room_name":"Author's Alley","guest_list":["20","248","251","335"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Brooks, Grant, Howell, Mandragora)","event_id":"277","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468015200000,"room_id":"17","room_name":"Author's Alley","guest_list":["163","215","289","326"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Cordova, Monroe, Spriggs, Weyand)","event_id":"278","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468018800000,"room_id":"17","room_name":"Author's Alley","guest_list":["19","252","305","344"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Antonelli, Carpenter, Martin, Swann)","event_id":"279","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468026000000,"room_id":"17","room_name":"Author's Alley","guest_list":["200","208","308","328"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Lackey, Mandragora, Wandrey, Weyand)","event_id":"280","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468159200000,"room_id":"17","room_name":"Author's Alley","guest_list":["163","207","343","344"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Braker, Hicks, Spriggs, Weston)","event_id":"281","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468162800000,"room_id":"17","room_name":"Author's Alley","guest_list":["245","252","309","337"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Brooks, Burkhead, Coe, Lowery)","event_id":"282","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468166400000,"room_id":"17","room_name":"Author's Alley","guest_list":["20","93","159","289"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Howell, Maggert, Osborn, Swears)","event_id":"283","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468170000000,"room_id":"17","room_name":"Author's Alley","guest_list":["39","248","306","326"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Ault, Hoch, Paris, Schroeder)","event_id":"284","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468173600000,"room_id":"17","room_name":"Author's Alley","guest_list":["303","317","319","340"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Antonelli, Gibbons, Swears, Wandrey)","event_id":"285","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468090800000,"room_id":"17","room_name":"Author's Alley","guest_list":["207","306","308","331"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Coe, Gibbons, D. Kennedy, Martin)","event_id":"286","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468094400000,"room_id":"17","room_name":"Author's Alley","guest_list":["93","200","315","331"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Burkhead, Gibbons, D. Kennedy, Schroeder)","event_id":"287","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468098000000,"room_id":"17","room_name":"Author's Alley","guest_list":["20","303","315","331"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (C. Kennedy, D. Kennedy, Lackey, S. Osborn)","event_id":"288","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468101600000,"room_id":"17","room_name":"Author's Alley","guest_list":["39","251","315","343"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Hicks, Maggert, Mays, Weston)","event_id":"289","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468105200000,"room_id":"17","room_name":"Author's Alley","guest_list":["245","248","259","309"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Hicks, Howell, Lackey, Young)","event_id":"290","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468108800000,"room_id":"17","room_name":"Author's Alley","guest_list":["277","309","326","343"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (C. Kennedy, Mandragora, Martin, Swann)","event_id":"291","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468076400000,"room_id":"17","room_name":"Author's Alley","guest_list":["163","200","251","328"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Bragg & Butler, Hartness, Nash)","event_id":"292","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468087200000,"room_id":"17","room_name":"Author's Alley","guest_list":["40","332","333","336"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Bragg & Butler, Hartness, Johnson, Nash)","event_id":"293","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468083600000,"room_id":"17","room_name":"Author's Alley","guest_list":["9","40","332","333","336"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Bragg & Butler, Hartness, Hoch, Nash)","event_id":"294","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468080000000,"room_id":"17","room_name":"Author's Alley","guest_list":["40","332","333","336","340"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Ault, Cordova, Paris)","event_id":"295","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468022400000,"room_id":"17","room_name":"Author's Alley","guest_list":["19","317","319"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Brooks, Lowery, Paris, Perry)","event_id":"296","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468116000000,"room_id":"17","room_name":"Author's Alley","guest_list":["159","171","289","317"]},{"con_id":"libertycon2015","title":"What&#039;s New in 1632","event_id":"297","description":"Rick Boatright moderates this panel on what is new in the 1632 universe in all it&#039;s alternate history glory, followed by a mass autograph session.","datetime":1468000800000,"room_id":"5","room_name":"Centennial Theater","guest_list":["85","184","259","273","276","280","281","310","311"]},{"con_id":"libertycon2015","title":"The Art of Editing","event_id":"298","description":"Daniel Hollifield moderates this panel on how seasoned editors and academics ply their trade.","datetime":1468008000000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["127","212","255","323","340"]},{"con_id":"libertycon2015","title":"Weird Wild West","event_id":"302","description":"Rod Belcher moderates this panel on the wild west as envisioned with aliens and Ghost Riders in the Sky!","datetime":1468080000000,"room_id":"5","room_name":"Centennial Theater","guest_list":["200","208","211","221","316"]},{"con_id":"libertycon2015","title":"Reading: S. Andrew Swann","event_id":"306","description":"Come out and have a seat as our author guest reads passages of his works","datetime":1468173600000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["328"]},{"con_id":"libertycon2015","title":"Reading: Lou Antonelli","event_id":"307","description":"Come out and have a seat as our author guests reads passages of their works.","datetime":1468015200000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["308"]},{"con_id":"libertycon2015","title":"Reading: Brad Strickland","event_id":"308","description":"Come out and have a seat as our author guest read passages of his works","datetime":1468087200000,"room_id":"21","room_name":"Victorian Lounge","guest_list":["59"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Ault, Coe, Grant, Mays)","event_id":"310","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468072800000,"room_id":"17","room_name":"Author's Alley","guest_list":["93","215","259","319"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Antonelli, Braker, Carpenter, Spriggs)","event_id":"313","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468112400000,"room_id":"17","room_name":"Author's Alley","guest_list":["208","252","308","337"]},{"con_id":"libertycon2015","title":"Taking Care of Widows and Orphans: Designing Beautiful Book Interiors","event_id":"320","description":"Learn about the factors that will make the interior pages of your self-published printed book look beautiful and professional, like handling widows and orphans, tracking, margins, font selection, page numbering, running heads and more in this seminar led by Dave Schroeder.","datetime":1468004400000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["303"]},{"con_id":"libertycon2015","title":"Reading: Declan Finn & Jeremy Hicks","event_id":"321","description":"Come out and have a seat as our author guests read passages of from their works","datetime":1468026000000,"room_id":"3","room_name":"Gallery B","guest_list":["307","309"]},{"con_id":"libertycon2015","title":"How to Pick the Best Format for Your Game Design","event_id":"322","description":"Bill Fawcett moderates this panel on how to pick the best format for your game design idea - i.e. board game vs. card game vs. role playing game","datetime":1468098000000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["199","243","339"]},{"con_id":"libertycon2015","title":"Transhumanism and the Future of Human Augmentation","event_id":"326","description":"Ken Roy moderates this panel that discusses Transhumanism and its relationship to human augmentation.","datetime":1468022400000,"room_id":"1","room_name":"Finley Room","guest_list":["28","136","157","186","262"]},{"con_id":"libertycon2015","title":"Reading: Michael R. Ault & Brett Brooks","event_id":"332","description":"Come out and have a seat as our author guests read passages of their works.","datetime":1468094400000,"room_id":"3","room_name":"Gallery B","guest_list":["289","319"]},{"con_id":"libertycon2015","title":"Are You a Werewolf?","event_id":"340","description":"Are You a Werewolf? -- the classic re-interpretation of the old Mafia game of mob rule and paranoia as MC&#039;d by Todd McCaffrey.","datetime":1468098000000,"room_id":"2","room_name":"Gallery A","guest_list":["225"]},{"con_id":"libertycon2015","title":"Open Gaming (Midnight to 3PM)","event_id":"342","description":"The Norfolk Room will be host to Traditional and Tabletop gaming of all stripes","datetime":1468123200000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Late Night Call of Cthulhu RPG","event_id":"343","description":"Anita Moore will GM the &quot;Call of Cthulhu&quot; RPG. Come one come all!","datetime":1468033200000,"room_id":"10","room_name":"Norfolk Room","guest_list":["36"]},{"con_id":"libertycon2015","title":"Open Gaming (1PM to Midnight)","event_id":"344","description":"The Norfolk Room will be host to Traditional and Tabletop gaming of all stripes","datetime":1467997200000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Open Gaming (24 hours)","event_id":"345","description":"The Norfolk Room will be host to Traditional and Tabletop gaming of all stripes","datetime":1468036800000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Late Night Call of Cthulhu RPG","event_id":"346","description":"Anita Moore will GM the &quot;Call of Cthulhu&quot; RPG. Come one come all!","datetime":1468119600000,"room_id":"10","room_name":"Norfolk Room","guest_list":["36"]},{"con_id":"libertycon2015","title":"BAEN Dinner","event_id":"350","description":"BAEN Dinner","datetime":1468101600000,"room_id":"22","room_name":"Baen Dinner","guest_list":["3","7","8","9","10","19","28","35","62","67","85","93","168","179","180","184","198","199","221","225","231","263","273","274","276","280","281","282","286","290","310","311","313","318","322","323"]},{"con_id":"libertycon2015","title":"Reinhardt Legacy Fight Team","event_id":"351","description":"The Reinhardt Legacy Fight Team is a weapons demonstration team of former friends and students of legendary swordsmanship authority Hank Reinhardt. The Team demonstrates the use of classical weapons with cutting demonstrations and full contact sparring.","datetime":1468076400000,"room_id":"5","room_name":"Centennial Theater","guest_list":["151","327"]},{"con_id":"libertycon2015","title":"Georgette Heyer and Her Influence on Science Fiction","event_id":"352","description":"Toni Weisskopf moderates this panel discussion of novelist Georgette Heyer and her influence on Science Fiction","datetime":1468022400000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["8","10","85","198"]},{"con_id":"libertycon2015","title":"Eastern Weaponry","event_id":"353","description":"Eastern Weaponry - Toni Weisskopf moderates a show and tell about the weapons from the civilizations that inspired the background for the Saga of the Forgotten Warrior. There will be weapon samples from the Hank Reinhardt collection.","datetime":1468000800000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["8","168","327"]},{"con_id":"libertycon2015","title":"Concert: Beth Patterson","event_id":"354","description":"Come hear the magic of Beth Patterson&#039;s Celtic Cajun Bouzouki!","datetime":1468022400000,"room_id":"5","room_name":"Centennial Theater","guest_list":["202"]},{"con_id":"libertycon2015","title":"6 Book Release / Launch Parties: Refreshments will be served!","event_id":"355","description":"Iron Clad Press announces the release of the new horror anthology &quot;Dark Corners.&quot; Chris Kennedy Publishing announces the release of &quot;The Dark Star War.&quot; Daniel Allen Butler & Scott Bragg announce the release of &quot;The Nemesis Crystals&quot;. Solaris Books announces the release of Gail Z. Martin&#039;s &quot;The Shadowed Path.&quot; Ram&#039;s Head Books announces the publication of Taylor Hoch&#039;s &quot;The Curse of the Dullahan.&quot; Henchmen Press announces the release of Mark W","datetime":1468112400000,"room_id":"8","room_name":"Con Suite","guest_list":["12","15","37","130","200","202","207","221","251","263","294","332","333","340"]},{"con_id":"libertycon2015","title":"Extreme RoShamBo","event_id":"356","description":"Extreme RoShamBo, a wild new game version of Paper, Scissor, Rock for your enjoyment! Moderator: Fritz Fotovich","datetime":1468000800000,"room_id":"3","room_name":"Gallery B","guest_list":["144"]},{"con_id":"libertycon2015","title":"Concert Setup","event_id":"357","description":"Concert Setup","datetime":1468018800000,"room_id":"5","room_name":"Centennial Theater","guest_list":[]},{"con_id":"libertycon2015","title":"Black Tide Rising Roundtable","event_id":"358","description":"Come join John Ringo and his motley crew of authors for their roundtable on the Black Tide Rising anthology. Will be followed by a mass autograph session. Gary Poole, Mod.","datetime":1468166400000,"room_id":"5","room_name":"Centennial Theater","guest_list":["3","7","10","19","28","198","221","263","318","323"]},{"con_id":"libertycon2015","title":"Black Tide Rising Mass Autograph Session","event_id":"359","description":"Black Tide Rising Mass Autograph Session immediately following the Roundtable","datetime":1468171800000,"room_id":"5","room_name":"Centennial Theater","guest_list":["3","7","10","19","28","198","221","263","318","323"]},{"con_id":"libertycon2015","title":"SIGMA Panel","event_id":"360","description":"SIGMA, the non-profit Science Fiction Think Tank will be holding a panel moderated by it&#039;s founder Arlan Andrews.","datetime":1468162800000,"room_id":"2","room_name":"Gallery A","guest_list":["39","184","330"]},{"con_id":"libertycon2015","title":"Quantum Computing Presentation","event_id":"361","description":"Dr. Ben examines the emerging world of quantum computing. Where we are today, how it&#039;s supposed to work, and why it&#039;s important for our future.","datetime":1468159200000,"room_id":"1","room_name":"Finley Room","guest_list":["153"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Kemp, Monroe, Nye, Swann)","event_id":"362","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468000800000,"room_id":"17","room_name":"Author's Alley","guest_list":["198","305","328","335"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Braker, Kemp, Osborn,Weyand)","event_id":"363","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468004400000,"room_id":"17","room_name":"Author's Alley","guest_list":["39","335","337","344"]},{"con_id":"libertycon2015","title":"Author&#039;s Alley (Hoch, Perry, Swears, Wandrey)","event_id":"364","description":"Come by the Author&#039;s Alley to chat, buy a book or get an autograph!","datetime":1468029600000,"room_id":"17","room_name":"Author's Alley","guest_list":["171","207","306","340"]},{"con_id":"libertycon2015","title":"Corvus to Keyhole: Shipyards Past, Present and Science Fiction","event_id":"365","description":"Jim Beall presents this fascinating look using many pictures and videos at the role of shipyards throughout history and extrapolated to the future.","datetime":1468162800000,"room_id":"1","room_name":"Finley Room","guest_list":["179"]},{"con_id":"libertycon2015","title":"Cryonics and Suspended Animation","event_id":"366","description":"Steve Jackson will discuss this enduring topic and his personal relationship with the concepts - he is signed up with Alcor, a cryonics society; when he dies, they&#039;ll freeze him, and maybe someday they will thaw him out and he will get to see the future!","datetime":1468083600000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["243"]},{"con_id":"libertycon2015","title":"Water Treatment in Space","event_id":"367","description":"Glenn Baggott presents the technical hurdles of water treatment in the space environment.","datetime":1468004400000,"room_id":"1","room_name":"Finley Room","guest_list":["189"]},{"con_id":"libertycon2015","title":"First Contact Improv","event_id":"369","description":"Tedd Roberts moderates this organized mayhem: Writing a First Contact story is easy - until the moderator tells you to do it in the style of Quentin Tarantino scripting a Broadway musical! Panelists collaborate to improvise a story, using prompts from the moderator and audience. Don&#039;t expect us to be serious... on our way to Sirius!","datetime":1468018800000,"room_id":"1","room_name":"Finley Room","guest_list":["28","67","153","168","225"]},{"con_id":"libertycon2015","title":"Frontiers of Nanotech","event_id":"370","description":"Jaye Roye moderates this panel on advances in nanotechnology.","datetime":1468000800000,"room_id":"1","room_name":"Finley Room","guest_list":["14","20","330"]},{"con_id":"libertycon2015","title":"Alcohol Production in Non-Terrestrial Environments (Fantasy and Hard SF)","event_id":"371","description":"Discussion will range from how our environment (plants, biota, etc.) have influenced our alcohol production over the centuries leading into how would &#039;your world&#039; change (or be changed by) alcohol production. Are your Marines always making vodka on the engineering deck? (Why vodka, why not gin?). Does your planet export anything fermented? Distilled? Infused? Aged? How does a Xanth Beer tree get the beer carbonated and cold? Why didn&#039;t the Hobbits know that Beer came in pints?","datetime":1468087200000,"room_id":"1","room_name":"Finley Room","guest_list":["223"]},{"con_id":"libertycon2015","title":"Steam Power","event_id":"372","description":"Paul Boberg (AKA Engineer) will wax eloquent on Steam Power. Presentation includes a table display with a working rotary steam motor and will includes discussion of how a steam engine works and the problems that anyone in a steampunk world would face.","datetime":1468159200000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["329"]},{"con_id":"libertycon2015","title":"The Future of Food and GMO Food Issues","event_id":"373","description":"Agronomist Gary Shelton moderates this timely panel that will address a myriad of issues. Want to colonize that new world? Then you better face the fact you are gonna need those GMO crops. And maybe modify yourself to boot! GMOs - will labelling solve it all? Can anyone really avoid GMOs? What if a cow or a chicken eats feed that contains GMOs, does that make the feed animal a GMO? Would that in turn make humans GMOs? GMO deniers, same or different than climate change deniers?","datetime":1468090800000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["134","186","227"]},{"con_id":"libertycon2015","title":"SETI: The Search for Extra-Terrestrial Intelligence","event_id":"374","description":"Science GOH Dr. Ben Davis will discuss the history of the search for extra-terrrestrial intelligence.","datetime":1468090800000,"room_id":"1","room_name":"Finley Room","guest_list":["153"]},{"con_id":"libertycon2015","title":"Where Next for Human Space Exploration - Mars?","event_id":"375","description":"Panel discussion about the next stop in the grand challenge of human space exploration - Mars. Stephen Fleming (Mod.)","datetime":1468072800000,"room_id":"1","room_name":"Finley Room","guest_list":["9","20","312"]},{"con_id":"libertycon2015","title":"Bootstrapping Industrial Capacity After An Apocalypse","event_id":"376","description":"Machinist Jeremy Levitt moderates this hardballers how-to panel on rebuilding industrial capacity after the EOTW (as we know it)","datetime":1468026000000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["7","20","156","168","179","235"]},{"con_id":"libertycon2015","title":"Science is Why We Drink","event_id":"377","description":"Panel on public misperceptions of scientific research - with all the bad science memes that get tossed about on social media and the constant facepalming, this panel addresses the worst of the memes that we see. Cathe Smith, Mod.","datetime":1468105200000,"room_id":"2","room_name":"Gallery A","guest_list":["136","153","186","227"]},{"con_id":"libertycon2015","title":"Frontiers of Military Medicine","event_id":"378","description":"Panelists discuss on the current state of military medicine and how they see it changing in the future both on the battlefield and off.","datetime":1468116000000,"room_id":"2","room_name":"Gallery A","guest_list":["180","186","315"]},{"con_id":"libertycon2015","title":"Gene Editing - the Making of Better Humans","event_id":"379","description":"Gene editing - just how easy is it, really? CRISPR/CAS has revolutionized the ability to insert or delete genes. Novel techniques involving optogenetics and chemically-activated gene products (DREDDs) provide the ability to turn those edited genes on and off. Is it really time for Junior&#039;s Home DNA kit? Tedd Roberts, Mod.","datetime":1468173600000,"room_id":"1","room_name":"Finley Room","guest_list":["28","180","227","262"]},{"con_id":"libertycon2015","title":"Case Studies in Handwavium","event_id":"380","description":"Jim Beall&#039;s presentation with many pictures and videos will trace and compare real science and &quot;handwavium&quot; through the ages--from Thomas Edison and HG Wells to Miguel Alcubierre and Travis Taylor.","datetime":1468083600000,"room_id":"1","room_name":"Finley Room","guest_list":["179"]},{"con_id":"libertycon2015","title":"Modernization of the Electric Grid","event_id":"381","description":"David Bogen moderates this panel on the modernization of the electric grid and the changes green power has introduced.","datetime":1468098000000,"room_id":"1","room_name":"Finley Room","guest_list":["14","131","136","179","182","314"]},{"con_id":"libertycon2015","title":"Rising Above the Noise: Maximizing Your Profits with Amazon.Com","event_id":"382","description":"Now that you&#039;ve got a book, how do you get people to find it among the 800,000 books that will be published on Amazon this year? How do you draw attention to your book and get into the Amazon algorithm? You need to know how to use the algorithm if you want to maximize your sales! This workshop will show you the path to success Chris used to sell 40,000 books last year and have two different #1 Amazon bestsellers!","datetime":1468090800000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["251"]},{"con_id":"libertycon2015","title":"Fallout Shelter Basics","event_id":"383","description":"Ken Roy moderates this how-to panel about building and stocking your very own fallout shelter!","datetime":1468015200000,"room_id":"1","room_name":"Finley Room","guest_list":["136","156","157","182","186","235"]},{"con_id":"libertycon2015","title":"Weaponized Artificial Intelligence","event_id":"385","description":"Dr. Mark Paulk moderates this panel on weaponized AI and it&#039;s potential impact on warfare.","datetime":1467997200000,"room_id":"2","room_name":"Gallery A","guest_list":["149","153","156","182","225","338"]},{"con_id":"libertycon2015","title":"The Aliens Are NOT Among Us","event_id":"386","description":"Les Johnson moderates this discussion on the improbability that we are being visited by extraterrestrials.","datetime":1468173600000,"room_id":"2","room_name":"Gallery A","guest_list":["9","153","312","330"]},{"con_id":"libertycon2015","title":"Face to Face Critiques from the Slushmaster General","event_id":"387","description":"MC Gray Rinehart, the BAEN Slushmaster General will critique your work - first come first serve basis - bring the first 5 pages of your story and your 1-2 page synopsis. You will receive real time feedback. Learn what really happens to your manuscript once it arrives at the publishers, and how to make yours stand out.","datetime":1467997200000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["313"]},{"con_id":"libertycon2015","title":"Alien Design Based on Scientific Principles","event_id":"388","description":"Paula Jordan moderates this panel on how to properly design your alien so that it will be realistic in accordance with known science.","datetime":1468170000000,"room_id":"2","room_name":"Gallery A","guest_list":["184","218","262"]},{"con_id":"libertycon2015","title":"Social Media for Authors and Artisans","event_id":"389","description":"Gail Z. Martin will host this seminar on the use of social media for promoting your works.","datetime":1468105200000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["200"]},{"con_id":"libertycon2015","title":"Room reset after Kaffeeklatsch","event_id":"391","description":"Room reset after Kaffeeklatsch","datetime":1468162800000,"room_id":"15","room_name":"Roosevelt Room","guest_list":[]},{"con_id":"libertycon2015","title":"Panel Noir","event_id":"392","description":"Kacey Ezell (Mod.) on &quot;Panel Noir&quot;: Come join us as we discuss the related genres of Noir and Hardboiled Detective Fiction. What constitutes one or the other? Is there a difference? And how do authors mash these classic genres up with fantasy, sci-fi, and other flavors of speculative fiction?","datetime":1468098000000,"room_id":"5","room_name":"Centennial Theater","guest_list":["59","168","221","254","263","316"]},{"con_id":"libertycon2015","title":"X-Files - Is the Truth Really Out There?","event_id":"393","description":"Jonathan Maberry lets us in on the truth in this presentation on all things X-Files, to include the series of all-new anthologies from IDW Publishing he is editing and the Dana Scully Young Adult novel set during her high school years he is writing.","datetime":1468029600000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["299"]},{"con_id":"libertycon2015","title":"Writing for the Comics","event_id":"394","description":"Martin Powell moderates this panel of comic and graphic novels luminaries on what it is like to write iconic characters and new creations..","datetime":1468004400000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["256","289","293","299","317","334","336"]},{"con_id":"libertycon2015","title":"Our Fascination with Zombies and Vampires","event_id":"395","description":"Jonathan Maberry and his pet creature features: a new vampire anthology (V-WARS: NIGHT TERRORS), a vampire board game (V-WARS: A GAME OF BLOOD AND BETRAYAL), a new zombie novella (DARK OF NIGHT), a new zombie YA (BITS & PIECES), and an anthology he is editing of NIGHT OF THE LIVING DEAD stories with George Romero.","datetime":1468090800000,"room_id":"2","room_name":"Gallery A","guest_list":["299"]},{"con_id":"libertycon2015","title":"The Weird Allure of the Anthology","event_id":"396","description":"Jonathan Baird moderates this panel on the fascination and intricacies of success writing in anthologies.","datetime":1468101600000,"room_id":"2","room_name":"Gallery A","guest_list":["12","255","299"]},{"con_id":"libertycon2015","title":"The Allure of Dark Fantasy","event_id":"398","description":"Jonathan Baird moderates this panel on Dark Fantasy and how it differs from other &quot;dark&quot; genres such as Gothic Horror.","datetime":1468112400000,"room_id":"2","room_name":"Gallery A","guest_list":["40","67","247","255","290","299"]},{"con_id":"libertycon2015","title":"Art and Charity Auction Setup","event_id":"399","description":"Room prep","datetime":1468101600000,"room_id":"1","room_name":"Finley Room","guest_list":[]},{"con_id":"libertycon2015","title":"Principles of War","event_id":"400","description":"Tom Kratman will present his take on the 12 Principles of War, to include illustrations from famous battles throughout the ages. Learn from the master....","datetime":1468076400000,"room_id":"1","room_name":"Finley Room","guest_list":["322"]},{"con_id":"libertycon2015","title":"Writing With Your Significant Other","event_id":"401","description":"These couples dish on the ins and outs of writing and living together! Kevin Evans (mod.)","datetime":1468015200000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["276","280","310","311"]},{"con_id":"libertycon2015","title":"1632 Mass Autograph Session","event_id":"402","description":"Mass autograph session immediately follows the 1632 Roundtable","datetime":1468006200000,"room_id":"5","room_name":"Centennial Theater","guest_list":["85","184","259","273","276","280","281","310","311"]},{"con_id":"libertycon2015","title":"Bringing Modern Technology into Urban Fantasy","event_id":"403","description":"In the words of John Ringo &quot;Why don&#039;t we use robots to stake vampires?&quot; John Ringo moderates this panel on using high tech in fantasy worlds. Drones vs. Dragons anyone?","datetime":1468076400000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["3","85","168"]},{"con_id":"libertycon2015","title":"Retro-Futurist Alternate History","event_id":"405","description":"Lou Antonelli moderates this panel on the myriad possibilities of worlds set in retro-futurist alternate history universes.","datetime":1468080000000,"room_id":"2","room_name":"Gallery A","guest_list":["163","277","281","304","308"]},{"con_id":"libertycon2015","title":"Setup for Dance","event_id":"406","description":"Setup / Prep for Dance","datetime":1468026000000,"room_id":"15","room_name":"Roosevelt Room","guest_list":[]},{"con_id":"libertycon2015","title":"Banquet Set Up","event_id":"407","description":"Setup for the GOH Horror Banquet","datetime":1468072800000,"room_id":"15","room_name":"Roosevelt Room","guest_list":[]},{"con_id":"libertycon2015","title":"Large Action Trivial Pursuit","event_id":"408","description":"Glenn Baggott and Fritz Fotovich host this new event that is sure to become a new favorite!","datetime":1468162800000,"room_id":"3","room_name":"Gallery B","guest_list":["144","189"]},{"con_id":"libertycon2015","title":"Law Basics for Writers","event_id":"409","description":"Lawyer / Author Amie Gibbons will conduct this 2 hour workshop on law basics for writers. It will include a general outline of criminal, constitutional, and tort law basics (on the writing side), as well as a treatment of intellectual property, copyright and contract law (on the business side).","datetime":1468015200000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["331"]},{"con_id":"libertycon2015","title":"The Summer Dragon","event_id":"410","description":"AGOH Todd Lockwood will perform an interactive reading with illustrations from his new novel, The Summer Dragon.","datetime":1468166400000,"room_id":"1","room_name":"Finley Room","guest_list":["302"]},{"con_id":"libertycon2015","title":"Invasion of the Podcasters","event_id":"411","description":"Brian Cooksey moderates this eclectic panel of experts from different backgrounds on all things podcasting!","datetime":1468105200000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["37","307","339"]},{"con_id":"libertycon2015","title":"The Art of Short Story Writing","event_id":"412","description":"Jody Lynn Nye moderates this panel on the tricks and techniques of writing good short stories.","datetime":1468008000000,"room_id":"2","room_name":"Gallery A","guest_list":["120","198","225","247","304","308"]},{"con_id":"libertycon2015","title":"Lessons from History We&#039;ve Failed to Learn","event_id":"413","description":"Bill Fawcett moderates this panel on the lessons from history that we as a species have failed to learn and are seemingly doomed to repeat again.","datetime":1467997200000,"room_id":"5","room_name":"Centennial Theater","guest_list":["199","220","259","281","282"]},{"con_id":"libertycon2015","title":"Student and Teacher Together Again - Changing Perspectives on Art","event_id":"414","description":"Sam Flegal was the student and Tom Biondolillo the teacher - see how much perspectives of art evolve over time.","datetime":1468080000000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["230","293"]},{"con_id":"libertycon2015","title":"Workshop: The Composer&#039;s Art","event_id":"415","description":"Beth Patterson, the Cajun Queen of Celtic Bouzouki will conduct a workshop on the art of composing music.","datetime":1468098000000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["202"]},{"con_id":"libertycon2015","title":"Spades Tournament (First Round Part A)","event_id":"416","description":"Every year THERE CAN BE ONLY ONE to win bragging rights for a year. Will you be the one? Sign-up sheets will be at the Norfolk room.","datetime":1468029600000,"room_id":"16","room_name":"American Train Car","guest_list":["149"]},{"con_id":"libertycon2015","title":"Cookie Decorating In the Con Suite","event_id":"417","description":"For the Kids! Cisca Small will school the little ones in the fine art of Cookie Decorating. Come one, come all!","datetime":1468074600000,"room_id":"8","room_name":"Con Suite","guest_list":[]},{"con_id":"libertycon2015","title":"Banquet Clean-up","event_id":"418","description":"Banquet Clean-up and room reset","datetime":1468087200000,"room_id":"15","room_name":"Roosevelt Room","guest_list":[]},{"con_id":"libertycon2015","title":"X Wing Exhibition","event_id":"419","description":"Michael Bielaczyc and Sascha Koehler will host an exhibition game of X-Wing in the Norfolk Room","datetime":1468083600000,"room_id":"10","room_name":"Norfolk Room","guest_list":["5","6"]},{"con_id":"libertycon2015","title":"What is the Cultural Significance of the Zombie Apocalypse?","event_id":"420","description":"Dan Hoyt moderates this panel exploring the cultural significance of the current Zombie Apocalypse Megatrend","datetime":1468162800000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["67","207","306","334","336"]},{"con_id":"libertycon2015","title":"It&#039;s in the Blood: What Fuels our Fears, Attraction and Fascination with Vampires","event_id":"421","description":"Karen Bogen moderates this panel on what motivates our unending quest for all things vampire.","datetime":1468108800000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["122","159","248","289","307","320"]},{"con_id":"libertycon2015","title":"Southern Gothic","event_id":"422","description":"Leia Barrett-Durham Powell moderates this chilling panel on all frightful things Southern Gothic!","datetime":1468101600000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["29","194","208","216"]},{"con_id":"libertycon2015","title":"Writing Supernatural Elements in Urban Fantasy","event_id":"423","description":"David Coe moderates this discussion on how the supernatural informs many aspects of contemporary urban fantasy.","datetime":1468015200000,"room_id":"5","room_name":"Centennial Theater","guest_list":["18","37","93","254","290"]},{"con_id":"libertycon2015","title":"For the Love of Lovecraft","event_id":"424","description":"These authors and artists discuss their creative inspirations from the works of H.P. Lovecraft and his influence on modern culture. Steve Jackson, Moderator.","datetime":1468112400000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["36","144","212","241","243"]},{"con_id":"libertycon2015","title":"Screenwriting and Independent Film Making","event_id":"425","description":"Filmaker and director Robert S. Evans will conduct this seminar. Do you want to know about writing and making movies? Come learn the ins and outs of the craft, with plenty of stories about the adventures that occur on set. The art of film is a crazy and fascinating world, from the start of the screenplay to the final rendering of the last edit!","datetime":1468110600000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["341"]},{"con_id":"libertycon2015","title":"Writing for Audio Drama","event_id":"426","description":"ARTC members Bill Ritch, Ron Butler and Daniel Taylor will discuss the art of writing for audio drama. Brad Strickland (mod.)","datetime":1468022400000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["59","128","305"]},{"con_id":"libertycon2015","title":"Performing in Audio Drama","event_id":"427","description":"Members of ARTC David Benedict, Matt Goodson and Clair Kiernan will discuss the art and craft of acting / performing in audio drama.","datetime":1468072800000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["59","128","305"]},{"con_id":"libertycon2015","title":"Bill Fawcett &quot;New Author&quot; Sessions","event_id":"428","datetime":1468018800000,"room_id":"22","room_name":"Baen Dinner","guest_list":["199","211","306","309","315"]},{"con_id":"libertycon2015","title":"Bill Fawcett &quot;New Author&quot; Sessions","event_id":"429","datetime":1468022400000,"room_id":"22","room_name":"Baen Dinner","guest_list":["163","171","199","318","340"]},{"con_id":"libertycon2015","title":"Bill Fawcett &quot;New Author&quot; Sessions","event_id":"430","datetime":1468026000000,"room_id":"22","room_name":"Baen Dinner","guest_list":["199","259","303","305"]},{"con_id":"libertycon2015","title":"Swords and Sorcery: From Light to Epic Fantasy and All Things In-Between","event_id":"431","description":"S. Andrew Swann moderates this panel on all things Swords and Sorcery!","datetime":1468004400000,"room_id":"2","room_name":"Gallery A","guest_list":["122","252","309","319","326","328"]},{"con_id":"libertycon2015","title":"Balloons of Doom","event_id":"432","description":"Doc Osborn unleashes controlled chaos with his balloons of doom!","datetime":1468072800000,"room_id":"3","room_name":"Gallery B","guest_list":["25"]},{"con_id":"libertycon2015","title":"Patriot Games","event_id":"433","description":"Joe &quot;JoeDog&quot; McKeel hosts this game for charity. Participants will meet at the outdoor covered entrance area by Building One.","datetime":1468087200000,"room_id":"20","room_name":"Building 1 Lobby","guest_list":["27"]},{"con_id":"libertycon2015","title":"What&#039;s New in the World of Pirate Fantasy","event_id":"434","description":"Tamara Lowery moderates this panel on the subgenre of Pirate Fantasy.","datetime":1468173600000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["15","130","159","171"]},{"con_id":"libertycon2015","title":"Reading: Bobby Nash & Tom Trumpinski","event_id":"435","description":"Come out and have a seat as our author guests reads passages of their works.","datetime":1468022400000,"room_id":"3","room_name":"Gallery B","guest_list":["254","336"]},{"con_id":"libertycon2015","title":"Reading: Sevan Paris & Kimberly S. Daniels","event_id":"437","description":"Come out and have a seat as our author guests read passages of from their works.","datetime":1468108800000,"room_id":"3","room_name":"Gallery B","guest_list":["212","317"]},{"con_id":"libertycon2015","title":"Edgar Rice Burroughs in Art and Literature","event_id":"438","description":"Leia and Martin Powell and leaders from ERB Inc. discuss their fascination with Edgar Rice Burroughs and how they have brought his characters to life in art and literature.","datetime":1468094400000,"room_id":"1","room_name":"Finley Room","guest_list":["216","256","345","346"]},{"con_id":"libertycon2015","title":"On Writing Sherlock Holmes","event_id":"439","description":"Stephanie Osborn moderates this panel on the nuances of capturing the Great Detective and doing him justice!","datetime":1468018800000,"room_id":"2","room_name":"Gallery A","guest_list":["39","256","304","336"]},{"con_id":"libertycon2015","title":"Seminar on Digital Self-Publishing","event_id":"440","description":"Publisher Dan Thompson will hold a seminar focusing on the do&#039;s and dont&#039;s of digital self-publishing.","datetime":1468116000000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["304"]},{"con_id":"libertycon2015","title":"Perspectives on Military SF","event_id":"441","description":"Doug Dandridge moderates this roundtable on military SF and what informs it. Is military experience required to write believable fiction, or is talent and good research enough?","datetime":1468083600000,"room_id":"5","room_name":"Centennial Theater","guest_list":["120","184","215","246","252","277","338"]},{"con_id":"libertycon2015","title":"The Revenge of Indiana Jones: Archeology in Science Fiction and Fantasy","event_id":"442","description":"A Paleontologist, 2 Archeologists and a Lawyer comprise this panel of experts, who dish on how archeology informs genre writing. Bob Buettner (Mod.)","datetime":1468170000000,"room_id":"9","room_name":"Cent. Theater Foyer","guest_list":["194","255","282","309"]},{"con_id":"libertycon2015","title":"Reading: Julie Cochrane & Kal Spriggs","event_id":"443","description":"Come out and have a seat as our author guests read passages of their works.","datetime":1468173600000,"room_id":"3","room_name":"Gallery B","guest_list":["62","252"]},{"con_id":"libertycon2015","title":"Reading: Becky Kyle & Louise Herring-Jones","event_id":"444","description":"Come out and have a seat as our author guests read passages of from their works","datetime":1468116000000,"room_id":"3","room_name":"Gallery B","guest_list":["194","320"]},{"con_id":"libertycon2015","title":"Reading: Daniel Allen Butler & Jack Finley","event_id":"445","description":"Come out and have a seat as our author guests read passages of from their works.","datetime":1468008000000,"room_id":"3","room_name":"Gallery B","guest_list":["130","333"]},{"con_id":"libertycon2015","title":"On Writing Epic Fantasy","event_id":"446","description":"Gail Z. Martin moderates this panel on what it takes to hold an audience and build a believable world in epic fantasy.","datetime":1468101600000,"room_id":"5","room_name":"Centennial Theater","guest_list":["40","200","246","316"]},{"con_id":"libertycon2015","title":"Indie Publishing Seminar","event_id":"447","description":"Peter Grant and Dorothy Klapp will continue their series on indie publishing at Liberty this year, and will additionally address writing in multiple genres/categories of fiction, and also how to deal with obstacles that can crop up and interrupt one&#039;s progress.","datetime":1468108800000,"room_id":"2","room_name":"Gallery A","guest_list":["215","240"]},{"con_id":"libertycon2015","title":"Project (Newspaper) Runway","event_id":"448","description":"Costume Designer Jonna Hayden says &quot;Why should the kids have all the fun?&quot; Gather up your friends and build a complete costume out of newspaper in 90 minutes! In this workshop you&#039;ll be divided into teams and have a limited time to build a complete outfit out of newspaper, tape, staples and your team&#039;s brilliant brains! Come prepared to work fast! At the end we&#039;ll have a short runway show where you get to explain and show off your creations! NO special skills required, other than a","datetime":1468164600000,"room_id":"15","room_name":"Roosevelt Room","guest_list":["250"]},{"con_id":"libertycon2015","title":"Did Science Fiction Murder It&#039;s Child?","event_id":"449","description":"Robert Buettner will reprise his presentation to the University of Chicago Space Conference, Space - Speculation & Exploration. It is an authors-eye recap of the role of science fiction in space exploration, in the past, and in the future of the genre. It is also a report card for Science Fiction, both as a predictor of the future and as a reflector of the time.","datetime":1468026000000,"room_id":"1","room_name":"Finley Room","guest_list":["282"]},{"con_id":"libertycon2015","title":"Filk Sing!","event_id":"450","description":"MC Gray Rinehart will resurrect an old LibertyCon tradition and lead a filk sing! Come and enjoy!","datetime":1468116000000,"room_id":"20","room_name":"Building 1 Lobby","guest_list":["313"]},{"con_id":"libertycon2015","title":"The Business End of Art","event_id":"451","description":"Melissa Gay moderates this panel on the ins and outs how artist&#039;s turn their love of art into a profitable career.","datetime":1468015200000,"room_id":"2","room_name":"Gallery A","guest_list":["140","154","241","293"]},{"con_id":"libertycon2015","title":"Cool Mini or Not Game Demos","event_id":"452","datetime":1468015200000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Midnight Zombicide","event_id":"453","datetime":1468036800000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Munchkin Rumble","event_id":"455","datetime":1468018800000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Car Wars Demos with Davey Bolling","event_id":"456","datetime":1468076400000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Cool Mini Or Not Game Demos","event_id":"457","datetime":1468087200000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Cool Mini Or Not Game Demos","event_id":"458","datetime":1468105200000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Car Wars Arena Event With Davey Bolling","event_id":"459","datetime":1468162800000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"Midnight Zombicide","event_id":"461","datetime":1468123200000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]},{"con_id":"libertycon2015","title":"One Last Job RPG With Doug Loss","event_id":"462","datetime":1468083600000,"room_id":"10","room_name":"Norfolk Room","guest_list":[]}],"places":[{"con_id":"libertycon2015","name":"Ben & Jerry's","subtitle":"<a href=\"http://www.benjerry.com/chattanooga\">Click for Website</a>","icon":"food","address":"201 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.05439,"lon":-85.310953},{"con_id":"libertycon2015","name":"Big River Grill & Brewery","subtitle":"<a href=\"http://www.bigrivergrille.com/\">Click for Website</a>","icon":"food","address":"222 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.053915,"lon":-85.310533},{"con_id":"libertycon2015","name":"Majestic 12 Cinema","subtitle":"<a href=\"http://www.carmike.com/\">Click for Website</a>","icon":"special","address":"311 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.05331,"lon":-85.310904},{"con_id":"libertycon2015","name":"Jax Liquors","subtitle":"<a href=\"https://www.google.com/maps/place/Jax+Liquors/@35.0540133\">Click for Website</a>","icon":"beer","address":"216 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.054092,"lon":-85.309438},{"con_id":"libertycon2015","name":"212 Market Restaurant","subtitle":"<a href=\"http://www.212market.com/\">Click for Website</a>","icon":"food","address":"212 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.054398,"lon":-85.309537},{"con_id":"libertycon2015","name":"Hennen's Steak House","subtitle":"<a href=\"http://www.hennens.net/\">Click for Website</a>","icon":"food","address":"193 Chestnut St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.054935,"lon":-85.31204},{"con_id":"libertycon2015","name":"Coldstone Creamery","subtitle":"<a href=\"http://www.coldstonecreamery.com/\">Click for Website</a>","icon":"food","address":"100 Chestnut St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.055338,"lon":-85.312151},{"con_id":"libertycon2015","name":"Sitar Indian Cuisine","subtitle":"<a href=\"http://www.sitarknoxville.com/\">Click for Website</a>","icon":"food","address":"200 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.05465,"lon":-85.309543},{"con_id":"libertycon2015","name":"Hair of the Dog Pub","subtitle":"<a href=\"http://hairofthedogpub.net/\">Click for Website</a>","icon":"beer","address":"334 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.052489,"lon":-85.309422},{"_id":"5386dc7c70720372cd000102","con_id":"libertycon2015","name":"Chili's Bar & Grill","subtitle":"<a href=\"http://www.chilis.com/EN/Pages/home.aspx\">Click for Website</a>","icon":"food","address":"408 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.052057,"lon":-85.309429},{"_id":"5386dc7c70720372cd000103","con_id":"libertycon2015","name":"Noodles & Co.","subtitle":"<a href=\"http://www.noodles.com/locations/7401\">Click for Website</a>","icon":"food","address":"405 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.051905,"lon":-85.309786},{"_id":"5386dc7c70720372cd000104","con_id":"libertycon2015","name":"Panera Bread","subtitle":"<a href=\"https://www.panerabread.com/en-us/home.html\">Click for Website</a>","icon":"food","address":"417 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.051726,"lon":-85.309773},{"_id":"5386dc7c70720372cd000105","con_id":"libertycon2015","name":"Taziki's Mediterranean Cafe","subtitle":"<a href=\"http://www.tazikiscafe.com/\">Click for Website</a>","icon":"food","address":"432 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.051268,"lon":-85.309433},{"con_id":"libertycon2015","name":"Subway","subtitle":"<a href=\"http://www.subway.com/subwayroot/default.aspx\">Click for Website</a>","icon":"food","address":"850 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.046226,"lon":-85.308883},{"con_id":"libertycon2015","name":"Jimmy John's Sandwiches","subtitle":"<a href=\"https://www.jimmyjohns.com/\">Click for Website</a>","icon":"food","address":"973 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.045049,"lon":-85.309569},{"con_id":"libertycon2015","name":"City Cafe Diner","subtitle":"<a href=\"http://www.citycafemenu.com/\">Click for Website</a>","icon":"food","address":"901 Carter St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.045571,"lon":-85.312058},{"con_id":"libertycon2015","name":"Starbucks","subtitle":"<a href=\"http://www.starbucks.com/\">Click for Website</a>","icon":"food","address":"827 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.046054,"lon":-85.310803},{"con_id":"libertycon2015","name":"Ankar's Downtown","subtitle":"<a href=\"http://www.ankarsdowntown.com/\">Click for Website</a>","icon":"food","address":"510 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.050542,"lon":-85.310436},{"_id":"5386dc7c70720372cd00010b","con_id":"libertycon2015","name":"Sugar's Downtown Ribs","subtitle":"<a href=\"http://sugarschattanooga.com/\">Click for Website</a>","icon":"food","address":"507 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.050835,"lon":-85.310837},{"con_id":"libertycon2015","name":"Five Guys Burgers & Fries","subtitle":"<a href=\"http://fiveguys.com/\">Click for Website</a>","icon":"food","address":"401 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.052062,"lon":-85.310871},{"con_id":"libertycon2015","name":"Greyfriar's","subtitle":"<a href=\"https://www.google.com/maps/place/Greyfriar's/@35.0518728\">Click for Website</a>","icon":"food","address":"406B Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.051872,"lon":-85.310431},{"con_id":"libertycon2015","name":"Easy Bistro & Bar","subtitle":"<a href=\"http://www.easybistro.com/\">Click for Website</a>","icon":"food","address":"203 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.054482,"lon":-85.310947},{"con_id":"libertycon2015","name":"Creative Discovery Museum","subtitle":"<a href=\"http://www.cdmfun.org/\">Click for Website</a>","icon":"special","address":"321 Chestnut St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.0527,"lon":-85.312257},{"_id":"5386dc7c70720372cd000110","con_id":"libertycon2015","name":"Coolidge Park","subtitle":"<a href=\"https://www.google.com/maps/place/Coolidge+Park/@35.0606179\">Click for Website</a>","icon":"special","address":"150 River St","city":"Chattanooga","state":"TN","phone":"","zip":"37405","lat":35.060788,"lon":-85.30749},{"_id":"5386dc7c70720372cd000111","con_id":"libertycon2015","name":"Brewhaus","subtitle":"<a href=\"http://www.brewhausbar.com/\">Click for Website</a>","icon":"beer","address":"224 Frazier Ave","city":"Chattanooga","state":"TN","phone":"","zip":"37405","lat":35.062074,"lon":-85.306148},{"_id":"5386dc7c70720372cd000112","con_id":"libertycon2015","name":"Totto Sushi & Grill","subtitle":"<a href=\"http://www.tottonooga.com/\">Click for Website</a>","icon":"food","address":"330 Frazier Ave","city":"Chattanooga","state":"TN","phone":"","zip":"37405","lat":35.062039,"lon":-85.30582},{"_id":"5386dc7c70720372cd000113","con_id":"libertycon2015","name":"Subway","subtitle":"<a href=\"http://www.subway.com/subwayroot/default.aspx\">Click for Website</a>","icon":"food","address":"208 Frazier Ave","city":"Chattanooga","state":"TN","phone":"","zip":"37405","lat":35.062185,"lon":-85.306326},{"_id":"5386dc7c70720372cd000114","con_id":"libertycon2015","name":"North Shore Lunch","subtitle":"<a href=\"http://northshorelunch.wordpress.com/\">Click for Website</a>","icon":"food","address":"207 Frazier Ave","city":"Chattanooga","state":"TN","phone":"","zip":"37405","lat":35.062429,"lon":-85.306238},{"_id":"5386dc7c70720372cd000115","con_id":"libertycon2015","name":"Good Dog Restaurant","subtitle":"<a href=\"http://www.eatatgooddog.com/\">Click for Website</a>","icon":"food","address":"34 Frazier Ave","city":"Chattanooga","state":"TN","phone":"","zip":"37405","lat":35.062402,"lon":-85.30743},{"_id":"5386dc7c70720372cd000116","con_id":"libertycon2015","name":"Terra Nostra Tapas & Wine","subtitle":"<a href=\"http://terranostratapas.com/\">Click for Website</a>","icon":"food","address":"105 Frazier Ave","city":"Chattanooga","state":"TN","phone":"","zip":"37405","lat":35.062602,"lon":-85.307474},{"_id":"5386dc7c70720372cd000117","con_id":"libertycon2015","name":"River Street Deli","subtitle":"<a href=\"http://www.riverstreet-deli.com/\">Click for Website</a>","icon":"food","address":"151 River St","city":"Chattanooga","state":"TN","phone":"","zip":"37405","lat":35.062173,"lon":-85.307561},{"_id":"5386dc7c70720372cd000118","con_id":"libertycon2015","name":"Hunter Museum of Art","subtitle":"<a href=\"http://www.huntermuseum.org/\">Click for Website</a>","icon":"special","address":"10 Bluff View Ave","city":"Chattanooga","state":"TN","phone":"","zip":"37403","lat":35.055866,"lon":-85.306408},{"_id":"5386dc7c70720372cd000119","con_id":"libertycon2015","name":"Tony's Pasta Shop","subtitle":"<a href=\"http://www.bluffviewartdistrict.com/subpage.php?pageId=141\">Click for Website</a>","icon":"food","address":"212 High St","city":"Chattanooga","state":"TN","phone":"","zip":"37403","lat":35.054358,"lon":-85.305111},{"_id":"5386dc7c70720372cd00011a","con_id":"libertycon2015","name":"Pickle Barrel","subtitle":"<a href=\"http://www.goodfoodchattanooga.com/\">Click for Website</a>","icon":"food","address":"1012 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.044425,"lon":-85.309167},{"_id":"5386dc7c70720372cd00011b","con_id":"libertycon2015","name":"Tupelo Honey Cafe","subtitle":"<a href=\"https://tupelohoneycafe.com/location/chattanooga\">Click for Website</a>","icon":"food","address":"1110 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.042956,"lon":-85.308575},{"_id":"5386dc7c70720372cd00011c","con_id":"libertycon2015","name":"Warehouse Row Food Court","subtitle":"<a href=\"https://www.google.com/maps/place/Petunias+Silver+Jalepenos/@35.0426043\">Click for Website</a>","icon":"food","address":"1110 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.042529,"lon":-85.308741},{"_id":"5386dc7c70720372cd00011d","con_id":"libertycon2015","name":"Broad Street Grille","subtitle":"<a href=\"http://www.chattanooganhotel.com/\">Click for Website</a>","icon":"food","address":"1201 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.041136,"lon":-85.309629},{"_id":"5386dc7c70720372cd00011e","con_id":"libertycon2015","name":"Porker's BBQ","subtitle":"<a href=\"http://porkersbbq.com/\">Click for Website</a>","icon":"food","address":"1251 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.040511,"lon":-85.308196},{"_id":"5386dc7c70720372cd00011f","con_id":"libertycon2015","name":"Urban Stack Burgers","subtitle":"<a href=\"http://urbanstack.com/\">Click for Website</a>","icon":"food","address":"12 W 13th St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.039331,"lon":-85.308696},{"_id":"5386dc7c70720372cd000120","con_id":"libertycon2015","name":"Southern Star","subtitle":"<a href=\"http://www.southernstarrestaurant.com/\">Click for Website</a>","icon":"food","address":"1300 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.039469,"lon":-85.309981},{"_id":"5386dc7c70720372cd000121","con_id":"libertycon2015","name":"Mom's Italian Villa","subtitle":"<a href=\"https://www.google.com/maps/place/Mom's+Italian+Villa/@35.0402848\">Click for Website</a>","icon":"food","address":"1257 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.040294,"lon":-85.308087},{"_id":"5386dc7c70720372cd000122","con_id":"libertycon2015","name":"Blue Orleans Seafood","subtitle":"<a href=\"http://www.blueorleansdowntown.com/\">Click for Website</a>","icon":"food","address":"1463 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.036373,"lon":-85.307454},{"_id":"5386dc7c70720372cd000123","con_id":"libertycon2015","name":"Terminal Brewhouse","subtitle":"<a href=\"http://terminalbrewhouse.com/\">Click for Website</a>","icon":"beer","address":"6 E 14th St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.03667,"lon":-85.307101},{"_id":"5386dc7c70720372cd000124","con_id":"libertycon2015","name":"Gardens Restaurant","subtitle":"<a href=\"http://www.choochoo.com/gardensrestaurant.php?dest=44\">Click for Website</a>","icon":"food","address":"1400 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.037239,"lon":-85.306825},{"_id":"538d58fca8abe1b847000001","con_id":"libertycon2015","name":"Chattanooga Choo Choo","subtitle":"LibertyCon Host Hotel","icon":"hotel","address":"1400 Market St","city":"Chattanooga","state":"TN","zip":"37402","phone":"423-266-5000","website":"http://www.choochoo.com/","lat":35.036988,"lon":-85.306965},{"_id":"5386dc7c70720372cd0000ed","con_id":"libertycon2015","name":"Taco Mac","subtitle":"<a href=\"http://tacomac.com/\">Click for Website</a>","icon":"special","address":"423 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.051544,"lon":-85.309789},{"_id":"5386dc7c70720372cd0000ee","con_id":"libertycon2015","name":"Sticky Fingers","subtitle":"<a href=\"http://www.stickyfingers.com/\">Click for Website</a>","icon":"food","address":"420 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.051437,"lon":-85.310273},{"_id":"5386dc7c70720372cd0000ef","con_id":"libertycon2015","name":"Lupi's Pizza Pies","subtitle":"<a href=\"http://www.lupi.com/\">Click for Website</a>","icon":"food","address":"406 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.051934,"lon":-85.310429},{"_id":"5386dc7c70720372cd0000f0","con_id":"libertycon2015","name":"Mellow Mushroom","subtitle":"<a href=\"http://mellowmushroom.com/\">Click for Website</a>","icon":"food","address":"205 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.054246,"lon":-85.310923},{"_id":"5386dc7c70720372cd0000f1","con_id":"libertycon2015","name":"Cheeburger Cheeburger","subtitle":"<a href=\"http://cheeburger.com/home2/index.asp\">Click for Website</a>","icon":"food","address":"138 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.055,"lon":-85.309546},{"_id":"5386dc7c70720372cd0000f2","con_id":"libertycon2015","name":"Genghis Grill","subtitle":"<a href=\"http://www.genghisgrill.com/\">Click for Website</a>","icon":"food","address":"138-B Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.054923,"lon":-85.309548},{"_id":"5386dc7c70720372cd0000f3","con_id":"libertycon2015","name":"Thai Smile","subtitle":"<a href=\"https://www.google.com/maps/place/Thai+Smile/@35.0541169\">Click for Website</a>","icon":"food","address":"219 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.054133,"lon":-85.309895},{"_id":"5386dc7c70720372cd0000f4","con_id":"libertycon2015","name":"Bluewater Grill","subtitle":"<a href=\"http://www.bluewaterchattanooga.com/?pg=location&sub=loc&location_id=31\">Click for Website</a>","icon":"food","address":"224 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.053733,"lon":-85.310518},{"_id":"5386dc7c70720372cd0000f5","con_id":"libertycon2015","name":"The Blue Plate","subtitle":"<a href=\"http://www.theblueplate.info/site/\">Click for Website</a>","icon":"food","address":"191 Chestnut St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.055282,"lon":-85.311982},{"_id":"5386dc7c70720372cd0000f6","con_id":"libertycon2015","name":"Tennessee Aquarium","subtitle":"<a href=\"http://www.tnaqua.org/Home.aspx\">Click for Website</a>","icon":"special","address":"1 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.05583,"lon":-85.311048},{"_id":"5386dc7c70720372cd0000f7","con_id":"libertycon2015","name":"Tennessee Aquarium IMAX&reg;","subtitle":"<a href=\"http://www.tnaqua.org/IMAX/IMAX.aspx\">Click for Website</a>","icon":"special","address":"201 Chestnut St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.054478,"lon":-85.312177},{"_id":"5386dc7c70720372cd0000fc","con_id":"libertycon2015","name":"TGI Fridays","subtitle":"<a href=\"http://www.tgifridays.com/\">Click for Website</a>","icon":"food","address":"2 Broad St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.055313,"lon":-85.309883},{"_id":"5386dc7c70720372cd000125","con_id":"libertycon2015","name":"Station House Restaurant","subtitle":"<a href=\"http://www.choochoo.com/stationhouse.php?dest=41\">Click for Website</a>","icon":"food","address":"1400 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.036985,"lon":-85.306353},{"_id":"5386dc7c70720372cd000126","con_id":"libertycon2015","name":"CARTA Shuttle Terminal","subtitle":"<a href=\"http://www.downtownchattanooga.org/new/getting-around#\">Click for Website</a>","icon":"special","address":"1300 Market St","city":"Chattanooga","state":"TN","phone":"","zip":"37402","lat":35.038021,"lon":-85.307085},{"_id":"538d58fca8abe1b847000003","con_id":"libertycon2015","name":"Family Dollar","icon":"shopping","subtitle":"Grocery Store","address":"511 Market Street","city":"Chattanooga","state":"TN","zip":"37402","phone":"","website":"http://www.familydollar.com/pages/home.aspx","lat":35.050473,"lon":-85.310051},{"con_id":"libertycon2015","name":"Enzo's Market","icon":"shopping","subtitle":"<a href=\"http://enzosmarket.com\">Click for website</a>","address":"1501 Long St","city":"Chattanooga","state":"TN","zip":"37408","phone":"","lat":35.036435,"lon":-85.308391},{"con_id":"libertycon2015","name":"Walgreens","subtitle":"","icon":"shopping","address":"110 N. Market St","city":"Chattanooga","state":"TN","zip":"37405","phone":"","website":"http://www.walgreens.com/locator/Walgreens-110-N-MARKET-ST-CHATTANOOGA-TN-37405/id=7779?ext=Places_TN_Chattanooga_37405_7779","lat":35.062751,"lon":-85.308211},{"con_id":"libertycon2015","name":"Whole Foods Market","subtitle":"","icon":"shopping","address":"301 Manufacturers Road","city":"Chattanooga","state":"TN","zip":"37405","phone":"","website":"http://www.wholefoodsmarket.com/","lon":35.063173,"lat":-85.314181}],"meta":{"duration":-1466445665157}}